{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B016QXV2QK?reviewerType=all_reviews&pageNumber=3","asin":"B016QXV2QK","page":3,"pages":190,"reviews":[{"id":"R1CSGCR2DCPPS2","title":"5.0 out of 5 stars The best speaker I own to date…","author":"Nicole lopez","rating":5,"content":"I already have one that my ex bought me 13 years ago that’s right 13 years ago and it never went bad still holds it’s own against anything else… so I had to get a second one and bring the heat with them! I can combine them and level up my music!","timestamp":"Reviewed in the United States April 18, 2023","profile_id":"AEHTY62RUJBKU7VY34I3UYQDN7IA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"RPK8LMOBQ33B5","title":"5.0 out of 5 stars Yes! It is worth it!!!! Buy it.... you'll be happy you did","author":"NYC WDSTK JENNIFER","rating":5,"content":"Wow! That could be my whole review but just to put that into context, I've had about 10 portable Bluetooth speakers, usually attempting to find the best but cheap....well thats what I used to get, cheap ones that were the best amount cheap. But they just can't keep a charge (jbl) and take forever to charge and never sounded this good.Its able to be loud and powerful. And the music sounds better, like I can hear more of the songs details,not like it's just coming out of 1 speaker or something. I love listening to music loud.... and I haven't even heard this speaker at full volume bc there has been no need! Thats crazy to me.Soooooo impressedI got the white one bc im bored of black speakers and I just love it but that's personal preference.Would buy again but hope I don't need to.","timestamp":"Reviewed in the United States October 18, 2020","profile_id":"AHIK4P52QYCJEI3C7ZKDEP5E6QSA","is_verified":true,"helpful_count":2,"product_attributes":"Color: White"},{"id":"R2DQAQ3RL2II2V","title":"5.0 out of 5 stars Even better than our old jambox","author":"Chris","rating":5,"content":"We have a jambox original that we’ve had forever and love. One day when we turned it on however it sounded like the speaker was blown. After much research, I decided to get this to replace it. It’s a little bit bigger than the jambox, but still a nice compact size. It charges with a lightning cable, which is a nice feature for us, but would be a drawback if you’re not already using Apple products.One day I went to show someone what happened to our jambox, and as Murphy would have it, it turned on and worked fine. I paired both the jambox and the pill+ to my iPhone so I could switch between the two as I continuously played music and we all agreed the pill+ had much better sound quality. Now, even though our jambox works again, we always use the beats.","timestamp":"Reviewed in the United States July 24, 2020","profile_id":"AEVQN5XRWKZRQAYNJNHKACH5EOMQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RQJQ6PKGWO9PV","title":"4.0 out of 5 stars Amazing sound","author":"Amazon Customer","rating":4,"content":"I was looking for a good speaker that not only had great quality sound but was also made of amazing material. The sound is amazing, I am no professional musician or anything but for the average consumer the sound is excellent.The range is very great as well I can connect from my kitchen to my room, which is a good 25-30 ft away, and still be able to have a constant reliably connection. Battery life is amazing I am a average listener and this can last me on a full charge for about a week. The quality and the packaging of the device also makes the speaker feel very premium, which beats is known for. The design is elegant and sleek, making it a perfect addition to a desk or a night stand, but it can also be portable Beats have conveniently added a carrying sleeve and even added ports on the back to turn the speaker into a portable charger. Over all you cant go wrong with this product if you are looking for a good quality speaker and are a casual listener.","timestamp":"Reviewed in the United States November 27, 2016","profile_id":"AHLS3IUUEKAIK42VFWMWZN2GHQAA","is_verified":true,"helpful_count":18,"product_attributes":"Color: White"},{"id":"R3430B3F39GCEC","title":"4.0 out of 5 stars Works great!","author":"BSP","rating":4,"content":"Part of my job includes giving presentations on a regular basis. I wanted a compact blue tooth speaker that could deliver sound throughout an auditorium without a problem. I have used this for crowds of up to 200 participants and you can clearly hear it through out the room. It does an amazing job. The only thing that I don't like is that I have to make sure it's on prior to clicking on a video. It will automatically turn off if it's not used during a certain period of time (not sure, maybe 10 minutes?) My videos are embedded throughout the presentations, so it's not always in use. I've gotten to the point where I remember to make sure it's on, before clicking on the video slide, but things would flow better if I didn't have to do this.","timestamp":"Reviewed in the United States January 2, 2020","profile_id":"AHISN46CYDOATATCIHYVMSZLCZHA","is_verified":true,"helpful_count":2,"product_attributes":"Color: White"},{"id":"R1ES0Z5GMA7BJO","title":"3.0 out of 5 stars Good but does not replace the Pill XL.","author":"Abou Guindo","rating":3,"content":"I was one of those who own the Pill XL. When Apple call for the return of the item, I did not wanted to send it back because I was happy with it. Good sound, bass, treble ... You could even use it for parties with few friends specially when connected to an iPod Nano. The sounds was terrific. When I saw Apple released the Pill+ I decided to send it back and bought this ...Let's be honest, it is a good deal. I bought the XL for 230 Euros ( in Paris) and got paid back 300 Euros. The Pill+ was just 199 USD ( out of tax). The sound is good. Impressive sound for this size. Indeed, it is smaller, can be carried easily than the XL. I also found the treble better, the bass is OK but ... that is the problem ! It is just OK ! when we compared it to the XL there are so many things we miss. No way of having it in a room when you have more than 10/15 people talking ... what the Pill XL would do without \"sweating\" ...Oh ! One other thing, the application. It is probably the first time I delete an Apple made application. It is useless. The only thing it seems to be made for, is to make you buy a second Pill+ and I do not want to buy another one ! I found it a little bit exaggerate as a marketing strategy !To sum up, if you are looking for a good wireless audio thing, that is the Pill to buy. If you are looking for something to replace your Pill XL... Think again !","timestamp":"Reviewed in the United States March 23, 2016","profile_id":"AH4EHNNRSFHAVMSLM4F55KI2HMCQ","is_verified":true,"helpful_count":7,"product_attributes":"Color: Black"},{"id":"R3N4N5AJDJS9QZ","title":"5.0 out of 5 stars Beats!","author":"CF","rating":5,"content":"Just got this today and so far so good. Extremely easy to set up and sounds great! I went into a store to compare the sound of a few different comparable speakers and this one had the crispest sound and voice clarity. After seeing a bunch of reviews of comparison via youtube where they liked the other models better, I have to say you might want to go in and listen for yourself. Everybody hears and likes something different. I like very clear, crisp sound and this speaker delivers that over the other ones I listened to. This one is also all enclosed and gives the ability to charge something while this is plugged in, and I'm assuming while it is on battery mode. It's just an all-around clear, crisp compact, weighty, well made speaker.","timestamp":"Reviewed in the United States January 16, 2019","profile_id":"AEWDKKLCYHRJOPSYYELJ5FXHFADA","is_verified":true,"helpful_count":1,"product_attributes":"Color: White"},{"id":"R3V4RSDVPBJJ2S","title":"4.0 out of 5 stars Good quality for the price","author":"Brian E.","rating":4,"content":"My amazon order got lost in shipping but I did buy these from another retailer.I purchased 2 and pairing with my iPhone And ipad was a snap. The app making them work in stereo is easy to users well. These were a nice upgrade from my old bose speaker for the price. The sound quality is better than my old nose speaker but it’s not as good as the newer speakers but for the price and ease of use it was it was a good deal. Don’t get me wrong, these speakers do sound good; I am just a music nut and am pretty picky about sound quality. I am satisfied with them aster having them for a month now.","timestamp":"Reviewed in the United States May 18, 2020","profile_id":"AHADPON2ZSWLZQVKNVSLQT4CTIVQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1W74YFDQTCB6T","title":"5.0 out of 5 stars Big sound in a small package.","author":"JW","rating":5,"content":"I gave this to my wife as a gift. She uses it with her iPod Touch and has it set up in the kitchen so she can jam while her culinary creativity is flowing. I'm pretty impressed with the sound, especially considering how dinky the speakers are. I had my doubts when I bought this, but it sounds pretty good; a lot of response across the entire frequency range... maybe a little bass-heavy, but like I said, pretty impressive for a couple of tiny speakers.","timestamp":"Reviewed in the United States May 25, 2021","profile_id":"AEIMAOS463R6YKKYW4BRJN6QHOPA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2GUWI7S3U827X","title":"5.0 out of 5 stars Great product will never not recommend","author":"Nathaniel Pratz","rating":5,"content":"I adore the speaker I missed the boat on the original beats pill which I was sad about but when I heard they were coming out with the beats pill plus I immediately jumped on the wagon this pairs incredibly easy with your device especially if it’s Apple it doesn’t have the same pairing ability as AirPods or Powerbeats pro where you get a prompt on your Apple device and boom your paired it just pears easier with Apple devices then I would think an android you can still have the seamless transfer from one Apple device to another which is much appreciated","timestamp":"Reviewed in the United States January 13, 2021","profile_id":"AFMGLCE2HGVWXCBV4FZPTSWC5DBA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B016QXV2QK","product_name":"beats Pill Plus Portable Wireless Speaker - Stereo Bluetooth, 12 Hours of Listening Time, Microphone for Phone Calls - Black","parse_status_code":12000},"created_at":"2024-08-09 04:42:12","updated_at":"2024-08-09 04:42:37","page":3,"url":"https://www.amazon.com/product-reviews/B016QXV2QK?reviewerType=all_reviews&pageNumber=3","job_id":"7227534611209808897","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B016QXV2QK?reviewerType=all_reviews&pageNumber=4","asin":"B016QXV2QK","page":4,"pages":190,"reviews":[{"id":"R24SEZU9MGTQ2K","title":"4.0 out of 5 stars Cautious love","author":"CT","rating":4,"content":"Yesterday I wrote a frustrated review saying I couldn't get it to charge no matter what, but today I am changing my tune. Then it occurred to me to try using the wall plug instead of the USB cord to the computer... and it worked perfectly! Prior to that, I had gone on the website for help and they suggested resetting the device, which I also did (press the power button and hold for 3+ seconds). Not sure if that also helped. The sound quality and volume are great. It's sometimes hard to pair it with the computer for watching movies. That, and the recent trouble with charging are the reason I gave it 4 stars instead of 5.","timestamp":"Reviewed in the United States May 4, 2019","profile_id":"AHRIKWEEN737AC6Y3IMLUP7VC52A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Red"},{"id":"R3U4J0YTSGQKK9","title":"5.0 out of 5 stars Amazing product!","author":"Arturo Gonzalez Garza","rating":5,"content":"After 3 years of constant use, a lot of travel, use next to water , couple splashes, and drops, it stills working perfectly!Definitely one of the best products that beats has dropped!","timestamp":"Reviewed in the United States December 27, 2022","profile_id":"AGGDZ5XTCXRLEPLJWJRUI6YZZK7A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2MC4WA517L588","title":"4.0 out of 5 stars Volume control was frustrating","author":"Vanessa Miller","rating":4,"content":"As far as sound quality goes, it was awesome. Battery life was great. The only flaw was the sound control. We like to listen to music when we go to bed and it was impossible to find a happy medium between soft and loud. Low was too low and the next up was too loud. Seemed odd to have such a jump between volumes. Ended up returning it because of this. I really wanted to like it.","timestamp":"Reviewed in the United States March 18, 2021","profile_id":"AHPHSHJCFQLGFMPZL4FTBPDD2DPA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3F859GUJERAHG","title":"4.0 out of 5 stars Definately recommend buying, but easy to damage.","author":"Amazon Customer","rating":4,"content":"I would definitely recommend this to anybody interested in music or who listens to music on a daily basis. This speaker has the best sound quality I've ever heard from a Bluetooth speaker. It is, however, very easy to accidentally damage. After normal use, the (Product)Red finish began to scrape off of mine. Apple was quick to replace it for me then after a drop of about 4 feet, the new speaker was dented and finish was scraped off in spots. I definitely think if Apple makes a new version there should be something protruding further than the outer case to prevent damage to the main parts of the speaker.","timestamp":"Reviewed in the United States August 23, 2018","profile_id":"AFYL6KUNJXO2I4ONRNY6C6V7BXTQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Red"},{"id":"R2GDJYE8RNMRKF","title":"3.0 out of 5 stars Okay, but not worth the money","author":"Mark Neustadt","rating":3,"content":"The Beats PiLL+ (or whatever) is okay. It's not bad by any means. But there's no way it's worth this amount of money. First of all, it's not even as tall as a bottle of beer (or soda). No matter what the electronic mojo they try to pull, you just can't defeat physics.Beats is known for having pretty heavy bass. I have the Beats Studio headphones. Those things are A-MAZ-ING. Holy moly.. they're great. Based on the reputation of those headphones, I had high hopes for this portable speaker. Again, it's not bad, but you just can't get past the fact that the thing is small. You're not going to get huge, room filling sound from something this size.To reiterate, it's not bad at all. It actually sounds pretty decent. For the money though, there have to be better options. I bet BOSE has something that sounds at least as good but costs less. Or maybe costs $20 more but sounds twice as good. If you're devoted to Beats, this gets a three star \"it's okay\" rating. I would have happily paid a little more to get a better unit though.","timestamp":"Reviewed in the United States April 28, 2016","profile_id":"AG2MAFSGBZAJVCQV3OJPSGGX756A","is_verified":true,"helpful_count":27,"product_attributes":"Color: Black"},{"id":"R17SRT7SDJ0N39","title":"5.0 out of 5 stars Just a great sound.","author":"C2v","rating":5,"content":"This is such an improvement over the first generation Beat's Pill. I particularly like going into stereo mode with two of them, and was surprised at how well the sound covers an area (like my living room, or garage-shop when I'm out working on projects). The base response is also really nice. Going stereo requires an iPhone 6 or newer, and an app (free from Apple) to join the speakers. It can be a little cranky making the connection (a minor thing - just be patient), but the sound is well worth it!","timestamp":"Reviewed in the United States May 23, 2020","profile_id":"AF3IWMQNRNM6FM7YWB34ICA4CLAQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R30UH4H60QFLXT","title":"4.0 out of 5 stars Brand more than Sound.","author":"joshuaespinoza","rating":4,"content":"I’ve always wanted a beats pill so I knew I had to get one.Definitely paying for the brand more than the sound. The sound is decent. Turned up loud enough and the speakers go bad, like it can’t handle the volume.This is a very sensitive speaker. A couple of hits and dings, and you might find yourself looking up “Beats Pill back lights not working” or something like that.Overall, it’s a good 4/5. Probably could get a cheaper speaker with better sound.","timestamp":"Reviewed in the United States June 7, 2020","profile_id":"AFWAM4GZGWZ3ANBAXUASBJY7ESAQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3TS9AHXT181UV","title":"5.0 out of 5 stars So worth buying !!","author":"DM","rating":5,"content":"Just got my BEATS PILL+ and used it last night to watch football and hear the game in surround sound. I don't use cable so watching ESPN on my phone, the phone's speaker is not great, so this was a much needed upgrade & Improvement!! Even plugged phone into speaker to charge phone while watching the game....If you're looking for a awesome speaker and totally worth the money.... BUY THIS ONE!!And hard case for it is $10-12 dollars and will protect your speaker!!!","timestamp":"Reviewed in the United States November 3, 2020","profile_id":"AGSSZREUIL7HJ6VQYPESSN2MTQ3A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R304J1D1XF5RHD","title":"4.0 out of 5 stars Good portable speaker\\charger to have","author":"Pedram Salamati","rating":4,"content":"I had a BoseMini that stoped working after 3 years. I am a fan of Beats and decided to get this product instead of ordering another Bose.Overall it’s a great portable speaker and capability to charge other devices definitely adds value into it. It has a long battery life and you can have it use for long time until requiring charge but sound quality isn’t the best. Although serves the Purpose and I suggest it base on price.","timestamp":"Reviewed in the United States October 17, 2020","profile_id":"AHR7CLNVBOXGOE7JC4DIWLQIU63Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R37049Q2735C1J","title":"5.0 out of 5 stars Works as Advertised","author":"Tom Waldron","rating":5,"content":"This portable Bluetooth speaker is a dream. I use it when playing TomPlay music on my iPad. There adjustable volume is great. Don't expect it to fill a large room. It works great in a smaller setting. It is easy to charge and connected to my iPad 12 with ease. It is durable and you can tell by the weight it is a well built device. It works great with audio books as well.","timestamp":"Reviewed in the United States April 29, 2021","profile_id":"AFT6BN5ANN4NJHMFOW6IVAD2CDRA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B016QXV2QK","product_name":"beats Pill Plus Portable Wireless Speaker - Stereo Bluetooth, 12 Hours of Listening Time, Microphone for Phone Calls - Black","parse_status_code":12000},"created_at":"2024-08-09 04:42:12","updated_at":"2024-08-09 04:42:38","page":4,"url":"https://www.amazon.com/product-reviews/B016QXV2QK?reviewerType=all_reviews&pageNumber=4","job_id":"7227534611209808897","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B016QXV2QK?reviewerType=all_reviews&pageNumber=5","asin":"B016QXV2QK","page":5,"pages":190,"reviews":[{"id":"RBTD3MTBM5K4H","title":"4.0 out of 5 stars Great speaker!","author":"abraham","rating":4,"content":"I use this EVERYWHERE from camping to car washes! Water shooting towards it, the SUPER hot sun on it while playing and it’s still going!","timestamp":"Reviewed in the United States May 7, 2022","profile_id":"AFDT3MFHWQKUPTMGB26GE2BNIJVA","is_verified":true,"product_attributes":"Color: Red"},{"id":"R3HFA8FJHYBJMI","title":"5.0 out of 5 stars Loud, clear, no lag","author":"kimberly","rating":5,"content":"I like LOUD and this is the smallest speaker I've used that reaches the volume and bass I crave. I stay in campgrounds a lot and have to be careful I'm not bothering others with it near full volume. I got it on sale so I'm REALLY happy with this purchase. Doesn’t lag when using bluetooth like my Anker’s did. Doesn’t hurt the charger is compatible with my iPhone either. After loving this speaker for a few months, I felt compelled to leave a review.","timestamp":"Reviewed in the United States June 21, 2020","profile_id":"AEP4JK6UCHUJHJCPUPFBKBON4C6A","is_verified":true,"product_attributes":"Color: Black"},{"id":"RP8GOOLI0HEU0","title":"5.0 out of 5 stars 💯","author":"Manpreet singh","rating":5,"content":"💯","timestamp":"Reviewed in the United States June 4, 2023","profile_id":"AEIPNUWJ7PEEBEPV5VANMYNLUVAQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R35NJP1EV0SGD6","title":"5.0 out of 5 stars I love my beats so much I bought it twice!","author":"Threes Up","rating":5,"content":"A lot of wonderful bark coming from these little puppies. You can feel the heft but still very portable in a back pack. I listen to lots of Jaxx (old and new school), Hip Hop, Reggae, and Afrobeat - these genres sound wonderful on the Pill. However, \"the pill\" somehow convinced me to conceive all over again so I bought a second Pill to pair. I haven't tested it out yet but looking forward to seeing what they can do in tandem.","timestamp":"Reviewed in the United States September 14, 2020","profile_id":"AFXRUK7KFIPP44PBEYXLEWCHG2WQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2ZVY1RXBAKAOS","title":"5.0 out of 5 stars Amazing sound","author":"Christian Flaten","rating":5,"content":"I've had the pill+ for about a week now and LOVE it! I was debating between this and the UE Boom 2 and am very happy with my choice as I like just bringing my lightning cable, phone, and pill+ with me and not having to worry about an extra mini usb cable also. The form factor is awesome and the all black looks sexy. Sound quality is on point. I've used this outside by the beach with waves rolling in and I can still hear it crystal clear. Been listening to a lot of Kygo lately too and the bass sounds even better than on my car! Been listening to Beats 1 radio a lot on this and just super stoked! If you get this you won't be disappointed :)","timestamp":"Reviewed in the United States March 25, 2016","profile_id":"AH5YKIDSLHK7MBRFEKUHZNUQKGPA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R1JA6Z251OVHB","title":"5.0 out of 5 stars Excellent speaker","author":"TJ Online Shop","rating":5,"content":"This is an excellent speaker, I've had it for over three years and it hasn't given me any problems, it sounds great.","timestamp":"Reviewed in the United States December 15, 2022","profile_id":"AGMMYQACAQFN7K36YQKLWZCB54LQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R302JCBFDOG67K","title":"5.0 out of 5 stars Good for any occasion.","author":"Jesse","rating":5,"content":"There are skins you can customize these speakers with to make it unique. I bought two and both still work great. Also bought a case for storage. Would definitely recommend for a gift or yourself!","timestamp":"Reviewed in the United States June 29, 2022","profile_id":"AFMZML4BJM3NC44LNN6IN44FHFMA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2IJUL4HP70FXE","title":"5.0 out of 5 stars Excellent sound quality and footprint","author":"Joseph","rating":5,"content":"Amazing little box! The sound quality is exactly what I was after. Crisp and good bass. Easy to turn on and off, and if you leave it on and forget to turn off, it'll remember to turn off and disconnect from Bluetooth for you. But the key was excellent sound quality. Highly recommend for this form factor. Not to mention the white one is very stylish.","timestamp":"Reviewed in the United States May 31, 2021","profile_id":"AFSEP64G3F4ZKQ3YE53TPMVP73TA","is_verified":true,"product_attributes":"Color: White"},{"id":"R10TGJT11DYVA4","title":"5.0 out of 5 stars THE SOUND","author":"Shrimp","rating":5,"content":"Speaker was awesome and audio quality is amazing I bought it so I could here music while driving a tractor and it was definitely worth the buy I could hear the engine noise but still hear the music flowing through the speaker I greatly recommend this to anyone(Update April 29,2021 speaker still works great 🤣 its in really poor condition from me dropping it off heights, trailers ,its been in water but the it just doesn't wanna die will definitely buy another one when the one I have passes.","timestamp":"Reviewed in the United States September 6, 2019","profile_id":"AHEMEGEWOV7NTMWP3LTYCDO7LOOQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3J6GXI88H9BID","title":"5.0 out of 5 stars We love it! Sounds amazing!","author":"Sandy","rating":5,"content":"This was a gift for my husband & makes 3 in our house! The sound quality is just amazing. Battery lasts a long time and it’s very portable… It’s gone with us many places and it’s on its way to the beach! Highly recommend great product! Love that I was able to get a better price on the black one.","timestamp":"Reviewed in the United States May 26, 2021","profile_id":"AFG2WTCBA33GO6X5SCYWIVBP6HTQ","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B016QXV2QK","product_name":"beats Pill Plus Portable Wireless Speaker - Stereo Bluetooth, 12 Hours of Listening Time, Microphone for Phone Calls - Black","parse_status_code":12000},"created_at":"2024-08-09 04:42:12","updated_at":"2024-08-09 04:42:39","page":5,"url":"https://www.amazon.com/product-reviews/B016QXV2QK?reviewerType=all_reviews&pageNumber=5","job_id":"7227534611209808897","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B016QXV2QK?reviewerType=all_reviews&pageNumber=6","asin":"B016QXV2QK","page":6,"pages":190,"reviews":[{"id":"R11TWPIM165PAS","title":"5.0 out of 5 stars JBL Who???","author":"Phillip","rating":5,"content":"I love it!! I bought the JBL Charge 4 and I returned it because the battery stopped charging after 3 weeks and the sound wasn't very good. I decided to try out the Beats Pill+ and the sound quality is so much clearer than the JBL. Not to mention, it's way more aesthetically pleasing than the JBL. I definitely recommended getting one of these.","timestamp":"Reviewed in the United States May 13, 2021","profile_id":"AGFEKWEEJXSI4XG3K5ESONNEJO3A","is_verified":true,"helpful_count":1,"product_attributes":"Color: White"},{"id":"R3RFZVNVC6PUU7","title":"5.0 out of 5 stars I love it😀","author":"Tia","rating":5,"content":"My CD player in my SUV doesn't work so I purchased a beats pill to play music on. Let me tell you, I am SO glad I did! It works great, I love how easy it is to use and I can control everything from my iPhone. Good product and great investment. It comes with a really nice charger which doubles as an iPhone charger if need be. The white carry case included works great for carrying my beats around. Especially when I toss it in my purse; it's great for protecting my beats from dust. Oh and I can't forget to mention the sound quality is EXCELLENT. If you're considering a convention coordlees speaker with exceptionally good battery life, buy this one!","timestamp":"Reviewed in the United States July 7, 2016","profile_id":"AGQ6QDYRBRZH6NI3GHCDNW2VGYGQ","is_verified":true,"product_attributes":"Color: White"},{"id":"R37H0DIK65ZQL2","title":"5.0 out of 5 stars Nice Speaker!","author":"Red","rating":5,"content":"This is my first Pill. Has a nice sound and easily pairs with new-ish devices (had an issue connecting with an older fire tablet 🤷‍♀️). It is an apple device so it uses the same charger as current apple products. It quickly charges and holds charge for a long time even when regularly used. Only downside is the \"portability\" of this. I don't just want to toss it in my backpack so I recommend ordering the carrying case to keep it safe when traveling.","timestamp":"Reviewed in the United States December 30, 2019","profile_id":"AHF4M246QE6PQG4EVPCSNM3KEC2A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R5X65FYTE9NHD","title":"5.0 out of 5 stars Excellent product, Fast shipping!!","author":"Ashley","rating":5,"content":"This was a gift for my son, he loved it and shipping was super fast!!","timestamp":"Reviewed in the United States December 26, 2022","profile_id":"AFIHATZ3CGXJNAYL5O2ZMD4QMZCQ","is_verified":true,"product_attributes":"Color: Red"},{"id":"R30215WZO7D9EF","title":"5.0 out of 5 stars Love My Bests Pill","author":"VetaB","rating":5,"content":"I love the sound, portability, and the smallness of The Beats Pill. When I turn up the volume you can hear it clearly up and downstairs. I have it loud because it sounds amazing. Best purchase I've made in a long time. Easy to get it playing right away. Yes, I highly recommend Beats Pill.","timestamp":"Reviewed in the United States June 2, 2021","profile_id":"AG442SLUACBZ3TKIXXGZUDOM26BQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R456WTBYM9IC5","title":"5.0 out of 5 stars Great speaker","author":"J oan Daniels","rating":5,"content":"This speaker produces great sound for music and the spoken word. It very easily paired with my Samsung television.","timestamp":"Reviewed in the United States October 19, 2022","profile_id":"AFUFEQFRUO4ERCCNTNAQDDW2QHSQ","is_verified":true,"product_attributes":"Color: White"},{"id":"R1DMNX2O4PANWN","title":"5.0 out of 5 stars All around a better speaker","author":"D. Young","rating":5,"content":"Absolutely the loudest, I love it. This speaker really gets loud, I have the Beats Pill 2.0 the first one and it was great and didn’t give me any problems but I wanted the newer one bc it wasn’t loud enough so I ordered it last week. It finally arrived yesterday after some shipping delays but it was well worth the wait. I set it up and now I’m enjoying it, the battery last longer, the sound is much clearer, the pill XL lives up to all the good reviews. I like the design better and it’s almost twice the size of the other pill. I just love it.","timestamp":"Reviewed in the United States February 23, 2018","profile_id":"AG6A6B6G7LNS4U4JAJZXXV5V2K6Q","is_verified":true,"helpful_count":44,"product_attributes":"Color: Black"},{"id":"R13TKTMBVY99PI","title":"5.0 out of 5 stars Loud and clear bass sound !!","author":"Amazon Customer","rating":5,"content":"Great productI been using for a few months and sounds like a big bass speaker better than boss or jbl used by close friends when hanging out at the patio.Really love the sound and the easy syncronising with my work iPhone and my personal androidIt's worth it !!!!","timestamp":"Reviewed in the United States July 15, 2021","profile_id":"AEY6QVBAG4MJAMX7B3KS23GCNCFA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RRLOVCX7RI8WH","title":"5.0 out of 5 stars You will NOT be disappointed. (I’ve bought 2 within 5 days)","author":"Kelsey Miller","rating":5,"content":"I received this last Friday and I’ve already bought another one. The sound quality... you can’t beat(literally haha) especially for the price. I got it in white and it’s so beautiful. I had honestly never heard of this brand of speaker before but I’m so glad Amazon had it advertised on my homepage. I’m beyond impressed with everything. I have a lot of different speakers.. this is definitely my favorite and it’s one of the cheapest ones I have bought. It truly blows my mind. I couldn’t be happier with my purchase.","timestamp":"Reviewed in the United States January 24, 2019","profile_id":"AGSJ6STIAYR7NHKPJ7G5FAGR4ZSQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: White"},{"id":"R3K1Y55ZM9GNJ9","title":"1.0 out of 5 stars Back to R&D!","author":"Robert Johnson","rating":1,"content":"Horrible at precise sound control! One click on this thing effectively doubles the sound at low volume, so getting that level juuuuuuuuuuuust right at work is impossible. The sound adjustments are not smooth! That is incredibly disappointing! Like it increments sound in some percentacge, wtf, Dre? LolAlso thanks for the cheap metal speaker covers. Protective, yes. From the 30’s? Yes. Its 2019, use better materials. Some places they went cheap others they went all out on. Speaker, needs work.The app is useless as well.Update: You cannot have an audio jack plugged in and be connected to bluetooth at the same time........Im disappointed and if I can find one that’ll do what I want(more control over volume, better interface options).Sad.Yet another update. The button to skip forward, play, or pause is too stiff. There is no descernable click or acknowledgedment that the speaker has done what you want, so one will hit the button twice to skip a song, instead only one button press will register and the speaker will pause. So i have to play by pressing once, then skip by pressing twice. The whole evolution goes something like this: I need to skip a song so i press the button twice, only one registers and the song stops. Need to play first before skipping, so hit the button once, song plays, then hit the button twice, tada! The thing you wanted! And all for 125 bucks?If I hadnt thrown away the packaging i would return this POS.","timestamp":"Reviewed in the United States January 30, 2019","profile_id":"AF2X7WUO7GYXB6KN5F5PMLLT3JRQ","is_verified":true,"helpful_count":86,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B016QXV2QK","product_name":"beats Pill Plus Portable Wireless Speaker - Stereo Bluetooth, 12 Hours of Listening Time, Microphone for Phone Calls - Black","parse_status_code":12000},"created_at":"2024-08-09 04:42:12","updated_at":"2024-08-09 04:42:40","page":6,"url":"https://www.amazon.com/product-reviews/B016QXV2QK?reviewerType=all_reviews&pageNumber=6","job_id":"7227534611209808897","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B016QXV2QK?reviewerType=all_reviews&pageNumber=7","asin":"B016QXV2QK","page":7,"pages":190,"reviews":[{"id":"R1BF46K8IHI70V","title":"5.0 out of 5 stars Awesome speaker","author":"Charles Crocker jr","rating":5,"content":"Love this speaker, it's tough, sounds great , connects to my phone instantly whenever I turn it on and is very loud. Still holds charge and doesn't miss a beat definitely recommend I would def make the purchase again","timestamp":"Reviewed in the United States January 5, 2022","profile_id":"AFWOTUSLUXXQ6HQB7XL6WBBBAXPA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2BJA56GNPKRBI","title":"4.0 out of 5 stars Not super loud","author":"Keith Dimas","rating":4,"content":"It is a crisp sound but honestly it isin’t as loud as my old jbl flip 5 which is why I give this 4 stars very sturdy speaker have dropped it multiple times and it still sounds good!","timestamp":"Reviewed in the United States June 20, 2021","profile_id":"AHLAZ3SIRNLSCOSNFXCFJJKTPSTQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RULEKMY1G079X","title":"5.0 out of 5 stars The Sound is Amazing","author":"S. Dunn","rating":5,"content":"I love my beats pill + it is compact but the sound is amazing. I did learn it will pair faster if you are playing music that has been downloaded to your phone or tablet. This item is great if you don't have a lot of room or if you don't want to invest in a stereo, and you can't take your stereo with you. I love this is portable. I highly recommend this product.","timestamp":"Reviewed in the United States February 11, 2020","profile_id":"AH3KYM6ZSO3UBAQ4TOR6SR3EC6MA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1QJCYLEDLYLVZ","title":"5.0 out of 5 stars The best sounds !!! loud.","author":"Kenneth Schneider Photography","rating":5,"content":"I bought this speaker after buying a cheap speaker. That one broke after 90 days . I love how loud this speaker can sound. I am a trucker and use it in my truck. You get what you give. I mean if you buy cheap knockoffs…. They are going to break down sooner. And waste more money.","timestamp":"Reviewed in the United States May 10, 2021","profile_id":"AGGEETQZ34I7V4KG6UE5JQUDXH5A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Red"},{"id":"R3BCOYOMPEN73F","title":"5.0 out of 5 stars Get it! Worth every cent!","author":"Fred","rating":5,"content":"One of my best Amazon purchases! It’s genuine Beats and after an initial two hour charge, I linked it to my iPhone X and it sounds amazing. I can hear the music throughout the first floor of my house and I didn’t even turn it up all the way. My only suggestion is to buy the white Beats Plus because the red one is $50 more for some reason. If you get this, you’ll love it. I’ve had other Bluetooth speakers before but this is hands down the best for the price.","timestamp":"Reviewed in the United States December 27, 2018","profile_id":"AEVFSNN46CIMUNFJANY67UHCB5EA","is_verified":true,"helpful_count":13,"product_attributes":"Color: White"},{"id":"R2Q2BJU09D40HU","title":"5.0 out of 5 stars Beats Pill","author":"Veldatheresa","rating":5,"content":"I use this sounds system almost everyday. The sound is very good. Absolutely no static. The music fills the entire room like a surround sound. I also use the pill for conference calls so I can multiple task. In addition to the Pill is used when watching movies on my phone has excellent sound for movies.","timestamp":"Reviewed in the United States August 14, 2020","profile_id":"AEJU3Z6HDAERETMYI2CXBQVPPDFA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2X76UKGJB1QJA","title":"5.0 out of 5 stars Great Speaker with Useful Features","author":"Andy","rating":5,"content":"This is a great speaker for the price. It has good sound quality and volume for the size. Battery life is also really good. This speaker is especially useful for me as an iPhone user because it uses the same type of Lightning port as my phone to charge, which means I only need to bring one type of cable when I travel with it. It also has an USB-A port to charge my phone (acting like a battery pack).","timestamp":"Reviewed in the United States October 5, 2019","profile_id":"AHJHBWYCF2MKPNFOXORJXT75XWXQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R37IHU7KHQGR3X","title":"5.0 out of 5 stars Beats is the BEST","author":"Betty","rating":5,"content":"The best bluetooth speaker around as far as portability and base quality!","timestamp":"Reviewed in the United States December 7, 2022","profile_id":"AE5XGAS5WBWL25MZXA6R72K72Y5A","is_verified":true,"product_attributes":"Color: Red"},{"id":"R3F832R4US9NH6","title":"4.0 out of 5 stars Beats Bar to Increase volume","author":"Amazon Customer","rating":4,"content":"Once I got it charged and working, I used it when I was watching Netflix movies on my Apple computer. I am very hard of hearing and often the words are far too soft for me to hear with full volume on the p.c. I used this and I could hear what was being said. So far, so good - it is helping me hear.","timestamp":"Reviewed in the United States June 15, 2019","profile_id":"AFM2MM3LMRUTU73G76X2JLEOBB6Q","is_verified":true,"product_attributes":"Color: Red"},{"id":"RAU1F5ML2CILO","title":"5.0 out of 5 stars I got this over a year ago for under $130","author":"Amazon Customer","rating":5,"content":"It’s awesome for the money I paid for it ($130) even would have paid a little more. Now I see them going for over $400 and I just can’t justify that in my head","timestamp":"Reviewed in the United States January 6, 2022","profile_id":"AENG55UPZH5EIBDAXPEFRYQHUG4A","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B016QXV2QK","product_name":"beats Pill Plus Portable Wireless Speaker - Stereo Bluetooth, 12 Hours of Listening Time, Microphone for Phone Calls - Black","parse_status_code":12000},"created_at":"2024-08-09 04:42:12","updated_at":"2024-08-09 04:42:40","page":7,"url":"https://www.amazon.com/product-reviews/B016QXV2QK?reviewerType=all_reviews&pageNumber=7","job_id":"7227534611209808897","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B016QXV2QK?reviewerType=all_reviews&pageNumber=8","asin":"B016QXV2QK","page":8,"pages":190,"reviews":[{"id":"REZGNHD69VCAI","title":"4.0 out of 5 stars Beats Pill+ Portable Bluetooth Speaker","author":"Antonio","rating":4,"content":"My new Beats Pill+ is a marvel in audio engineering and design. It's feel and weight alone let a purchaser know that she/he has a quality product in hand. Set-up is simple and direct and leads to a near instant listening experiences. Sound quality is close to perfect and much higher than one would expect from such a small unit. I would recommend the Pill+ to anyone..","timestamp":"Reviewed in the United States July 21, 2019","profile_id":"AGGTABHXON4C7ZSJOLOEV557WASQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R18DHG62ZG1VJP","title":"5.0 out of 5 stars Sounds great!","author":"Ray","rating":5,"content":"I think this is a great little speaker for it's size. It's a great upgrade over the speakers in my laptop. Easy to move it around to wherever you're at and take it with you too. Easy to operate, syncs right up to computers or phones, at least the Apple one's I use.","timestamp":"Reviewed in the United States May 5, 2021","profile_id":"AGS7BI4TLDJUWG4QWQ6VV7MVV7QQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RZ1GZVLHW2KSP","title":"5.0 out of 5 stars Left in the rain for a week- no change","author":"dw","rating":5,"content":"I bring this speaker everywhere with me. I bring it when I shower or when I go anywhere. Once I left it outside and I lost it. It rained on and off for about a week and I eventually rediscovered it and I found that it was still in perfect condition. I have had it for about three years and the sound quality and battery life are still extremely strong. I love it","timestamp":"Reviewed in the United States December 27, 2019","profile_id":"AECWFKWH4M7EMSMUV3SCS4KFC2EA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1RSL4D0A2RJX","title":"4.0 out of 5 stars Love","author":"Felisha morante","rating":4,"content":"Me and my husband love it! Had first generation of Beats Pill. So upgrading to this was awesome. The look is better. It’s heavy. Good battery life so far.","timestamp":"Reviewed in the United States June 16, 2021","profile_id":"AFW3RWSB6JJEGVAF5G54HLQLP2JQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1W8X9HAIW286","title":"5.0 out of 5 stars Way better than Bose","author":"Cassie","rating":5,"content":"I bought this beats pill after giving away my Bose sound link 2. I thought my Bose was a good speaker and would get the job done delivering great sound until I got this one. I did a side by side and the beats delivers 10X better. It’s more crisp, clear and louder. It made the Bose sound muffled when comparing them. The beats are definitely designed to deliver sound !","timestamp":"Reviewed in the United States February 11, 2020","profile_id":"AF42KLTYY7XQ7IDEJUHPOXBOUEYQ","is_verified":true,"product_attributes":"Color: White"},{"id":"R1RQR6GKFK00K7","title":"5.0 out of 5 stars the best ever love it love it","author":"Vovo 👑","rating":5,"content":"I would recommend the beats pill + to all ages, I am 69 years old and I love this speaker it sounds like my old school stereo with big speakers I can't say enough about it and I have to have it loud when I play my music, you would not regret getting it. I would have put a picture of it but not very good with computer. thank you oh and I got the red one and it wasn't expensive.","timestamp":"Reviewed in the United States January 22, 2019","profile_id":"AGRIFQVOWVQTNVMFNJUZKPFS7S6A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Red"},{"id":"R2EVUOHH3EQ14G","title":"5.0 out of 5 stars It's Beats","author":"Brad","rating":5,"content":"I had this for over a year, great sound quality.","timestamp":"Reviewed in the United States November 11, 2022","profile_id":"AF2ORYSOWMZYVPS2UJISL3LIJI3A","is_verified":true,"product_attributes":"Color: White"},{"id":"RGII49UWHBH9B","title":"5.0 out of 5 stars Excellent Portable Wireless Speaker","author":"Helmer Moreno","rating":5,"content":"It works great if you are looking for great sound at Wireless Speaker, be aware that if you are looking for a monstrous sound (you can hear your music at 50 yards away) this speaker is not for you, but if you enjoy the music and you are looking for a great quality sound, then this speaker is for you and it is a great option","timestamp":"Reviewed in the United States May 22, 2020","profile_id":"AEALN6LGZNPN3FPFIM5W62GHJXNA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R10OQYA1UAUBGL","title":"4.0 out of 5 stars Sounds great. It has good sound","author":"Chris&Tasha","rating":4,"content":"Sounds great. It has good sound. It gets pretty loud. Depends on your sound preference though of course. Good for a gathering. I recommend the beats pill.Update: The device is not waterproof. I have a cat and she knocked it over into the dogs water bowl. It was not in there long at all. Since then I have left it in a bag of rice for a week now. And it does not work or charge.","timestamp":"Reviewed in the United States February 13, 2018","profile_id":"AEXVS6RWKXEJTYYSPQO5B62YYBFQ","is_verified":true,"helpful_count":5,"product_attributes":"Color: White"},{"id":"R3DQRWA6S5HEUP","title":"5.0 out of 5 stars Its 2 n 1","author":"logan tracy","rating":5,"content":"I have had this bluetooth speaker from a year ago it's been great it's a walmart product. I had got this beats pill+ because I felt like I was getting enough bass. So now that I got this neat pill+ I barely turn it up and it's amazing. I cant complian I actually recommend getting this if you enjoy cruising on your bike and bumping them tunes. This is the one to get for sure.","timestamp":"Reviewed in the United States August 15, 2019","profile_id":"AF2V7MIV63LROADIKY5CCEWA64XA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B016QXV2QK","product_name":"beats Pill Plus Portable Wireless Speaker - Stereo Bluetooth, 12 Hours of Listening Time, Microphone for Phone Calls - Black","parse_status_code":12000},"created_at":"2024-08-09 04:42:12","updated_at":"2024-08-09 04:42:41","page":8,"url":"https://www.amazon.com/product-reviews/B016QXV2QK?reviewerType=all_reviews&pageNumber=8","job_id":"7227534611209808897","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B016QXV2QK?reviewerType=all_reviews&pageNumber=9","asin":"B016QXV2QK","page":9,"pages":190,"reviews":[{"id":"R1O71MO761AA4K","title":"3.0 out of 5 stars Ugh😩","author":"Amber M","rating":3,"content":"Doesn't go as loud as I'd hoped and it barely has any bass at all. I guess this speaker is ok for a group of 8-11yr olds who are practicing for the school talent show in an empty parking lot, however... aside from the durability of the physical product, this speaker is NOT worth more than $40 (because I've bought an off brand speaker FOR $40 and although it currently is broken and will randomly shut off AND is no longer particularly \"wireless\" since it no longer works when it's unplugged😧..That broken, generic speaker is STILL a Better box than this Beats speaker (and that's sad).I was gonna return it but because I have such a bad history with electronics breaking (headphones, speakers, tablets,etc) and me having NO Back up😔...I've decided to just try out a Bose speaker but keep this Beats speaker on deck as a back up in case the Bose shorts out or something.But otherwise... I hate to say it but I wouldn't recommend this product. This speaker is priced wayyyyy too high for the overall quality of the sound to be this bad☹","timestamp":"Reviewed in the United States January 10, 2018","profile_id":"AEOXOXGNVEDFLVI6I2QWXE5ACTCA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R1S3A26ATV3Z01","title":"5.0 out of 5 stars Absolutely amazing!","author":"Abhirup C","rating":5,"content":"I am writing this review after using the product for 2 years and I can with complete assurance say, it’ll be one of your best purchases! Very portable, good battery capacity, and most importantly- rich sound! Beats is simply the best!","timestamp":"Reviewed in the United States August 7, 2021","profile_id":"AFQGP477FSQMRDLELNADV62LCFRQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1VLXPI3I45D1M","title":"5.0 out of 5 stars Insane sound, great quality!","author":"Caroline Perry","rating":5,"content":"Amazing! I’ve always bought products by Beats. I had the original beats pill when it first came out, but the sound quality with this new one is insane! Compared to the later addition it is so much more louder and crisp. Bass is awesome and it’s a vibe for sure. Battery life is great! Overall highly recommend purchasing it. Worth the money!","timestamp":"Reviewed in the United States September 9, 2020","profile_id":"AEHTZG7APYKD3O4FUJUW6V6UKOZQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R33KML5D4XMDAN","title":"5.0 out of 5 stars Small but powerful","author":"Jansen Manuel","rating":5,"content":"This is hands down one of the best portable speakers on the market. Small but powerful sound, I could even here it well on the 2nd floor of my house when I left it in the kitchen downstairs.","timestamp":"Reviewed in the United States September 12, 2021","profile_id":"AEED3L22HTJS6RLFRPFCZWWCZ5TA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2YS533SLEC2BN","title":"5.0 out of 5 stars Great quality and sound","author":"Allison","rating":5,"content":"The only hung my son requested for Christmas. I price shopped for several weeks before finally ordering from Amazon. My son is over the moon happy with this. I was surprised how substantial it felt...I’m used to cheap plastic that will crack if dropped from a few feet. This speaker feels like it will last. My son said the sound quality is amazing...and I will attest that I can hear/feel the bass from across the house and through several floors.","timestamp":"Reviewed in the United States December 28, 2018","profile_id":"AFQ4JK5NL4XNAQWSZ6EKBYDMUHUQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2THKVQ3S1V0VC","title":"5.0 out of 5 stars AMAZING","author":"Keimoney","rating":5,"content":"This product is great. Came in the actual beats pill+ professional looking box, came with a beats charger and a beats wall plug in, and the pill was rapped up in all of its original packaging. The sound quality is great just like the beats headphones as well!! I have no complaints!!!! It’s also great because the pill+ charges with ANY iPhone charger!!!! It can also charge your phone. I LOVE IT","timestamp":"Reviewed in the United States September 7, 2019","profile_id":"AGJ6NWCCKKECD4IK2LTHWQYVBBAQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R1U1H4SQ9RSUBA","title":"5.0 out of 5 stars Take good care of Your Products Especially Beats Products","author":"Roger","rating":5,"content":"The Beats Pill sound is great bass is great loud like it should be and charges pretty good Bluetooth works well even audio cord which not included but I have one beats studio 3 cord so its compatible but you may hear static etc details overall works and recommend to anyone","timestamp":"Reviewed in the United States March 16, 2021","profile_id":"AFIYET7NJJ32KKID5ULU2GUDXKMQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1RIZIZ66HBY5Q","title":"4.0 out of 5 stars High quality, great sound, excellent battery life.","author":"TWISM","rating":4,"content":"This Pill has some serious weight to it. It has great build quality and the sound is excellent. I do notice at times it can be a bit heavy on the bass but that is to be expected on Beats products. It gets quite loud and stays pretty distortion free. If you are looking for something to use on the go this would be a great addition.","timestamp":"Reviewed in the United States August 29, 2018","profile_id":"AGXHA6WACKQEBBS2JLBEWDYDG5JA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2AH2QHTV1KCU3","title":"5.0 out of 5 stars Amazing sound quality and i can take it anywhere and connect with other pills to amplify sound","author":"Amazon Customer","rating":5,"content":"Love this speaker to life, Dr. Dre is the best and his speaker doesn’t fall short from his greatness not by an inch, All the others don’t nearly stand in the same league as this speaker when it comes to sound quality and size lol. I’d buy five more than a huge inconvenient speaker if i want to throw a huge party!!!","timestamp":"Reviewed in the United States June 24, 2020","profile_id":"AEBLUD5WV4SGXYKJ354UTHRT6JEA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3JGJTOIRRDVA5","title":"5.0 out of 5 stars Great Purchase","author":"Alex","rating":5,"content":"After my first generation beats pill started to age I needed a new speaker I can carry to the tennis courts. I love the look but at the same time I love the battery life, after a long day of tennis the battery only went down one level. The sound is good, could be louder. The portability is amazing!","timestamp":"Reviewed in the United States September 11, 2020","profile_id":"AFB5AC67R6RRJEDZ2ITJ4JWNUZIQ","is_verified":true,"product_attributes":"Color: White"}],"page_type":"Question","asin_in_url":"B016QXV2QK","product_name":"beats Pill Plus Portable Wireless Speaker - Stereo Bluetooth, 12 Hours of Listening Time, Microphone for Phone Calls - Black","parse_status_code":12000},"created_at":"2024-08-09 04:42:12","updated_at":"2024-08-09 04:42:42","page":9,"url":"https://www.amazon.com/product-reviews/B016QXV2QK?reviewerType=all_reviews&pageNumber=9","job_id":"7227534611209808897","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B016QXV2QK?reviewerType=all_reviews&pageNumber=10","asin":"B016QXV2QK","page":10,"pages":1,"reviews":[{"id":"R8AAJIM0P5F41","title":"5.0 out of 5 stars Satisfying Product","author":"Tristan","rating":5,"content":"The sound quality is crisp and clear. Delivers a great amount of base for a speaker of its size. The battery life is one of the best batteries I’ve seen in a speaker. On top of that, it does not take long to charge. The size of it makes it easy to travel with. The pill shaped speaker fits well in a backpack, suitcase, and etc.","timestamp":"Reviewed in the United States December 21, 2019","profile_id":"AF7MKMPPJACLURENRZ3J2WPFC26Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RNDSRPBWGTJK5","title":"4.0 out of 5 stars A just ok speaker, still nice though","author":"sarissa","rating":4,"content":"I thought it would be louder. So a little disappointed but the sound is nice, battery life is amazing and it's portable. I just wanted something booming for my backyard parties.","timestamp":"Reviewed in the United States April 5, 2021","profile_id":"AF5BSF3Z6NEQ2PGIQ74OOJ7SOECQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R331DV79KYDSFQ","title":"5.0 out of 5 stars Fantastic speaker!","author":"NH Nancy","rating":5,"content":"This speaker is very easy to use with only three or four steps. The sound quality is superb at all volume levels. The case is sturdy and the whole unit has substantial weight so it will stay put wherever it's placed. It synchs easily via Bluetooth with my iPhone to play music from Pandora and to interact with phone calls. The Beats Pill is a high quality portable speaker.","timestamp":"Reviewed in the United States September 24, 2019","profile_id":"AHRUGT5EYE4FUSPVKFNIUVUNLOGQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3BWMR1QSYBP6Y","title":"5.0 out of 5 stars I feel like I'm at the disco...LOL","author":"J. Lew","rating":5,"content":"OK, so I was pretty skeptical, at first, but I think that sound is a personal preference, so I actually went to a retail store to listen to a few of the portable Bluetooth speakers (for my iPhone) before settlingon the Beats Pill+. I like the size of it in my hand as I carry it around; it's large enough to dispense decent sound, yet small enough to be easily portable. The Beats Pill+ esp has good bass (which is important to me), and the sound is rich.","timestamp":"Reviewed in the United States December 28, 2017","profile_id":"AGR56QCBZZR3SCZSOUE534FFQKBA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Black"},{"id":"R1G1AMXEN33FFD","title":"5.0 out of 5 stars Very good product.","author":"Elizabeth Krumlauf","rating":5,"content":"There will always be better and more expensive ones, but this portable speaker works great. Worth a very good sales price (as all things are over priced). The sound is great, but not going to give you an amphitheater sound (which is insane to think); put in the right spot (in a corner, or nook area) and it really adds to the dynamic’s.","timestamp":"Reviewed in the United States January 5, 2020","profile_id":"AG3CDJPAE6ZM4GX4VIPLJSPJUFTQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RDRZBXANQX42","title":"4.0 out of 5 stars Stereo mode is impractical","author":"B Dye","rating":4,"content":"Very good sound. However the stereo mode (using two speakers) only works with a mobile device (computer can connect to only one speaker) and requires a cumbersome connection process every time you want to use them. I am returning a second pill I just bought, but as a single speaker it is very good.","timestamp":"Reviewed in the United States August 13, 2019","profile_id":"AERPHNLUAZYIRSKGXMMABPUZD4XQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2FWIB849BHSY4","title":"5.0 out of 5 stars Good portability","author":"Kenneth M. Baker, M.D.","rating":5,"content":"Sound quality is reasonable. I use the device in my off grid, one room cabin to play music from my Spotify library. Battery life is good and I have an Anker charger to keep it going. As a portable sound system it is fine.","timestamp":"Reviewed in the United States March 27, 2021","profile_id":"AHMQZS2FKS4ZDFDDQ35J2XVC7NMQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2X6ZUZE3R4T6L","title":"4.0 out of 5 stars The truth","author":"Ryuk","rating":4,"content":"Ok so this speaker is good lets hit it out rn but if your a bass head you will not be as impressed it keeps the bass enough but not as plenty as the jbl but mid range is marvelous with the material exquisite tho you dont have water protection tho i would give this speaker an 8.1 out of ten","timestamp":"Reviewed in the United States October 29, 2018","profile_id":"AGDFNK7F2LVP7QU25AI2SEMNDDWQ","is_verified":true,"product_attributes":"Color: White"},{"id":"R2BREUMWO8JWR6","title":"1.0 out of 5 stars Junk","author":"Stephen B.","rating":1,"content":"I didn’t receive everything listed in the description. I charged it for 3 1/2 hours and it worked for 5 seconds and said it was dead. So I charged it overnight, and tried it again. Same thing. If I could give this negative stars I would.","timestamp":"Reviewed in the United States June 20, 2024","profile_id":"AF7GGVPPINLMA4I7V5JRBHXTQQYA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3C4D6FOXMWS64","title":"5.0 out of 5 stars Amazing sound!","author":"AGB","rating":5,"content":"I had no clue what this was, it was on my son’s Christmas List. He was so excited when he opened his gift on Christmas Day. I am amazed by the sound quality in this tiny device. We use it all the time, even outside. Definitely worth the money! And your teen will love you forever ❤️","timestamp":"Reviewed in the United States February 19, 2020","profile_id":"AGGQTAWP2IW5VXKCVCHKRQKXZGQQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: White"}],"page_type":"Question","asin_in_url":"B016QXV2QK","product_name":"beats Pill Plus Portable Wireless Speaker - Stereo Bluetooth, 12 Hours of Listening Time, Microphone for Phone Calls - Black","parse_status_code":12000},"created_at":"2024-08-09 04:42:12","updated_at":"2024-08-09 04:42:43","page":10,"url":"https://www.amazon.com/product-reviews/B016QXV2QK?reviewerType=all_reviews&pageNumber=10","job_id":"7227534611209808897","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"hc_policy","value":null},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-08-09 04:42:12","domain":"com","geo_location":null,"id":"7227534611209808897","limit":10,"locale":null,"pages":18,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B016QXV2QK","source":"amazon_reviews","start_page":3,"status":"done","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-08-09 04:42:43","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7227534611209808897","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7227534611209808897/results","method":"GET"},{"rel":"results-content","href_list":["http://data.oxylabs.io/v1/queries/7227534611209808897/results/3/content","http://data.oxylabs.io/v1/queries/7227534611209808897/results/4/content","http://data.oxylabs.io/v1/queries/7227534611209808897/results/5/content","http://data.oxylabs.io/v1/queries/7227534611209808897/results/6/content","http://data.oxylabs.io/v1/queries/7227534611209808897/results/7/content","http://data.oxylabs.io/v1/queries/7227534611209808897/results/8/content","http://data.oxylabs.io/v1/queries/7227534611209808897/results/9/content","http://data.oxylabs.io/v1/queries/7227534611209808897/results/10/content","http://data.oxylabs.io/v1/queries/7227534611209808897/results/11/content","http://data.oxylabs.io/v1/queries/7227534611209808897/results/12/content","http://data.oxylabs.io/v1/queries/7227534611209808897/results/13/content","http://data.oxylabs.io/v1/queries/7227534611209808897/results/14/content","http://data.oxylabs.io/v1/queries/7227534611209808897/results/15/content","http://data.oxylabs.io/v1/queries/7227534611209808897/results/16/content","http://data.oxylabs.io/v1/queries/7227534611209808897/results/17/content","http://data.oxylabs.io/v1/queries/7227534611209808897/results/18/content","http://data.oxylabs.io/v1/queries/7227534611209808897/results/19/content","http://data.oxylabs.io/v1/queries/7227534611209808897/results/20/content"],"method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7227534611209808897/results?type=raw","method":"GET"},{"rel":"results-content-html","href_list":["http://data.oxylabs.io/v1/queries/7227534611209808897/results/3/content?type=raw","http://data.oxylabs.io/v1/queries/7227534611209808897/results/4/content?type=raw","http://data.oxylabs.io/v1/queries/7227534611209808897/results/5/content?type=raw","http://data.oxylabs.io/v1/queries/7227534611209808897/results/6/content?type=raw","http://data.oxylabs.io/v1/queries/7227534611209808897/results/7/content?type=raw","http://data.oxylabs.io/v1/queries/7227534611209808897/results/8/content?type=raw","http://data.oxylabs.io/v1/queries/7227534611209808897/results/9/content?type=raw","http://data.oxylabs.io/v1/queries/7227534611209808897/results/10/content?type=raw","http://data.oxylabs.io/v1/queries/7227534611209808897/results/11/content?type=raw","http://data.oxylabs.io/v1/queries/7227534611209808897/results/12/content?type=raw","http://data.oxylabs.io/v1/queries/7227534611209808897/results/13/content?type=raw","http://data.oxylabs.io/v1/queries/7227534611209808897/results/14/content?type=raw","http://data.oxylabs.io/v1/queries/7227534611209808897/results/15/content?type=raw","http://data.oxylabs.io/v1/queries/7227534611209808897/results/16/content?type=raw","http://data.oxylabs.io/v1/queries/7227534611209808897/results/17/content?type=raw","http://data.oxylabs.io/v1/queries/7227534611209808897/results/18/content?type=raw","http://data.oxylabs.io/v1/queries/7227534611209808897/results/19/content?type=raw","http://data.oxylabs.io/v1/queries/7227534611209808897/results/20/content?type=raw"],"method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7227534611209808897/results?type=parsed","method":"GET"},{"rel":"results-content-parsed","href_list":["http://data.oxylabs.io/v1/queries/7227534611209808897/results/3/content?type=parsed","http://data.oxylabs.io/v1/queries/7227534611209808897/results/4/content?type=parsed","http://data.oxylabs.io/v1/queries/7227534611209808897/results/5/content?type=parsed","http://data.oxylabs.io/v1/queries/7227534611209808897/results/6/content?type=parsed","http://data.oxylabs.io/v1/queries/7227534611209808897/results/7/content?type=parsed","http://data.oxylabs.io/v1/queries/7227534611209808897/results/8/content?type=parsed","http://data.oxylabs.io/v1/queries/7227534611209808897/results/9/content?type=parsed","http://data.oxylabs.io/v1/queries/7227534611209808897/results/10/content?type=parsed","http://data.oxylabs.io/v1/queries/7227534611209808897/results/11/content?type=parsed","http://data.oxylabs.io/v1/queries/7227534611209808897/results/12/content?type=parsed","http://data.oxylabs.io/v1/queries/7227534611209808897/results/13/content?type=parsed","http://data.oxylabs.io/v1/queries/7227534611209808897/results/14/content?type=parsed","http://data.oxylabs.io/v1/queries/7227534611209808897/results/15/content?type=parsed","http://data.oxylabs.io/v1/queries/7227534611209808897/results/16/content?type=parsed","http://data.oxylabs.io/v1/queries/7227534611209808897/results/17/content?type=parsed","http://data.oxylabs.io/v1/queries/7227534611209808897/results/18/content?type=parsed","http://data.oxylabs.io/v1/queries/7227534611209808897/results/19/content?type=parsed","http://data.oxylabs.io/v1/queries/7227534611209808897/results/20/content?type=parsed"],"method":"GET"}]}}