{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=2","asin":"B099TJGJ91","page":2,"pages":733,"reviews":[{"id":"R1JSRE6SH7YE46","title":"5.0 out of 5 stars Good sound, solid unit, but CONNECTION difficulties to know","author":"Dexter Haven","rating":5,"content":"You may have trouble getting this to play sound from you desktop computer, as I did. The unit misleads you by saying you need to download the app 'Bose connect'. I tried to, but could not get it to download from the App store or from the Bose website. Other Bluetooth speakers connected automatically for me, so this was a hassle. I tried to chat with the Bose help bot, but it was of no help; the lady on the phone at Bose tech support was of no help and disconnected mid-sentence and didn't call me back. I tried to return the item on Amazon, then saw a troubleshooting video. Open your 'systems settings' on your computer and select 'sound'; click the Bose option for speaker 'output'. For some reason this Bose unit doesn't default as the output as other Bluetooth speakers did on my computer. Then you should be able to hear it.","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AGMDFCAFNSOMPAQOPYPJSNKY2HGA","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R3PQFUOLSJBHRB","title":"5.0 out of 5 stars Bose quality","author":"Tenkiller","rating":5,"content":"Bose has been one of the gold standard in sound for decades. So it’s not surprising that they pack a lot of quality into this little speaker. For one thing, holds a charge a long time! And it announces each time it’s turned on how much charge is left. No guessing. The sound quality is really decent for the size of the speaker. It can get very, very loud, if that’s your thing. It has a bass booster that I usually leave on. I appreciate that it is water resistant as I take this into the bathroom, the kitchen, camping, etc. It paired readily with my iPhone. There are some other features I haven’t played with yet, like doing my Teams meetings with it using the onboard mic, but I suspect it will be fine. If you are looking for a reasonably small Bluetooth speaker with a big sound without breaking the bank, give it a try.","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AG4KHYIUPQPNTJR7JU5GD7DGV7QQ","is_verified":true,"product_attributes":"Color: Green"},{"id":"RM8XKNWXW2JYF","title":"5.0 out of 5 stars BOSE for the WIN!!!","author":"Onile Stacey","rating":5,"content":"This Bose speaker does not disappoint! The sound is crisp and clear, and I love the bass levels; when that bass kicks in, it becomes a full-on party! The color is perfect, as it fits all of my periwinkle/lavender color schemes. I had no problem connecting my phone and my MacBook Air to the Bose app. I did have to go into my settings and change the output to the Bose speaker, but other than that, the connection is flawless!I recommend this speaker to anyone who wants superb sound on the go or stationary. Oh, and it holds a charge for quite some time. I love how it lets me know how much charge I have remaining and which device it connects to when I turn it on.This is a fun product and also use it for my massage work it really is a handy tool as well.","timestamp":"Reviewed in the United States July 16, 2024","profile_id":"AFDJQE4XDMVCR3MMLC2F3YAMJ5FQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Chilled Lilac"},{"id":"R2MLVPMTCERUY","title":"5.0 out of 5 stars Best small portable bose speaker ever!","author":"Lauren Burke","rating":5,"content":"This is our 4th Bose speaker that we've purchased. I bought this one to replace my Bose soundlink color 2 speaker that stopped working after a few years. I'm so glad I purchased it! It has waaaaaay better sound quality than the soundlink color 2 model! I was ecstatic when I plugged it in and heard how awesome the bass is and the volume level it goes up to is great! I'm excited to take it to the beach and the pool! I just received it in the mail today and wanted to let others know how great it sounds. Hopefully it lasts awhile! Buy it! You'll love it! I just ordered a hard case for it to keep the charging cord with it and to protect it when I pack it in my beach bag and suitcase when traveling. I love the stone blue color. I highly recommend this Bose flex speaker!!!!","timestamp":"Reviewed in the United States July 21, 2024","profile_id":"AH6PAONOIJTCWDHJBZNAVNICK7UQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R363RRXDDAFSL1","title":"5.0 out of 5 stars Amazing Bose speakers in looks, easy to use, and an awesome sound!","author":"Chris","rating":5,"content":"I LOVE these Bose speakers! I got two so I could do stereo sound. It has a “party” setting also. I have a wraparound porch so it stretches the sound out nicely! I like the rubber cover because I use them outside a lot! It was easy to pair it to my phone and to pair up the second speaker. Just follow the instructions provided! This was a great investment because I’m all about music 🎶 and good sound. I even listen to my podcasts using them. You can adjust the speakers either by the controls on the speaker or by your phone, which is really convenient! Even if I’m talking on the phone and want the conversation heard, it can come across the speaker! The USB/C charger cord comes with it. It charges very quickly! I like when you turn it on it tells you what the battery level is at and where it is paired to. These are the best little speakers with a huge sound that I have ever had! But then….it’s a BOSE!!!! The loop on the side makes it possible to hang the speaker easily too. That’s especially helpful outside on the porch where I have a number of hooks for hanging plants! I don’t have to worry about its stability, although it has a nice balance of weight to it just to sit it on a railing! If you like what I described, you will want to own one or more! It’s worth it!!!","timestamp":"Reviewed in the United States July 2, 2024","profile_id":"AG5JIIHBPOPFMX2ZVVWDWOPO4OMQ","is_verified":true,"helpful_count":15,"product_attributes":"Color: Stone Blue"},{"id":"R2MAV4C6A149IH","title":"5.0 out of 5 stars great sound, easy to use","author":"Gailviolin","rating":5,"content":"I've had a few different bluetooth speakers and this one is by far the best. My last one was okay but had annoying flashing \"disco party\" type lights that took 6 pushes to turn off. It was hard for me to finally decide to replace since nothing was wrong with it, it just irritated me. This one has the best sound of all my speakers, easy use buttons, easy to set-up. Has automatic shut-off, which is a plus in my book. Basically, you get what you pay for, and this is worth it.","timestamp":"Reviewed in the United States August 6, 2024","profile_id":"AGMV6S54ECLF76MRQLGULO77HSCQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"RCN8ABJ1TO325","title":"5.0 out of 5 stars Great for Audible Books","author":"Zac s.","rating":5,"content":"This speaker is really good for listening to Audiobooks.Works well for casual party music by the fire outside.Works well for garage time working on motorcycle or truck.I would say, if you want a super bass speaker, this is not it. This is decent. Even for my ears, which I am hard at hearing. It's a nice looking speaker. Not too heavy. I use it mostly in the kitchen while I cook. It's probably a 4/5 there is much better speakers in the market. But, not for that price. It is a mono speaker on the right and a Support speaker on its left.If I could have changed anything about the speaker.. I would design it to be stero speaker. But I suppose I could just buy another and pair them together to get stero.","timestamp":"Reviewed in the United States July 14, 2024","profile_id":"AHY3MSBL4AB3SG7IX74XALOR76DA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Stone Blue"},{"id":"R11TUE6Y91ZTPI","title":"5.0 out of 5 stars Excellent full spectrum sound","author":"D Glass","rating":5,"content":"I use this mostly with my digital TV. It connects by bluetooth automatically. I have it by my livingroom chair and can hear my TV perfectly over all the apartment noises. The bass is amazing for such a small speaker, much better sound than the TV. It is my second one as I gave my first Bose speaker(different model) to my mechanically-minded son thinking it was broken. He figured out it was the charging base it sat on and not the speaker that was broken. He plugs it in directly (like this one)to charge and it works perfectly despite being 9 years old.","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AGVBSAPNFETY4MRIQX33J7NZCN5A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Green"},{"id":"R1NJVFBBSQHMJQ","title":"4.0 out of 5 stars Decent sound regardless of orientation","author":"Amazon Customer","rating":4,"content":"It was on sale. It was purple. It was Bose. Those were my reasons for purchasing, despite the reviews complaining about the voice prompts. I used the Bose Connect app to set it up, but I deleted the app afterwards. It was always saying the speaker disconnected even though it was still playing. The app let me turn off the voice prompts. Then I found the actual user manual online and discovered an alternate method:Press and hold + and - simultaneously until you hear “Voice prompts off.”It sounds pretty good, but I mosty use it for voice.It doesn't matter how it is oriented; it still sounds good.But the material that it's made of is messy. It picks up dust and dog hair way too easily. I am trying to find a good way to keep it clean.I think it's going to work well for me.","timestamp":"Reviewed in the United States July 18, 2024","profile_id":"AHXBSFLODAFXN733X6TNRLBILMAA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Chilled Lilac"},{"id":"RZLFK0U17P3AL","title":"5.0 out of 5 stars FANTASTIC acoustics. Easy pairing.","author":"Owen Hewetson","rating":5,"content":"I listen to a variety of music from Country to Rock. The acoustics of this Bose is spot on. All instrumentation comes though nicely while the vocals are crystal clear. The drums of \"In the Air Tonight\", the guitar solo of \"Comfortably Numb\" and the vocals in \"Bohemian Rhapsody\" want for NOTHING.Half volume is more than enough for me in our lounge with the speaker on the far side of the room.I am a bit \"Technically Challenged\", but pairing the speaker up to my iPhone is a breeze.I can recommend without hesitation.","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AFOHJOWNEYYE4JNELZNAYYDQ733A","is_verified":true,"product_attributes":"Color: Chilled Lilac"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-08-09 05:49:43","updated_at":"2024-08-09 05:49:54","page":2,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=2","job_id":"7227551603652308993","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=3","asin":"B099TJGJ91","page":3,"pages":733,"reviews":[{"id":"R3F7JYC0PYH0JW","title":"5.0 out of 5 stars This a Great Buy and a Huge Value","author":"Bob D.","rating":5,"content":"My wife asked for another product for her birthday, but she saw this speaker on line. She came to me and said \"I know you ordered XXXXXXXXXX but I'm pining for this and is there any chance you could cancel that and get me this?\" I said the item couldn't be returned but I've got a bunch of points and we ordered the speaker. Very glad we ordered it! Sounds great! The only downside is the charging cable is too short; I just used a different cord.","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AEWF5HEADBXML5O2C5EOIURMUTEQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1V15QXTC1CXMA","title":"5.0 out of 5 stars Nice speaker","author":"Henry","rating":5,"content":"Pairing this speaker with my phone was easy. couple glitches but had it done in 10 min. Very loud, can hear it everywhere in my 1100sq ft home. Mainly I bought it for out on my boat. I can hear the radio even when my 90 4 stroke is full throttle. No buttons sticking out to break, this seems durable expect this will be in service for a long time. Battery life seem okay. Gotten it wet with no issue. Not going to water test it, will save that for somebody else. Yes, I would recommend it.","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AE3KWAMUVSXDEQILGJTAR33SBJSA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3CQS0XLE2W5AZ","title":"5.0 out of 5 stars Amazing quality","author":"Ocean lover","rating":5,"content":"I trust Bose! Have radios of 30 years old still work and sound perfectly. You always pay more, but the quality and workmanship you can’t deny….they are just amazing and last forever, to me that is worth a lot. We own 2 clock radios, headphones and now this wireless speaker. This speaker was easy to connect to phone etc and works great. Sound quality is amazing. Charges up quickly and each time you use it will tell you how much charge you have left. We use it often as we sit by our fire pit at night. Very happy with item!!","timestamp":"Reviewed in the United States July 24, 2024","profile_id":"AF4YNVIQRZ7TNVIVRO5V6VRNW5FA","is_verified":true,"helpful_count":4,"product_attributes":"Color: Stone Blue"},{"id":"R2CLQB668O7RHB","title":"5.0 out of 5 stars Perfect for every day use!","author":"Bryan","rating":5,"content":"This thing is awesome, I got it in the green and it has woodsy vibes. The sound is amazing. I use it 2x a day in the shower as well as on my back sun porch. It packs the perfect amount of bass and the sound quality is superb with everything from pop, r and b, country, classical, opera, you name it. The battery life is good and the connectivity is instant. Very happy with it.","timestamp":"Reviewed in the United States August 6, 2024","profile_id":"AHNJKX5B5IMJ43GFL4TJIHOXTEWQ","is_verified":true,"product_attributes":"Color: Green"},{"id":"R1RC8B8SAHAJGQ","title":"4.0 out of 5 stars Bose girl here…","author":"C-Line","rating":4,"content":"I’ve been purchasing Bose products for about 25yrs. Their products are usually well made, durable, sturdy, efficient and unbreakable (based on how you care for your products). I purchased this little gem and didn’t open it until a week later. Used it for 2 hours, put it back in the storage case that I purchased (because we must care for our Bose products properly)LOL. Went to use it today (3 days later) and the battery is at 30%. The battery 🪫 life on this speaker SUCKS!!!! Bose needs to upgrade or do something about this speakers battery life. Other than that, it’s a great speaker with great output (to my liking).","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AGPIOFYEAQFGLB7IRE3EXGB6Z3CA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Chilled Lilac"},{"id":"R1YRCHPCA2STP4","title":"5.0 out of 5 stars Small speaker Big sound","author":"Tony","rating":5,"content":"What’s not to like about this speaker. Great sound in a small package. The highs and lows air outstanding. I own several Bose products and a few from other well known brands. So I truly appreciate great sound reproduction. For the size, this is outstanding. I read other reviews that say not enough bass or treble. I believe you will enjoy this speaker for what it is. A small but great sounding speaker.","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AH35HARRVML5DRKBBBVQ7OBEA7FA","is_verified":true,"product_attributes":"Color: Chilled Lilac"},{"id":"R2TK77MNUQQ83Q","title":"5.0 out of 5 stars Wow!","author":"Mark Twain","rating":5,"content":"I bought this Bluetooth speaker as a replacement for my another brand of speaker that was showing its age after several years. This speaker sounds really, really good for its size. It puts out quite a bit of bass for a speaker this size. I wish the battery lasted longer, but of course if it lasted twice as long, I would still make the same comment. I highly recommend this speaker. 👍🏻","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AE5EQTJLIIAW2WNE3U7P6S2UBQTA","is_verified":true,"product_attributes":"Color: Green"},{"id":"R3QD4367BIJL9T","title":"5.0 out of 5 stars Great Quality!!!","author":"Katherine","rating":5,"content":"I bought this for my husband on Amazon Prime Day, but I LOVE it so much that he has left it in our kitchen so I can also use it during the day. The sound is amazing! We were listening to a Dave Matthews concert and truly it was like we were there. Highly recommend!!!!!!","timestamp":"Reviewed in the United States August 1, 2024","profile_id":"AEGJ7QY7EDP3U5FBMYVBXOVYINIQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"RBG5RFJZC1MGC","title":"5.0 out of 5 stars Very impressive sound quality!!!","author":"D. Oneal","rating":5,"content":"I wanted a small Bluetooth speaker for my computer for basic sound, music, YouTube videos etc. when I didn't feel like putting on my head phones. So picked up this Bose after reading the glowing reviews. Being a Bose I expected good sound but this blew past my expectations when it came to bass and clarity. Battery life was also good as well as charging time. Very pleased!!","timestamp":"Reviewed in the United States July 26, 2024","profile_id":"AFU3EDBQ4BRM6G7UJ52Y5MO53H5Q","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R17AN21AFS73JW","title":"5.0 out of 5 stars What A Powerful Bluetooth Speaker!","author":"JJG","rating":5,"content":"Bose is known for its quality speakers and this is no exception. I work outside in my garden for hours on end and I need to connect with music, podcasts and Audible books. This unit exceeded my expectations. It is just fantastic and I bought it on sale, 33-1/3% off. What a steal.","timestamp":"Reviewed in the United States August 6, 2024","profile_id":"AF5XGD5ER3SVPG2IET4LLPIW2S2A","is_verified":true,"product_attributes":"Color: White Smoke"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-08-09 05:49:43","updated_at":"2024-08-09 05:49:55","page":3,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=3","job_id":"7227551603652308993","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=4","asin":"B099TJGJ91","page":4,"pages":733,"reviews":[{"id":"R4LIZKCM7JWPT","title":"5.0 out of 5 stars Nothing like a Bose.","author":"Paul S","rating":5,"content":"I've had other bluetooth speakers that were pretty good, but my wife always has positive comments when someone has a Bose speaker playing. AND SHE'S RIGHT!!!! I don't say that very often, but this speaker is excellent. When I play it, then stop and play my other bluetooth speaker, there's really no comparison. The Bose has significantly better base, and extremely clear tones. You can just feel it in the weight of the item. It's solid. There's no going back! We love it.","timestamp":"Reviewed in the United States July 14, 2024","profile_id":"AFCLVNWB32KMDULLKSV7CZDKGN7Q","is_verified":true,"helpful_count":2,"product_attributes":"Color: Stone Blue"},{"id":"RJS5OJZTUADXL","title":"5.0 out of 5 stars Bose never disappoints!","author":"Dee","rating":5,"content":"I have been a Bose fan for quite sometime! The sound quality, range and performance are great! I connect it to my phone where I listen to music, live events and podcasts! I jumped at the chance when it went on sale during Prime! The fact that it has a hook for portability is great.","timestamp":"Reviewed in the United States August 3, 2024","profile_id":"AEFEWW7MGLG452MILUQHZV3SJMWA","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R2JT5RDJ7766OF","title":"5.0 out of 5 stars Ideal companion for travel or at home (or anywhere for that matter)","author":"Steven Roach","rating":5,"content":"I must admit, I initially wondered if I would miss stereo sound from my listening experience because this particular unit puts out mono sound. You can pair two of them and get stereo separation, but in my opinion, that would be a bit contrary to one of its main features, portability. In any case, the sound quality that comes out is full and rich including low-end. I've been listening to my favorite music through this speaker, music I've heard since the 70s through all manner of listening devices from full-featured stereo systems to Walkman headset units, and the listening experience through this speaker is beautiful.","timestamp":"Reviewed in the United States July 5, 2024","profile_id":"AGH4ZFHPMEDDJFWGXMIRZ7HX7A3A","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"RP9RESE9SA6RG","title":"5.0 out of 5 stars Gorgeous Speaker, Amazing Sound Quality!","author":"Jack Tindal","rating":5,"content":"I absolutely adore this speaker! The color is perfect, the material is soft and easy to clean, and I’m SO pleasantly surprised at the quality of sound. You can place it on its side for directional sound, or lay it flat for very clear all around sound. It’s the perfect size for desktop, counter, and luggage space. The clear and crisp audio (and waterproofness) make this a great speaker to use in the shower! Charging is simple and straight forward — USB-C like 90% of my other devices. Buttons are soft and durable. So far I haven’t encountered anything I don’t like about it!","timestamp":"Reviewed in the United States July 4, 2024","profile_id":"AED7B447UQFFINEEVIO25TFF7XYA","is_verified":true,"helpful_count":5,"product_attributes":"Color: Chilled Lilac"},{"id":"RQ5NKF7TUKPUI","title":"5.0 out of 5 stars Awesome sound, sturdy build!","author":"Jun Mark","rating":5,"content":"I was in doubt at first because of how small it looks like, but don’t be fooled – this fella packs a punch! Sound signature is amazing for its size, no compression whatsoever even in max volume. Sturdy build as well, perfect for outdoor activities!","timestamp":"Reviewed in the United States August 7, 2024","profile_id":"AHKFPZCPIRGCG6ZMEISA3QP63ZIA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R24MVY0N6OV14Y","title":"5.0 out of 5 stars It sounds so good!!!","author":"Stacey","rating":5,"content":"I had a 10+ year old Bluetooth speaker that was slowly dying, so I bought this one on Prime Day. Let me tell you, it is LOUD, has great sound, bass, it's portable, and easy to connect to my iPhone. The battery charges fast, and it stays charged for days of use. I LOVE IT.","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AGTMOFOWIWGMDQZA7YGTULRSRREQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R1N3FUL4C0AV4T","title":"4.0 out of 5 stars 6always loved Bose products","author":"Joyce Trawick","rating":4,"content":"7/3/24 My Bose Sound link speaker was delivered today!! Just in time for the 4th of July picnics and outdoor music. I owned a Bose Soundlink I for years unfortunately it was locked in a hot car for 3 door before I realized I had left it there and it played a short whiel and died. I just got this one and the sound is even better!! It's a compact size and I chose the dark green color( something different from my white one) I listen to a lot of Biblical recordings and through the speaker it gives it a fantastic voice and musical entertainment. The price seems reasonable compared to other potable speakers and I am putting o n the list for possible Xmas gifts.","timestamp":"Reviewed in the United States July 4, 2024","profile_id":"AE7Z2L3KR5TQYFLXUB5HNUQATTPA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Green"},{"id":"R31VXS0LCBX2VQ","title":"5.0 out of 5 stars Good product","author":"Strike Force","rating":5,"content":"Bought this to replace some lesser quality speakers. Like the rich sound but really like that it tells you how much battery is left every time you turn it on. Also hooks up to multiple devices - iPad and iPhone at the same time.","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AFACDOCIHBPF2CCHI3YWGLU6CIVA","is_verified":true,"helpful_count":1,"product_attributes":"Color: White Smoke"},{"id":"R28RGIKH8MCCHU","title":"5.0 out of 5 stars Husband loves it","author":"Sharon in North Dakota","rating":5,"content":"I got this for my husband, as his tractor's radio quit working. He spends long hours working, so it helps him to have something to listen to. He loves this speaker, it sounds great and is very easy to operate. Happy Hubby!","timestamp":"Reviewed in the United States August 3, 2024","profile_id":"AGBPHCZXHLXPDMGDXGO35UATCTHA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R293ZXMMJOFKV4","title":"5.0 out of 5 stars The sound of Bose","author":"Florence Campbell","rating":5,"content":"I bought this speaker to use in my home. The great thing about it is that it’s blue toothed to my phone. The sound is very clear in a small places. I’m glad I made this purchase.","timestamp":"Reviewed in the United States August 3, 2024","profile_id":"AEOQSEHUYNW3VUOG35PNSEE3LIGA","is_verified":true,"product_attributes":"Color: Stone Blue"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-08-09 05:49:43","updated_at":"2024-08-09 05:49:56","page":4,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=4","job_id":"7227551603652308993","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=5","asin":"B099TJGJ91","page":5,"pages":733,"reviews":[{"id":"R2V79BVI4UTYHX","title":"5.0 out of 5 stars Great sound!","author":"DublinOH","rating":5,"content":"Great sound for a small unit. Like that it is waterproof and very portable. We are remodeling our master bath, and it will be nice to have quality sound while I soak in the new jetted tub!","timestamp":"Reviewed in the United States August 3, 2024","profile_id":"AFO5XCK5RD6ELA5AFI2BNMUY6LJA","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R1J9HE7WRB1YJG","title":"5.0 out of 5 stars I know that Bose products are known for quality and fidelity","author":"Loanshark","rating":5,"content":"I know the reputation of Bose products, but quite frankly wasn't expecting this to be as good as it really is for the low price. It is solidly built and the sound and fidelity are truely amazing.","timestamp":"Reviewed in the United States August 5, 2024","profile_id":"AGPDKKWLFNWSCBHYTW6DP2KTRJFA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R29T6Q73DL97GO","title":"4.0 out of 5 stars Less sturdy than the SoundLink mini II","author":"Laura Lynn","rating":4,"content":"I'm not sure why but the engineers gave this little speaker feet instead of a sturdy base. I'm a klutz and I expect I'll knock this over or to the ground at any point. Does not seem sturdy in that capacity. Otherwise it's a thick and dense little speaker.Functions as it's supposed to. Charged well when I got it. I can hear it from the other room when I walk away and it's got a nice clear quality to the speaker so far. The charging cord that came with it was quite short but functional. The speaker and instructions are insistent about downloading a useless connection application. Seems like another way to advertise more speakers or to sell user data. It was irritating enough, I almost rated this less because of it.Speaker will not connect to my phone via Bluetooth unless I allow the speaker access to contact information. What a dubious and unwanted feature. Also almost rated less than 4 stars for this.We will see about the value for the money over time. Purchased at the end of May '24, used 5 times at the time of this review.","timestamp":"Reviewed in the United States May 30, 2024","profile_id":"AF6CPSBTTST2FEFI3OBCNPH7Y3BA","is_verified":true,"helpful_count":12,"product_attributes":"Color: Chilled Lilac"},{"id":"R3L2DEU5WL27OO","title":"5.0 out of 5 stars Amazing sound","author":"D850shooter","rating":5,"content":"The design, weight, size and sound quality are amazing for the price.Bought it near the end of June and now, July 31, the same speaker is $40.00 less. Too much of a hassle to return.","timestamp":"Reviewed in the United States August 1, 2024","profile_id":"AFO4B5RMDYDJAJUOAWGDJXECEBVA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R1JJWJAO9TTMUF","title":"5.0 out of 5 stars Superb sound","author":"Trae","rating":5,"content":"Got this speaker on Prime days and have ZERO regrets. For a small speaker, this Bose speaker EXPLODES with sound. The bass is amazing and the outdoor sound projection is wonderful.Buy it.","timestamp":"Reviewed in the United States July 24, 2024","profile_id":"AEFFUMTGDPA4QVMORPDWPPS2A3QQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"RH6W2Z31KF87K","title":"5.0 out of 5 stars EXCELLENT SPEAKER!","author":"Gretchen","rating":5,"content":"Bought because I needed music by pool. Toggled between JBL and Bose (both would have been a good choice). This speaker packs great sound, especially base. Bluetooth connects easy. Highly recommend.","timestamp":"Reviewed in the United States July 25, 2024","profile_id":"AGBZUPP6BMWLNEPTNL2EF5CBPGUQ","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"RYE3S31EJC4I0","title":"5.0 out of 5 stars Love it!","author":"Renee Owen","rating":5,"content":"I had an older version of this speaker so it was time for an upgrade! It sounds great and for the price I couldn’t turn it down!! This speaker will NOT disappoint you!","timestamp":"Reviewed in the United States July 25, 2024","profile_id":"AH2VIFT6Y46KIOUXWRRZSZ4GLHDQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R1ILZYTTZJERMC","title":"5.0 out of 5 stars Amazing Sound, Build quality","author":"Mustakeem Nuruddin","rating":5,"content":"This speaker gets very loud perfect for outside use for picnics and such, also works amazingly well for indoor use i just got it the other day and used it while boxing at the gym. Heavy base songs also sound really nice on it so far.","timestamp":"Reviewed in the United States July 21, 2024","profile_id":"AE5Z6CVZSDZEZE545NIDF3QILOIQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R671UAG2XG874","title":"5.0 out of 5 stars Great sound!","author":"Jen","rating":5,"content":"This tiny speaker sounds amazing! Very impressed. Perfect for playing music and podcasts from my phone while I’m working around the house and I can hear better than my phone speaker.","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AF6HCYZEP6W2VDCITDHN4GAWWZAA","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"RWPJOORLGLZ7X","title":"5.0 out of 5 stars Good","author":"Vanessa castilla","rating":5,"content":"So far it has worked very well for us, the sound is good and the charge lasts a long time, the material is nice but not so easy to clean","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AEPB3FK2MX4G4X7IL3HIQWBO5XKQ","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-08-09 05:49:43","updated_at":"2024-08-09 05:49:57","page":5,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=5","job_id":"7227551603652308993","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=6","asin":"B099TJGJ91","page":6,"pages":733,"reviews":[{"id":"R191NXNXEPG87Q","title":"4.0 out of 5 stars Works good.","author":"Stephen J. Sable","rating":4,"content":"The quality of sound is great. It’s nice and compact. The battery life is ok. The charging is odd. It doesn’t charge well with an extension cord. There is a voice that tells the charging level. Some times charges to 80% or 100%. I mounted to my motorcycle (with padded foam just in case.) So far no major problems.","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AFXQZMWVIWQTBP6SMC2MKXIL3Z4A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3OT0O4YXK8E8M","title":"5.0 out of 5 stars Good sound","author":"J.H.","rating":5,"content":"Got this for my wife as a Christmas present, she's happy with it. The sound is really good. Her only complaint is she wishes the battery lasted a little longer.","timestamp":"Reviewed in the United States August 5, 2024","profile_id":"AHNJKMIXW5VVHNABEERPAOHNTMKA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R40DA4I7DUXLD","title":"5.0 out of 5 stars Sweet sound and sleek look","author":"Jean M Turner","rating":5,"content":"The sound quality is great, and I like that it has a good IP rating. Waterproof also means dust proof, so we can use this at the motocross track.","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AGJCA5DJRMSVSEUZMZMGGWELY6LQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R3FOPHNTFOCRT9","title":"4.0 out of 5 stars Good splurge","author":"Amazon Customer","rating":4,"content":"I have the original Bose sound machine for years and the quality is fabulous. I wanted some thing that I could take around with me. Didn’t wanna spend the money. Found this one and thought I’d treat myself. Glad I did can’t say that the sound is quite as clear, but it’s perfect for what I need","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AGWOAWHXOCQOLCRXBFJXIB5Q6ZKQ","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R2JPRKJ2WZ70BW","title":"5.0 out of 5 stars LEGIT!!!","author":"Amanda S.","rating":5,"content":"This speaker is amazing… smaller than I thought it would be but PERFECT! The sound quality is amazing… deep sound. Absolutely love it!!! Bose for the win!","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AGU3MNI4256DPVSEH764ME3DLPOA","is_verified":true,"product_attributes":"Color: Chilled Lilac"},{"id":"R233UOJQG7OJEP","title":"5.0 out of 5 stars Sounds great","author":"vsas","rating":5,"content":"I purchased this during Prime days to replace my last speaker. The new speaker looks great and sounds great. I am glad I chose this speaker.","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AHPRNOX2OGDFQOLZ2DCEIVFKUK6Q","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R1OTAF9805WV1D","title":"5.0 out of 5 stars Love","author":"tmb0324","rating":5,"content":"I bought this during Prime Days!! Love it and got it for a good price! I bought the teal colored one and I love it! The sound is awesome.","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AHJNNSXPA6WDJFVYRY242JUQUX5A","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R2XROV4NTQCB9U","title":"4.0 out of 5 stars Wouldn’t connect; hold the power button for 10 seconds.","author":"K. G.","rating":4,"content":"Just got it, needed to download an app to get it to connect, dumb. Wouldn’t connect, had to hold down the power button for 10 seconds to reset it, then it worked with the app. Also deleted all other Bose Bluetooth devices, not sure if that was necessary or not. It sounds great!","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AEOILW77ONBBNKG7XU3C3L5OPQCQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R3JMBY4FGYMGPE","title":"5.0 out of 5 stars THE ONLY OUTDOOR SPEAKER YOU NEED","author":"Jay Z","rating":5,"content":"Commanding sound, deep breathing bass, smooth clarity and plenty of pitch and tone to drone out any annoying neighbors, cars, traffic, kids, wives, ....errrr...I mean great product!!!","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AHMJ34TILDMJ4GMUND6QGLCZYMJA","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R3UW7G8Y017Y2F","title":"5.0 out of 5 stars Good sound","author":"Amazon Customer","rating":5,"content":"Can be a bit boomy. I do think the older SoundLink has better sound, but this was a great prime day deal. Much better than cheaper speakers.","timestamp":"Reviewed in the United States August 7, 2024","profile_id":"AHXVJH2Q3G7ZVJP56AB3QTNWH6BQ","is_verified":true,"product_attributes":"Color: Stone Blue"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-08-09 05:49:43","updated_at":"2024-08-09 05:49:58","page":6,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=6","job_id":"7227551603652308993","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=7","asin":"B099TJGJ91","page":7,"pages":733,"reviews":[{"id":"R3CTEYAXVL0SGM","title":"5.0 out of 5 stars Great Bass at a Reasonable Price","author":"Jenna A.","rating":5,"content":"Love this little thing! So portable, and surprisingly bumpy base and clear sound. I'm a big Sonos fan and considered both of their portable speaker products, but in the ended, decided on the Bose SoundLink primarily because of affordability. So glad I did! Not to mention the color options are so cute - something for everyone for sure!","timestamp":"Reviewed in the United States July 10, 2024","profile_id":"AFO3PBLJ4UQFFPP634RVCRFHSOXQ","is_verified":true,"product_attributes":"Color: Chilled Lilac"},{"id":"RCL6GMDG3AU8I","title":"5.0 out of 5 stars Great sound","author":"John P.","rating":5,"content":"This little box put's out some great music and you can feel the bass. I will only buy Bose from now on. WOW what a product","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AHO6SETWMSXQ2HOTDZOJFLVNZONQ","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R1XNP6CE1QG0DK","title":"5.0 out of 5 stars Very Pleased!","author":"Kindle Customer","rating":5,"content":"Arrived as predicted and was easy to set up. Very pleased with the color I chose and the sound was perfect. The price was great also.","timestamp":"Reviewed in the United States July 20, 2024","profile_id":"AEMSEN3YYX4VPPUBSZ66BBVDHYPQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"RU34GUPT3K2Q","title":"5.0 out of 5 stars A-MAZING","author":"Amazon Customer","rating":5,"content":"I absolutely Love, love, love this portable speaker. The sound, bass and range are great, both indoors and outdoors. When it goes back on sale I am purchasing a second one!! my mom and two cousins want one now as well.","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AHBIMXVX5LIZKYAOV3TPSTUVYT5A","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R3450LU6V0H3U4","title":"5.0 out of 5 stars Amazing Sound","author":"jselb10","rating":5,"content":"The party never stops with this speaker! Sleek and modern looking design. The sound quality is great and it's small enough to take everywhere!","timestamp":"Reviewed in the United States August 1, 2024","profile_id":"AE7U2UKGXJS2DOSLUFMFPGJJJFQA","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R327B4PQXF1ORN","title":"5.0 out of 5 stars Best ever","author":"Suzanne Solomon","rating":5,"content":"We love these small speakers. I have had Bose speakers for years but these are my favorite because they are small and my favorite colors!","timestamp":"Reviewed in the United States August 5, 2024","profile_id":"AEQ3URWVY75UQ2TGQMMBYJDH2MQQ","is_verified":true,"product_attributes":"Color: Green"},{"id":"R3KG5GUYYO1EL2","title":"5.0 out of 5 stars Bose is quality","author":"Steve","rating":5,"content":"Bose is a special product and always has been. Well built, fit and finish is second to none and most important, that fantastic Bose sound.","timestamp":"Reviewed in the United States July 20, 2024","profile_id":"AF5I7TVBLUTN4MXID6R7TKRV2EGA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2OXD72R7LNTGC","title":"5.0 out of 5 stars Perfect sound in a small package","author":"justncase0611","rating":5,"content":"We all know Bose sounds great but for the money, this speaker rocks.Grab two of them and pair them together for bigger sound!","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AH47Z2JS3Y6LHKEML5WSRBMCCPSQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R1S2R3URFI9T3A","title":"5.0 out of 5 stars Love it!","author":"Michele Keyer","rating":5,"content":"My Beats Pill died and I replaced it with this. Oh my goodness - I’m amazed at the quality, the sound, everything. I love it!","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AG2R32ZZJBPLAIITHHO2XAOMYY6Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R25MEIJ7ITHXZK","title":"5.0 out of 5 stars Great little speaker","author":"Tracy","rating":5,"content":"I have been wanting a bluetooth speaker to have when my family and I are hanging out in the backyard. This Bose speaker sounds great and has really good sound quality in such a compact design. It charges quick and you can use it while it is charging. It is easy to connect or pair with a Bluetooth device.","timestamp":"Reviewed in the United States July 18, 2024","profile_id":"AFKO53LMYACK3OKWWH2XECL6PGBQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Green"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-08-09 05:49:43","updated_at":"2024-08-09 05:50:00","page":7,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=7","job_id":"7227551603652308993","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=8","asin":"B099TJGJ91","page":8,"pages":733,"reviews":[{"id":"R3DB033JMKDSFQ","title":"5.0 out of 5 stars Best speaker ever","author":"Amazon Customer","rating":5,"content":"We've tried a half dozen speakers but Bose is by far the best. Easy setup. Long battery charge (10 - 12 hrs). Great sound!!!!","timestamp":"Reviewed in the United States July 26, 2024","profile_id":"AGFS2WORGQQ7ZEKMOMKHRCNZLTUQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2LQ5BYRTC6SKZ","title":"4.0 out of 5 stars Very good speaker","author":"Rodrigo L.","rating":4,"content":"Very good speaker. It is not cheap. It could be more cheap. The brand Bose add some value. I would like more power. At small room or at a table of friends is ok. At noise outdoor, like a beach, or gin, it does need max vol.","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AHTI7CJURCR3E6CFA4C3BNXAIROA","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R1CVP162HE2H63","title":"5.0 out of 5 stars Poolside Music","author":"rockinr","rating":5,"content":"We had2 JBL flip waterproof speakers and one finally gave out. They have wonderful sound. I decided to get the Bose because I’ve always wanted one. This sounds tremendous!! Nice bass. Battery lasts a long time. Try it for yourself you will definitely like what you hear!!","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AG6XT2BEBWHGASHZFHW7DRCFZELA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RMUYYKJ5WTA8Q","title":"4.0 out of 5 stars The sound is awesome but...","author":"HB","rating":4,"content":"It's a Bose so I expected high quality audio and the speaker does that. It's compact and that's part of the issue. It tips over very easily as the base is rather narrow. Second, the battery life leaves a bit to be desired. It's not as long as other speakers I have had but it's decent. I wish the bright white/blue lights were red or could be turned off. It gives off just enough light to be bothersome if you truly need a dark room to sleep. Forget using the app, all it does is connect and you don't really need it to even do that. It wouldn't control anything on this speaker. Lastly, why is it talking? I don't need it to tell me the battery level or that my device is disconnected. I don't need it to speak at all. It's rather annoying bc if you disconnect and don't turn it off, it promptly reminds you. Spooked the hell out of me several times. It gets 4 stars bc audio wise it's absolutely on point as expected. It's the little details that are missing that list a star. Would I buy again? With improvements yes, as is I'd have to think about it.","timestamp":"Reviewed in the United States May 26, 2024","profile_id":"AGRPNG4CNHIH5CUK2WGOP4EVFYJA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Stone Blue"},{"id":"RXE60DKGSDE2U","title":"5.0 out of 5 stars Sleek design and great sound!","author":"Donya Davis","rating":5,"content":"I like the sound quality and how it projects from the sleek designed speaker. Considering the small frame it performs in a great way.","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AGZH53W5TWH7X24YBX4Y72G6HI7A","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R4EH7D8EGR7YK","title":"5.0 out of 5 stars Great Sound","author":"Debra","rating":5,"content":"I was thoroughly impressed by the sound for the size speaker this is. It is a convenient size with a big punch! I am happy to report that the skeptic in the family was also impressed and I got the thumbs up on the purchase!","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AHFIG3QXGQ373AZ7XGQPUAY7ALDQ","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R1A0NC91DS3DYP","title":"5.0 out of 5 stars As good as described","author":"Tracy R.","rating":5,"content":"Personal use. Hand hang strap used to keep out of sandy areas. Sand and waterproof. Would recommend fir beach vacations.","timestamp":"Reviewed in the United States August 1, 2024","profile_id":"AHWHDOXXTNT6QL7OXLEQAAQEUAQQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R36YHGL95K3QBJ","title":"3.0 out of 5 stars there’s a time and place for it!","author":"Steven Jerome Staten II","rating":3,"content":"I purchased this because water broke my old Bose Revolve+. I don’t consider myself an audiophile, but I do listen to music religiously — 100k+ hours annually — and I can appreciate a crisp sounding speaker with nuance. This speaker lacks the nuance. It’s not terribly loud in my opinion, even on full volume in my small apartment. However, it is durable, and I love that it’s waterproof. Upon further research, I discovered that Bose is actually NOT worth the value for the money — many audiophiles recommend purchasing from another brand, as these speakers can be made for less than $50 and sold for $400+. Initially I purchased the Bose Soundlink MAX and another Flex (product listed here) as well, in hopes of amplifying the sound as well as achieving stereo sound in my apartment.After doing some research, I returned the Soundlink Max and one of the Flex speakers as well. I purchased some ELAC speakers instead for HOME use, and kept one of the Bose Flex speakers for shower use and traveling, as I spend a lot of time on the beach and this is dust and drop resistant. I purchased this on Prime Day for $99 before tax. I would NOT say it’s worth $150 full price. The battery is not great. I can leave it charging overnight and it dies with moderate use before the day is over. Mediocre in performance overall.It’s worth nothing that when I purchased the Soundlink Max from Amazon, the box itself clearly states that the speaker comes from Bose “RETURNS AND REPLACEMENTS.” I believe the speakers sold on sale are probably speakers that were defected or returned by other customers. Keep that in mind!","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AGCXGALSGPD6TVVAU6JWGT6SY4FA","is_verified":true,"helpful_count":3,"product_attributes":"Color: White Smoke"},{"id":"R61DQBVV1AK4H","title":"4.0 out of 5 stars Great sound","author":"Abigail","rating":4,"content":"Sounded great but I could never get it to connect with Alexa. I ended up returning it. It may have been operator error but in any case i wanted voice control and I s couldn’t make it work. I really liked the size etc also.","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AGTJ3NMZJJOKP5PLJS4YTOWZQ4ZQ","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R1XEI087L27YYU","title":"5.0 out of 5 stars Great product.","author":"OCDReader","rating":5,"content":"I bought this for my husband and we love it. Great sound quality, switches between bluetooth users easily and does what it says.","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AFIZVCRSTK4IARRTUFNYDHAQU3IQ","is_verified":true,"product_attributes":"Color: White Smoke"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-08-09 05:49:43","updated_at":"2024-08-09 05:50:01","page":8,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=8","job_id":"7227551603652308993","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=9","asin":"B099TJGJ91","page":9,"pages":733,"reviews":[{"id":"R3VC4C7R84FC1X","title":"5.0 out of 5 stars Best purchase in a long time","author":"Kelly L.","rating":5,"content":"Van lifer here. Needed something better than my cell and this is wonderful. Nice bass. I don’t have WiFi sound I can’t use the app evidently but I’ll set up sound preferences when I am connected.","timestamp":"Reviewed in the United States July 25, 2024","profile_id":"AGSKACOGSISWMPALMLBX726O4MQQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RHFIIKLEZYX8F","title":"5.0 out of 5 stars Bose speaker","author":"Amazon Customer","rating":5,"content":"This is a great speaker! Small and compact give out great quality sound. I like the ambient sound worth the money folks.","timestamp":"Reviewed in the United States August 3, 2024","profile_id":"AGOUYZHXJ2VEK3VPGZCKWLHDIX5A","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"RFAJ2XFULVISX","title":"5.0 out of 5 stars Amazingly rich sound in a little package!","author":"Kindle Customer","rating":5,"content":"I LOVE this - such fabulous sound - pairs with my phone and tablet. - Wish it paired with my laptop!","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AE2ZG2GA6H6A7PNB5NQYIR576SNA","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"RZAO55ZC82KPF","title":"5.0 out of 5 stars Great sound!","author":"GLF","rating":5,"content":"Compact and useful. Would have liked to have a wall charger transformer plug included, but the USB charge cord works well.","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AEMBVALSPIH2MC3CSQYBR2O4XZGQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RZ3NANGHVBE8O","title":"5.0 out of 5 stars Impressive sound quality","author":"M.A.A","rating":5,"content":"This was a nice surprise. I wanted a portable bluetooth speaker for my home office and opted for this Bose unit because of the positive reviews. So far, the positive reviews have been spot on. Great and very clean sound clarity even when the volume is maxed out. Easy to use and I like the option of being able to connect two different devices onto this speaker. The party mode feature of being able to connect to another Bose Soundlink speaker is something I might try sooner than later as having an extra speaker in the garage would be nice.","timestamp":"Reviewed in the United States June 12, 2024","profile_id":"AEKQGWZA7OIWWLYAOA3MGKLA5XEQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: White Smoke"},{"id":"RK3H1QAFUKJ71","title":"5.0 out of 5 stars LOVE THIS!","author":"Dorothy","rating":5,"content":"I am not young and am not great at things in the tech world but this is so easy to use with my smart phone and it sounds great...just like my old Bose CD player! I use it with Spotify to listen to the songs of my youth and it is just great?","timestamp":"Reviewed in the United States July 17, 2024","profile_id":"AGKD6TMNDIKYIBYXFM7EVUQMSBWQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Chilled Lilac"},{"id":"R1XXZ0FPOM9I9T","title":"5.0 out of 5 stars Great sound","author":"Jake Wright","rating":5,"content":"Loud enough for me and clear crisp sound. Definitely follow the Bluetooth link instructions or you'll get frustrated. So far no complaints.","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AHAX63B3ER3JWYWVW53EYCTY3RUQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R1JPIRL62GQWTY","title":"5.0 out of 5 stars Great sound!!!","author":"Kimmy M","rating":5,"content":"I’ve had various Bluetooth speakers that I use for my yoga classes. This one beats them all! The sound is amazing, the charge lasts a long time and it’s very light to go into my bag. I bought the silicone cover which was a game changer. LOVE this product. You won’t be disappointed","timestamp":"Reviewed in the United States July 7, 2024","profile_id":"AE73FRKSEFVJRO4NEX26FTE53KIA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1T3LLDM4SSRCR","title":"5.0 out of 5 stars My new favorite thing","author":"treelover675","rating":5,"content":"I got this mainly for use in the bathroom but find myself carrying it with me room to room. Battery life is reasonably good. I charge it every day. Stays connected when I walk away from it to another room and even outside. Sound is great, impressive bass for a little speaker.","timestamp":"Reviewed in the United States July 13, 2024","profile_id":"AEFEXPO7UGKAN5RDENJVLKFTLUCQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Chilled Lilac"},{"id":"RXIN49HCW9XBD","title":"5.0 out of 5 stars Just buy it !","author":"B. Canute","rating":5,"content":"I had purchased numerous low end cheap ass Bluetooth speakers in search of something on par with a Bose speaker …. That does not exist. I finally bought the Bose and wish I would have done that from the start. This thing is a beast ! Superb performance, great battery life and it seems to very durable. It may seem like a big nut to spend on a speaker but at the end of the day, it really is a good value for the phenomenal sound !","timestamp":"Reviewed in the United States June 2, 2024","profile_id":"AFIKQRKO6KDM6DLIX67XT4FJL52Q","is_verified":true,"helpful_count":3,"product_attributes":"Color: Green"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-08-09 05:49:43","updated_at":"2024-08-09 05:50:02","page":9,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=9","job_id":"7227551603652308993","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=10","asin":"B099TJGJ91","page":10,"pages":1,"reviews":[{"id":"R1DP1AXTBTKW26","title":"5.0 out of 5 stars Very impressed.","author":"allen buckner","rating":5,"content":"If you spend the money for a speaker in this range this is the one. It will surprise you","timestamp":"Reviewed in the United States July 15, 2024","profile_id":"AFGRETMPIQJDFIPLLNJO2EKIM2HA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1FPKJQ0BWCJV6","title":"5.0 out of 5 stars Great speaker","author":"PonyGirl","rating":5,"content":"Nice and loud good sound quality and decent bottom end for such a small speaker very full sound! This is my second purchase I wanted one to keep in my barn. I definitely recommend!","timestamp":"Reviewed in the United States July 14, 2024","profile_id":"AE3K6UMVPOPD5P5CSZESS7ZFOUGQ","is_verified":true,"product_attributes":"Color: Chilled Lilac"},{"id":"R3A3WT89MMWXVA","title":"4.0 out of 5 stars Good sound and long battery life.","author":"Edward C. Spindler","rating":4,"content":"A little disappointed in the bass but overall very good sound for the size. Too bad you need to download the Bose app to connect to it. The marketing guys need to step back and just make it plug and play.","timestamp":"Reviewed in the United States June 6, 2024","profile_id":"AEW5F454D2KLV5R4UV5IC2HOWNAQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R6KXQ8GS9YIAY","title":"5.0 out of 5 stars Perfect for music by the pool","author":"M patton","rating":5,"content":"Bought this to have music by the pool. Bose has a great sound connected to the iPad with no issues.","timestamp":"Reviewed in the United States July 15, 2024","profile_id":"AGJJBYGN4BVWN35QLAJPQVTN3ZLA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RYIS8MNG3S1XC","title":"5.0 out of 5 stars Awesome speaker.","author":"Rio","rating":5,"content":"The battery died on my rockstar portable speaker for the 2nd time and less than a year after replacing it so I decided to buy the Bose, couldn't be happier! Great sound, connects to multiple devices at the same time and fits in my luggage. Great device for the price.","timestamp":"Reviewed in the United States July 11, 2024","profile_id":"AFUC5EN25UNA6RAOSMSYKCQNHBYA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"REU2RV24G9TUG","title":"5.0 out of 5 stars Amazing!!!","author":"Camilo Medina","rating":5,"content":"Suena super bien. Todo tipo de musica suenan con un sonido limpio. El material bueno. Todo perfectoMe gustó","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AFSTZB7ICAQY2TWX5AOCRKDVUJZA","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R2EZ5NG1TG4RTW","title":"5.0 out of 5 stars Battery last enough","author":"Bell’a Palsy Pirate","rating":5,"content":"We took this for our vacations , we played music all the way to California , 4 hours .Next day we went to the beach and it didn’t died on us until the night.We were very happy with it, especially when anyone can share their playlist .","timestamp":"Reviewed in the United States July 3, 2024","profile_id":"AEXAEPZYKODJ4UX6RKDXPCBPMCBQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R290PMA4GTHOTJ","title":"5.0 out of 5 stars Great sound from a small box","author":"Amazon User","rating":5,"content":"I don’t know how they do it, but Bose gets good bass and nicely balanced sound out this speaker.","timestamp":"Reviewed in the United States July 7, 2024","profile_id":"AFW3TINTJCLATVUZDFQWYGOKBDBA","is_verified":true,"product_attributes":"Color: Green"},{"id":"R2LSJMJG57QQGS","title":"4.0 out of 5 stars Little Stature, Big Sound!","author":"Rita Mines","rating":4,"content":"To sum it up in 3 letters - WOW! Totally impressed by the sound this little might produces! Great sound, super ridiculously easy set up and I recommend it highly! PS, just got this so hence, the 4 stars.","timestamp":"Reviewed in the United States July 17, 2024","profile_id":"AFJEIGW5HTJ6SYCQ4WYG3SLA3UAA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1KF8ZHXEOHYBN","title":"5.0 out of 5 stars Great sound","author":"George Mendez","rating":5,"content":"The sound is amazing and easy to handle.The only thing is that don’t connect to te Bose App.","timestamp":"Reviewed in the United States July 18, 2024","profile_id":"AH2ZJBMB2ABFOGIED4OKNTBJ4PPA","is_verified":true,"product_attributes":"Color: Stone Blue"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-08-09 05:49:43","updated_at":"2024-08-09 05:50:03","page":10,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=10","job_id":"7227551603652308993","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"hc_policy","value":null},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-08-09 05:49:43","domain":"com","geo_location":null,"id":"7227551603652308993","limit":10,"locale":null,"pages":16,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B099TJGJ91","source":"amazon_reviews","start_page":2,"status":"done","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-08-09 05:50:03","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7227551603652308993","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7227551603652308993/results","method":"GET"},{"rel":"results-content","href_list":["http://data.oxylabs.io/v1/queries/7227551603652308993/results/2/content","http://data.oxylabs.io/v1/queries/7227551603652308993/results/3/content","http://data.oxylabs.io/v1/queries/7227551603652308993/results/4/content","http://data.oxylabs.io/v1/queries/7227551603652308993/results/5/content","http://data.oxylabs.io/v1/queries/7227551603652308993/results/6/content","http://data.oxylabs.io/v1/queries/7227551603652308993/results/7/content","http://data.oxylabs.io/v1/queries/7227551603652308993/results/8/content","http://data.oxylabs.io/v1/queries/7227551603652308993/results/9/content","http://data.oxylabs.io/v1/queries/7227551603652308993/results/10/content","http://data.oxylabs.io/v1/queries/7227551603652308993/results/11/content","http://data.oxylabs.io/v1/queries/7227551603652308993/results/12/content","http://data.oxylabs.io/v1/queries/7227551603652308993/results/13/content","http://data.oxylabs.io/v1/queries/7227551603652308993/results/14/content","http://data.oxylabs.io/v1/queries/7227551603652308993/results/15/content","http://data.oxylabs.io/v1/queries/7227551603652308993/results/16/content","http://data.oxylabs.io/v1/queries/7227551603652308993/results/17/content"],"method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7227551603652308993/results?type=raw","method":"GET"},{"rel":"results-content-html","href_list":["http://data.oxylabs.io/v1/queries/7227551603652308993/results/2/content?type=raw","http://data.oxylabs.io/v1/queries/7227551603652308993/results/3/content?type=raw","http://data.oxylabs.io/v1/queries/7227551603652308993/results/4/content?type=raw","http://data.oxylabs.io/v1/queries/7227551603652308993/results/5/content?type=raw","http://data.oxylabs.io/v1/queries/7227551603652308993/results/6/content?type=raw","http://data.oxylabs.io/v1/queries/7227551603652308993/results/7/content?type=raw","http://data.oxylabs.io/v1/queries/7227551603652308993/results/8/content?type=raw","http://data.oxylabs.io/v1/queries/7227551603652308993/results/9/content?type=raw","http://data.oxylabs.io/v1/queries/7227551603652308993/results/10/content?type=raw","http://data.oxylabs.io/v1/queries/7227551603652308993/results/11/content?type=raw","http://data.oxylabs.io/v1/queries/7227551603652308993/results/12/content?type=raw","http://data.oxylabs.io/v1/queries/7227551603652308993/results/13/content?type=raw","http://data.oxylabs.io/v1/queries/7227551603652308993/results/14/content?type=raw","http://data.oxylabs.io/v1/queries/7227551603652308993/results/15/content?type=raw","http://data.oxylabs.io/v1/queries/7227551603652308993/results/16/content?type=raw","http://data.oxylabs.io/v1/queries/7227551603652308993/results/17/content?type=raw"],"method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7227551603652308993/results?type=parsed","method":"GET"},{"rel":"results-content-parsed","href_list":["http://data.oxylabs.io/v1/queries/7227551603652308993/results/2/content?type=parsed","http://data.oxylabs.io/v1/queries/7227551603652308993/results/3/content?type=parsed","http://data.oxylabs.io/v1/queries/7227551603652308993/results/4/content?type=parsed","http://data.oxylabs.io/v1/queries/7227551603652308993/results/5/content?type=parsed","http://data.oxylabs.io/v1/queries/7227551603652308993/results/6/content?type=parsed","http://data.oxylabs.io/v1/queries/7227551603652308993/results/7/content?type=parsed","http://data.oxylabs.io/v1/queries/7227551603652308993/results/8/content?type=parsed","http://data.oxylabs.io/v1/queries/7227551603652308993/results/9/content?type=parsed","http://data.oxylabs.io/v1/queries/7227551603652308993/results/10/content?type=parsed","http://data.oxylabs.io/v1/queries/7227551603652308993/results/11/content?type=parsed","http://data.oxylabs.io/v1/queries/7227551603652308993/results/12/content?type=parsed","http://data.oxylabs.io/v1/queries/7227551603652308993/results/13/content?type=parsed","http://data.oxylabs.io/v1/queries/7227551603652308993/results/14/content?type=parsed","http://data.oxylabs.io/v1/queries/7227551603652308993/results/15/content?type=parsed","http://data.oxylabs.io/v1/queries/7227551603652308993/results/16/content?type=parsed","http://data.oxylabs.io/v1/queries/7227551603652308993/results/17/content?type=parsed"],"method":"GET"}]}}