{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B010OYASRG?reviewerType=all_reviews&pageNumber=3","asin":"B010OYASRG","page":3,"pages":5890,"reviews":[{"id":"R3HLCUJBI99HRW","title":"5.0 out of 5 stars More Boom for the buck!","author":"Placeholder","rating":5,"content":"Don’t let the size of the speaker for you. It is power packed with boom… AND Crystal clear sound quality for sure and last during my whole eight hour shift at work on battery charge highly recommend just buy it don’t think about it!","timestamp":"Reviewed in the United States August 6, 2024","profile_id":"AG23GKWPU5HJH6BVTO3WJWANQONQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2PV77OLY3LES2","title":"5.0 out of 5 stars Cool little speaker","author":"Kent Carpenter","rating":5,"content":"This is cool little speaker that gives surprisingly good sound. It’s a great choice for a work room or on the patio when you don’t need to blast it down the neighborhood. I like to rubberized edges as I fits well","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AG5GEYRSRRMPHDSALBRW5GZ2P5CQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R154QMJIBNQ0VP","title":"5.0 out of 5 stars The OontZ Angle 3...very Impressive!","author":"Craig Witek","rating":5,"content":"Edited 07/01/2024:Just got the 2nd one. These little Bluetooth speakers are impressive!! I'm starting an outdoor movie night here in my very small town. These will work perfectly! But...hey Oontz....how about a linkable Bluetooth bottom firing subwoofer?? That would be killer!!Loud & Clear! Great Buy here!Happy 4th of July!!I use this for music and as a sound source for the projector TV.Size...battery life...sound quality...easy of use...All on Point!! I was shocked at the sound quality that came out of a speaker approximately the side of a 12oz beverage can.You won't regret this Bluetooth speaker purchase!! I'll be buying a second one ASAP.Edited:I've read reviews saying this speaker \"doesn't produce bass\". That's a lie...lol. For a $20 speaker the bass is way better than I thought it would be. The passive radiator can be heard and is working. It's not a $100+ speaker so it shouldn't be compared to one. Sound quality it superior for the price!!","timestamp":"Reviewed in the United States June 11, 2024","profile_id":"AGEQANSOIGPED33645OIJXWOQ6TA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1VAMLKQRTW69X","title":"5.0 out of 5 stars Great speaker for the price","author":"David T. Shoop","rating":5,"content":"For the price, this is a great speaker. Plenty of volume without distortion and the size is just right. Use it on my deck and you can hear it anywhere in the in the backyard. Good size for the beach or in a golf cart. Would certainly consider buying again if the occasion arises.","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AEHED5GDKVRS3DLOCLOJT72AJIZQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3PD3AWSYAT0WH","title":"5.0 out of 5 stars The Sultan of Sound for Android and iPhones!","author":"LindaLBKA","rating":5,"content":"Behold the OontZ Angle 3 - the maestro of melodies, the sultan of sound, the auditory virtuoso that has graced our lives with an unrivaled symphony of sonic bliss! Let me regale you with the wonders of this technological marvel that has become the heart and soul of our music-filled abode.First and foremost, let's talk about the wireless wizardry that is the OontZ Angle 3. With a staggering 100 ft wireless range, this speaker defies the boundaries of ordinary sound devices, allowing us to roam freely without sacrificing the fidelity of our favorite tunes. It's like having our own personal concert hall in every corner of our home!The compatibility dance with our diverse smartphone collection is where the OontZ Angle 3 truly shines. As a household with both iPhone and Android devices, the speaker plays the role of a harmonious mediator, effortlessly recognizing and syncing with both platforms without a hitch. No more bickering over technology - the OontZ Angle 3 unites us in a sonic celebration!Let's not forget the nostalgia-inducing durability of this audio juggernaut. We were already proud owners of an older model from a decade ago that continues to serenade us with its timeless tunes. Inspired by its enduring performance, we decided to expand our auditory empire and acquired a second Angle 3. It's like having a musical time machine that spans generations - a testament to the enduring quality of OontZ products.And oh, the sound quality! Brace yourselves for aural euphoria as the OontZ Angle 3 cranks up the volume to levels that defy its compact size. Crystal clear sound? Check. Rich bass that reverberates through your soul? Double-check. It's like having a front-row seat at a concert, with every note and beat resonating with pristine perfection.To top it all off, the IPX5 waterproof rating ensures that our musical escapades can venture into the great outdoors without fear of liquid interference. Pool parties, beach picnics, or impromptu rain dance sessions - the OontZ Angle 3 is our trusty companion through it all.In conclusion, if you're in the market for a Bluetooth speaker that transcends the ordinary, look no further than the OontZ Angle 3. It's not just a speaker; it's a maestro conducting a symphony of joy in your life. Elevate your auditory experience, embrace the sound revolution, and join the legion of OontZ enthusiasts who revel in the magic of music with this exceptional device! 🎶✨","timestamp":"Reviewed in the United States February 19, 2024","profile_id":"AF2IFAJRR4C6IHLPQRFTW54ZDHIA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R1TEI1HD4R89Z3","title":"5.0 out of 5 stars Has great sound and bass!!!","author":"Donald Moran","rating":5,"content":"I bought this for when I travel for work. Great investment!!! Now I can watch my Prime Video movies, on my laptop, at the hotels with great sound! I'm hard of hearing and this ROCKS!!! WISH I WOULD'VE BOUGHT 2!!!","timestamp":"Reviewed in the United States August 3, 2024","profile_id":"AGC4IADTU2NWPIIC6DLPCW5X57JA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2A87U8HVVMOXB","title":"5.0 out of 5 stars Love it","author":"Unknown","rating":5,"content":"Definitely better than what I expected, caught it on sale and read the reviews and so how many people purchase and I said okay you know what let me try this one the worst case that let happen is not good and I throw it out but I can happily said worth it and I don't have to throw it out I love it as loud as perfect for my environment, and also for work. 😍🙌🏾","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AEWCKJEPNCPTOU3PNHSR57N4R6TA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2U2E5X50KSV5M","title":"4.0 out of 5 stars The OontZ Angle 3 Bluetooth Speaker - A Revelation in Portable Audio Experience","author":"Amazonlover","rating":4,"content":"From the moment I unboxed the OontZ Angle 3 Bluetooth Speaker, it was an unspoken understanding that my auditory experience would never be the same. A journey that began with a sprinkle of skepticism has metamorphosed into an unrivaled relationship between man and machine. This isn't just a Bluetooth speaker; it's a harmonious blend of top-notch sound engineering, aesthetic beauty, and unparalleled functionality, ensuring every listening moment is a treat for the senses.While it's a temptation to be swayed by the plethora of high points, the aim of this review is to offer a balanced perspective. I will delve deep into the many admirable qualities but also pinpoint areas that have room for improvement.🔊 Phenomenal Sound Quality and Clarity: The first time I connected my smartphone to the OontZ Angle 3 and played some tunes, I couldn't help but marvel at the depth of the sound. With 10 watts of audio power, the speaker projects crystal clear sound even at high volumes without any distortion. Whether I'm streaming classical music, hip-hop, or an intriguing podcast, the audio fidelity remains consistently impressive. The bass, often the Achilles heel for many portable speakers, is surprisingly robust, enriching my playlist with full, resonant low notes that never overpower the melody.🌦 Robust Durability with IPX5 Rating: What caught my eye was the IPX5 water-resistant rating. I tested it out on a family beach day, and let's just say this little beast can take a splash and still belt out your favorite tunes like nothing happened. This feature makes it a perfect companion for outdoor adventures, bringing a newfound resilience to the world of portable speakers.📱 Swift and Stable Connectivity: Compatibility and connectivity are the unsung heroes of any wireless device. The Bluetooth 5.0 technology ensures the OontZ Angle 3 pairs smoothly with all kinds of devices—be it Android, iOS, Windows, or Mac. What's more, it maintains this connection tenaciously, making annoying dropouts a thing of the past.🎨 Aesthetic and Functional Design: Beyond its robust engineering, the OontZ Angle 3 is a visual delight. Its sleek black body, complemented by discreet control buttons, is as functional as it is stylish. The design is intuitive, with the rubberized exterior not only providing an elegant aesthetic but also a comfortable grip, ensuring it won't easily tumble over if you're partying a little too hard.🔋 Exceptional Battery Life: With its long-lasting battery, the OontZ Angle 3 pushes the boundaries of what portable speakers can achieve. I managed to get close to a full day of usage at moderate volume levels on a single charge. The freedom this affords you, especially when you're outdoors or away from a power source, is genuinely liberating.However, to give a balanced view, it's only fair to bring up an area for potential enhancement:🔘 Button Responsiveness: Though generally user-friendly, the tactile feedback on the control buttons could be improved. At times, they require a firm press to register, making me wonder if I've successfully adjusted the volume or skipped a track.To encapsulate, the OontZ Angle 3 Bluetooth Speaker earns its 5-star rating without a sliver of doubt. Its minor quirks are inconsequential when stacked against its myriad of features and exceptional performance. With its mesmerizing audio quality, rugged durability, seamless connectivity, stylish design, and robust battery life, it stands head and shoulders above the competition.So if you're looking for a reliable, feature-packed, and exceptional-sounding portable Bluetooth speaker, your search ends here. I wholeheartedly endorse the OontZ Angle 3. It promises an auditory journey that's rewarding, expansive, and full of surprises. And that, in essence, is the purest form of what music or any auditory experience should be—an enriching journey that tantalizes the senses, one note at a time.I hope this comprehensive review has been enlightening and helps you make an informed decision. Here's to elevating our lives with the power of sound, one beat, one note, and one song at a time. Thank you for taking the time to read, and may your life be a melody of beautiful experiences!","timestamp":"Reviewed in the United States June 3, 2023","profile_id":"AG62UD7Q67DBARLYYTGSWHASW33Q","is_verified":true,"helpful_count":16,"product_attributes":"Color: Black"},{"id":"R3MXANO58UN4J0","title":"5.0 out of 5 stars Awesome sound!","author":"Laretha Stevens","rating":5,"content":"Opened it. Charged it. Instant connection. Bass is awesome for such a small device. Sound is clear. Lots of volume. Plan to use it and the bathroom and on the patio. Connects to audio and calls. Great buy!","timestamp":"Reviewed in the United States August 7, 2024","profile_id":"AHQWRIGBV4ARZE25HVL7OWQYKNZA","is_verified":true,"product_attributes":"Color: Black-Waterproof"},{"id":"R16STFHRBZAZ2U","title":"4.0 out of 5 stars Certainly not the best in market but does the job.","author":"Pratik","rating":4,"content":"If you can spend more go fir JBL or Bose.In the budget segment this is one of the best options i would say. Used it for more than 3 years before it stopped working.","timestamp":"Reviewed in the United States August 7, 2024","profile_id":"AFTWZJC65CIT7M3C7OFSILAUFSWA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B010OYASRG","product_name":"OontZ Angle 3 Bluetooth Speaker, up to 100 ft Wireless Range, Portable Speaker for iPhone, Android Phones, Louder Volume, Crystal Clear Sound, Rich Bass, IPX5 Portable Bluetooth Speaker (Black)","parse_status_code":12000},"created_at":"2024-08-09 05:00:37","updated_at":"2024-08-09 05:00:39","page":3,"url":"https://www.amazon.com/product-reviews/B010OYASRG?reviewerType=all_reviews&pageNumber=3","job_id":"7227539244464499713","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B010OYASRG?reviewerType=all_reviews&pageNumber=4","asin":"B010OYASRG","page":4,"pages":5890,"reviews":[{"id":"R2147W08HE2QBS","title":"5.0 out of 5 stars Great sound!","author":"Jean Jordan","rating":5,"content":"When travelling, I like to listen to audio books but I have had issues with portable speaks not having a decent volume. This speaker is amazing! I can hear everything over road noise. Sound is very clear. It sits perfectly on my center console.","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AEMWQ2MC5H22AWYP3RCDMLOCNTDQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R347W9SW23TAE8","title":"4.0 out of 5 stars Good little speaker","author":"Jason O","rating":4,"content":"Let me tell you, I've had this speaker since 2018, I've taken it and semi inclement weather conditions, it's decently loud and turned up especially at the beach when it's windy, reason why I gave it four stars is because the battery doesn't last more than 3 hours or so, also, it would be nice if it has something closer to 360° sound but then again it's not that kind of speaker so I'm not rating it off of that","timestamp":"Reviewed in the United States July 10, 2024","profile_id":"AHCLKIGFJWIV2ULHYU4JRIQW62FA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RV4XPJWV34UE","title":"5.0 out of 5 stars Nice but Tiny","author":"T. Fout","rating":5,"content":"First things first, it’s a nice little speaker. The sound quality is decent for the size of the unit and it looks cool with the Coca-Cola branding. I must say however that it is extremely small. I admit I didn’t read the dimensions before I ordered, and expected it to be pretty small given the price point, but not so small that it would fit in my hand. It suits my need for something to play music on the deck, and is water resistant, so it’s a keeper. The build quality seems good for the price, but time will tell. I was shipped an obvious “open box” unit, but since everything appeared as new and it operates properly, I’m not going to bother with complaining to Amazon. Probably won’t happen to you…","timestamp":"Reviewed in the United States June 16, 2024","profile_id":"AF6CQKHCHFBQVCYLP4BH22553MOQ","is_verified":true,"product_attributes":"Color: Red-Coke"},{"id":"R1RO7NV1NR2K2F","title":"5.0 out of 5 stars Great Speaker!","author":"Melody","rating":5,"content":"I bought this in 2017 and it is just now starting to not charge. It’s been a great speaker! Good, loud sound and bass. I hope in repurchasing I’m getting the same great speaker!","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AFVIEIYEZX3EJNX6CVUBZXZIITDA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2Q2M3P8KXMDCH","title":"5.0 out of 5 stars Portable/great sound OontZ Angle 3","author":"Susan L. Zorn","rating":5,"content":"I just received my OontZ Angle 3 shower plus Bluetooth speaker yesterday. It charged pretty quickly. I was do excited to try it. It paired up with my Samsung Galaxy S10 easily. I have been able to enjoy my Playlist from my phone through this awesome speaker. I took it outside while I pulled weeds - it was so great. Easy to move around. I can adjust the sound from my phone or right on the speaker. It will be great to take to the pool too! Also another great thing I was able to send a text to the company for a free 2 year warranty. They texted back immediately. It was a real person responding. They answered any questions I had - it was great! Highly recommend the product and the company!","timestamp":"Reviewed in the United States June 12, 2024","profile_id":"AE6G2XGEZROXXNRHUBLE4ZRV5E4A","is_verified":true,"product_attributes":"Color: Black-Waterproof"},{"id":"R2PA9J8R2UIOMC","title":"5.0 out of 5 stars Love it!","author":"Jammer","rating":5,"content":"I just bought this during a prime days! I already love this little speaker so much! The bass is perfect, it is plenty loud enough, easy to use and super portable. I've used it for several hours a day since purchasing and haven't had to charge it yet.","timestamp":"Reviewed in the United States July 26, 2024","profile_id":"AEEPEBNINMDHWSNREOQYMTP5RMWQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1RAUMULBWRKET","title":"5.0 out of 5 stars Works great!","author":"Amazon Customer","rating":5,"content":"Good sound for the size. Has a voice that announces on or off when you press the power button. A little heavy on my pants belt, but hasn’t been a problem.","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AE4PVW3CWA3UGAYQZ5PXHGEVALZQ","is_verified":true,"product_attributes":"Color: Black-Clip"},{"id":"R21ZYEN07X44LX","title":"5.0 out of 5 stars Amazing for the size","author":"Amazon Customer","rating":5,"content":"This little thing ROCKS! Highly recommend and i have never drained it so far. Good base thats not over done. I would absolutely buy again. LOVE IT!!","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AEN3AXNDAJ2SQ7WN7D35FUGO6ZSQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2GUWZUVC44LBI","title":"4.0 out of 5 stars Not very loud","author":"Amazon Customer","rating":4,"content":"Wouldn’t be good for a party but the sound is great just not very loud","timestamp":"Reviewed in the United States August 1, 2024","profile_id":"AHOODFRJSL6J66FH4KBJOU7HCN2Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"RG3TOVLRRJJWI","title":"5.0 out of 5 stars Great sound. Great convenience","author":"Nanny bug","rating":5,"content":"Great portable blue tooth speaker. My husband and I enjoy using it and love that there’s not clutter with wires. Great for seniors","timestamp":"Reviewed in the United States August 5, 2024","profile_id":"AFPEJZTF3JAES6P7GAG4LL7POWLA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B010OYASRG","product_name":"OontZ Angle 3 Bluetooth Speaker, up to 100 ft Wireless Range, Portable Speaker for iPhone, Android Phones, Louder Volume, Crystal Clear Sound, Rich Bass, IPX5 Portable Bluetooth Speaker (Black)","parse_status_code":12000},"created_at":"2024-08-09 05:00:37","updated_at":"2024-08-09 05:00:41","page":4,"url":"https://www.amazon.com/product-reviews/B010OYASRG?reviewerType=all_reviews&pageNumber=4","job_id":"7227539244464499713","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B010OYASRG?reviewerType=all_reviews&pageNumber=5","asin":"B010OYASRG","page":5,"pages":5890,"reviews":[{"id":"R3GV3SEQ2UDR7C","title":"5.0 out of 5 stars Great sound and design","author":"Y. K.","rating":5,"content":"This new version of the Angle3 is about an inch shorter than the older version. Ordered several of these speakers over the years, so I assumed it was the same size and didn’t pay attention to the specs. Same great sound and ease of use. More features than the older version. They make great gifts that everyone, regardless of age, appreciates. If they have a phone they will love it.","timestamp":"Reviewed in the United States July 10, 2024","profile_id":"AFIB3VFFYDMCAV2PMRJSPH6RSUGA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1HO054WIEXZQW","title":"4.0 out of 5 stars Great sound","author":"Tray","rating":4,"content":"Bought these before and the lightening deals make it a no brainer.","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AGMO4LFXM7YOQSHQUP72YVUDHEBQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R18KCMKLWMZSGE","title":"5.0 out of 5 stars Better then I thought","author":"Shawn","rating":5,"content":"I expected little for the size and price.. I recommend these for background music for your home events. We use these to have one outside and one speaker inside, you can adjust the volume in each one or you can have them in the same room to use as left and right speakers.. Good product for the price.","timestamp":"Reviewed in the United States July 15, 2024","profile_id":"AGWYKGE3PHMLOX4I5WQ4OIY3ITFQ","is_verified":true,"product_attributes":"Color: Black-Dual"},{"id":"R34C1S2J3ZLFGQ","title":"4.0 out of 5 stars Plenty loud","author":"John A. Quincy","rating":4,"content":"Awesome speaker I have on my Can Am Ryker. Not really great over 55 but is small and lets me be aware of my surroundings.","timestamp":"Reviewed in the United States July 26, 2024","profile_id":"AG2K2X52KDF6NQQFKL2ENRETL2JA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R39IOH1ZAZEI0C","title":"4.0 out of 5 stars Sound loud, Great Presentation","author":"Cline","rating":4,"content":"It is a very good product. The Sound balance could be better but it's good, it is sound very very loud. The only negative remark about it is it's a very small speaker. I expected it to be bigger but it worths the price.","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AHA22IYZY7VMW3K7J2CGUW4PAJVQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2CMMQKC64EN49","title":"5.0 out of 5 stars Perfect","author":"Kat","rating":5,"content":"This was just what I needed. I needed a “radio” for my car dash, and this is the only one on the market that doesn’t roll because of its shape. It produces a great sound and was easy to setup and use. It fits just where I need it to and looks great. 10/10","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AGL7PHNUBIWSCMQJZEEBTYEVHGIA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2KZ256TBEZF63","title":"5.0 out of 5 stars A good little speaker","author":"Amazon Customer","rating":5,"content":"I really like this little speaker, although I wish I could have paired it with another OontZ speaker that I purchased a little later in order to get stereo sound. I couldn’t pair it with the other one.","timestamp":"Reviewed in the United States July 24, 2024","profile_id":"AGW4SUKZ4WTL4OBDD3SGTBERDTGQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1JMTACN2IYCKP","title":"5.0 out of 5 stars Big sound for a small speaker!","author":"Timothy L.","rating":5,"content":"Nice sound, after I figured out I needed the volume up on my phone to make it louder! Nice size!","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AEITDKLFRLL65MCMYN7LDGYM4IOA","is_verified":true,"product_attributes":"Color: Black-Waterproof"},{"id":"R1D3AJGPCGUG3G","title":"5.0 out of 5 stars Great sound for $cheap$!","author":"Jon MD","rating":5,"content":"Wow. As a consumer who has almost universally purchased high-end stereo and speaker equipment, namely Harman Kardon and Bose, shocked at just how adequate this portable Bluetooth speaker is. It is not above and beyond rate Worthy, and I'm not about to start a Party in the Park with it, however, it is a great replacement for my lost Bose speaker which has a crappy clip & fell off my bike while riding. Highly recommend for personal use in shower & clipped to belt/bag while running, skateboarding, etc. Frequency range is great for mids, while good high-end & adequate bass. While my old Bose mini has slightly better bass, this speaker actually sounds brighter and more lively while also feeling sturdier and better built! Definitely recommend!","timestamp":"Reviewed in the United States June 7, 2024","profile_id":"AETLPXX3NQNUQJJRDBOSD5UVMO4Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black-Clip"},{"id":"R1S6DCOLV05KTV","title":"5.0 out of 5 stars Surprised at the sound at this price","author":"Regular Joe","rating":5,"content":"Purchased this on Prime day deal instead of getting the JBL clip which was double the price and no prime day deal.Simple pairing, very good sound, nice size and heavy duty clip.Highly recommend.","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AFY63OYECZAAX5GW5N6PU2T6J2FA","is_verified":true,"product_attributes":"Color: Black-Clip"}],"page_type":"Question","asin_in_url":"B010OYASRG","product_name":"OontZ Angle 3 Bluetooth Speaker, up to 100 ft Wireless Range, Portable Speaker for iPhone, Android Phones, Louder Volume, Crystal Clear Sound, Rich Bass, IPX5 Portable Bluetooth Speaker (Black)","parse_status_code":12000},"created_at":"2024-08-09 05:00:37","updated_at":"2024-08-09 05:00:42","page":5,"url":"https://www.amazon.com/product-reviews/B010OYASRG?reviewerType=all_reviews&pageNumber=5","job_id":"7227539244464499713","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B010OYASRG?reviewerType=all_reviews&pageNumber=6","asin":"B010OYASRG","page":6,"pages":5890,"reviews":[{"id":"R3O7DOWGGG05G7","title":"4.0 out of 5 stars Good speaker","author":"Theresa Afflick","rating":4,"content":"Amazing speaker , keeps charged for good while , it’s of good quality ,not heavy but i thought it would be bigger but it’s a good speaker","timestamp":"Reviewed in the United States July 26, 2024","profile_id":"AFODVEMOFQIDOBJT55U3MNI2BBRA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1ZX6U9FOUQ1MC","title":"5.0 out of 5 stars reaches everywhere in the house","author":"David Huntington","rating":5,"content":"Has good sound and is perfect for me when I am working on a project in the house.","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AFPUE5LREV5BD5IJDF66QSSPS5UQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R35SMZ550KH4FB","title":"5.0 out of 5 stars Powerful Speaker","author":"Maui Sweet Home","rating":5,"content":"I needed a wireless speaker for my back patio. This one is powerful and I am happy having no prior experience or knowledge about wireless speakers.","timestamp":"Reviewed in the United States July 24, 2024","profile_id":"AEX6DIYLGCWOMSIN5TSXSYK7IZMA","is_verified":true,"product_attributes":"Color: Black-Clip"},{"id":"R1EVZG9FTX4YEG","title":"5.0 out of 5 stars Satisfecha","author":"Lupita Reyna","rating":5,"content":"Me gusta la facilidad de conectar y transportar ésta bocina, tiene buen sonido y ocupa poco espacio.","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AH3GC6VYHOUPJRBBMZ6JBFLA7JCQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1PLLCA7O8CAW5","title":"5.0 out of 5 stars Little speaker…BIG sound","author":"Laura","rating":5,"content":"Great little speaker that you can take anywhere. The sound is full. Charge lasts for a nice long time. Great product for a great price.","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AECQ43LEZPOFMZNABNYF3BLH52UA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R9EEZNNLBGCRI","title":"5.0 out of 5 stars Perfect speaker for me!","author":"abby terry","rating":5,"content":"I ordered this speaker so I could play my Amazon music on the deck and not worry if it got left out in the rain. Sound is good, durable, holds a great charge, and when I set up my warranty the customer service was beyond wonderful!","timestamp":"Reviewed in the United States July 11, 2024","profile_id":"AGRLB22NRNZXAH2KKDNB7Q6GMG6A","is_verified":true,"product_attributes":"Color: Black-Waterproof"},{"id":"RA9A4LXS5LTF4","title":"5.0 out of 5 stars Better than my 100-200$ Bose","author":"Rob","rating":5,"content":"pay for good tech, not Bose marketing budgetEven my 9 year old son laughed when he heard how much better this little speaker sounds than the 179$ Bose piece of garbage","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AEQGM66W2VPHEY6ZO77UDUUK66RQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2I6I2OM6XLOUA","title":"5.0 out of 5 stars Great Sound","author":"mac","rating":5,"content":"I bought this speaker to use when watching video on my Kindle . It is easy to pair with a device. I get a lot of listening with each charge. The sound is good for both music and voice. I would definitely recommend.","timestamp":"Reviewed in the United States July 9, 2024","profile_id":"AFKDA4V7SVY3GDKGYPMIHIVNCNMA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2H8DLM339PK8N","title":"4.0 out of 5 stars Convinent","author":"MARIA E","rating":4,"content":"I liked it, wasn’t very very loud but for the price it’s decent I like using it when I’m getting ready or if we travel somewhere.","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AHSVJJBXFXUFFOPYUBDT44I5HKOQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2Q0BJA1GFN0IC","title":"5.0 out of 5 stars Cambridge Soundworks quality in a small portable package!","author":"mark","rating":5,"content":"I bought Soundworks home theater setups back in the 80's and was always impressed with the sound quality their engineers are able to put in such small packages. While everyone was concentrating on bigger speaker boxes for their speakers, these people focussed on the sound. I'm glad things haven't changed over the years. To be honest, when I first opened the package, I thought - oh boy another small tinny blue tooth speaker. Then I remembered who built it. I was right - LOUD solid volume, great separation (considering the speakers are about a half inch apart) and even decent bass punch. They haven't lost their touch.","timestamp":"Reviewed in the United States June 9, 2024","profile_id":"AHOGYLPVOHGQQMQYKOPVT7GAF4PQ","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B010OYASRG","product_name":"OontZ Angle 3 Bluetooth Speaker, up to 100 ft Wireless Range, Portable Speaker for iPhone, Android Phones, Louder Volume, Crystal Clear Sound, Rich Bass, IPX5 Portable Bluetooth Speaker (Black)","parse_status_code":12000},"created_at":"2024-08-09 05:00:37","updated_at":"2024-08-09 05:00:43","page":6,"url":"https://www.amazon.com/product-reviews/B010OYASRG?reviewerType=all_reviews&pageNumber=6","job_id":"7227539244464499713","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B010OYASRG?reviewerType=all_reviews&pageNumber=7","asin":"B010OYASRG","page":7,"pages":5890,"reviews":[{"id":"R1FW9JZREBXD90","title":"5.0 out of 5 stars Must buy!!","author":"Rodrigo Rincon Jr","rating":5,"content":"Purchased this for work July 2018 and it’s still work s amazingly. Loud and portable , small which makes it easy to carry and place anywhere. You can always power directly to the plug or just charge and take it on the go.","timestamp":"Reviewed in the United States July 20, 2024","profile_id":"AGKXAT4FGRX6OVZPT6MGNFOQBKTQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1OJD6CF4NSIS1","title":"4.0 out of 5 stars Good sounding speaker","author":"Michael","rating":4,"content":"The battery life is great and a pretty good sound for the size.","timestamp":"Reviewed in the United States July 24, 2024","profile_id":"AGYP52LCBGMHRLJJNKAGC5MD6KOQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2YXDM9GAO3VPH","title":"5.0 out of 5 stars GREAT PRODUCT FOR THE VALUE!!","author":"Tre S.","rating":5,"content":"Powerful sound for a small box, light weight, and overall great purchase for the price!","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AHFT7EHH5BWD2HIQKF3S2JZ233BA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RE2PXL0LZZ1QB","title":"5.0 out of 5 stars Great quality!","author":"Rene mohlenbrink","rating":5,"content":"Has a great sound for the size and it doesn't cut off if put on highest volume. No echo. Good clear sound.","timestamp":"Reviewed in the United States July 26, 2024","profile_id":"AGM5VSXHBNKJVSTVZS2KB6XWUU6A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3P82SHWP3X3NZ","title":"5.0 out of 5 stars Nice take anywhere speaker(s)!","author":"Kouklamama","rating":5,"content":"I’ve been using and enjoying this speaker for a long time, so I bought a second one reading that they can be synced for stereo. Together they’re now awesome. They “pair” easily, nice Bluetooth range, sound great! across the range and can be placed anywhere. Love them!","timestamp":"Reviewed in the United States July 8, 2024","profile_id":"AEXW7S5WNDYTID4HX3MUWWK2LY2Q","is_verified":true,"product_attributes":"Color: Black-Clip"},{"id":"R9A8ZMN1VE62L","title":"5.0 out of 5 stars Great speaker for less $$","author":"Mike E.","rating":5,"content":"Small easy to use with great sound. I use it in parades on my car to play music pertains to the event","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AEAT7EZ6HOEP4TFO2O3T2QGHCFMQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1CC63QHXRV909","title":"4.0 out of 5 stars Wrong charging port installed in unit..?","author":"R. Bub","rating":4,"content":"Bought this to replace the exact same make and model I purchased a couple of years ago was that was damaged due to a drop from a high place (oops!). So anyway, this is weird. The old model charged with a USB-C cord, because that's the kind of charging port it had. The replacement I received today also came with a USB-C charging cord. However... The charging port is a micro USB? Luckily, I happen to have a micro USB charging cord from some piece of technology I must have used some time in the early 2000s (See! Hoarding all of those old cords and placing them in the junk drawer DID pay off!). It is now charging, and when I paired it to my phone, it sounded just as good as my old speaker did. Not really sure how a micro USB port was installed into this speaker, especially when the unit arrived with a provided USB-C charging cord (and the accompanying user manual reflects this as well). Not going to return it, but it's just odd that the accompanying literature, and the cord provided, both indicate a USB-C cord should be used to charge the unit. Not returning it, as it's a quality product, but just a weird glitch in the factory manufacturer, I suppose?","timestamp":"Reviewed in the United States April 3, 2024","profile_id":"AH2QTEFFNBAWC24KPGIZIHQT4CGA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1NYYK2I9HY23Z","title":"5.0 out of 5 stars Bold Sound","author":"Jaime Starr","rating":5,"content":"Love the sound. Connects to Bluetooth easily. However, I should have read the description more carefully because it DOES NOT connect directly to any Alexa devices as I’d hoped. Bummer.","timestamp":"Reviewed in the United States July 25, 2024","profile_id":"AFMINUJQANMW4AXPHPV7LO6WTPJA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RMFZKVKN38T7O","title":"4.0 out of 5 stars Nice","author":"Amazon Customer","rating":4,"content":"It is nice for the price..volume is not good is I have it turned all the way up! I mean full volume. Then I turn my phone volume all the way up as well... and I still can't hear it … I bought it reading all the good positive reviews battery life is good .. I guess the price wise it is good but sound I give only 2 stars.","timestamp":"Reviewed in the United States June 18, 2024","profile_id":"AHZA7HDBPG36OKJHFJSSTBABUHQA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3UYM8V7AVEKZ7","title":"5.0 out of 5 stars Lasted me 7 years!!","author":"Caclhoqu","rating":5,"content":"This little speaker has been with me through many camping trips, picnics, showers, and bbqs over the years and was easily the best $30 I’ve spent in a while!","timestamp":"Reviewed in the United States July 25, 2024","profile_id":"AG5RK74T67FGKGX4ZOZQSVYWG5QQ","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B010OYASRG","product_name":"OontZ Angle 3 Bluetooth Speaker, up to 100 ft Wireless Range, Portable Speaker for iPhone, Android Phones, Louder Volume, Crystal Clear Sound, Rich Bass, IPX5 Portable Bluetooth Speaker (Black)","parse_status_code":12000},"created_at":"2024-08-09 05:00:37","updated_at":"2024-08-09 05:00:47","page":7,"url":"https://www.amazon.com/product-reviews/B010OYASRG?reviewerType=all_reviews&pageNumber=7","job_id":"7227539244464499713","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B010OYASRG?reviewerType=all_reviews&pageNumber=8","asin":"B010OYASRG","page":8,"pages":5890,"reviews":[{"id":"R16JK7DTBETH4M","title":"5.0 out of 5 stars Very loud little speaker","author":"guitar man","rating":5,"content":"I use this speaker in my garage when working. The sound is decent and the rechargeable battery last a long time.","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AFSINLA2YQB3DW572W3RQTIAUZ7A","is_verified":true,"product_attributes":"Color: Red"},{"id":"R13HO71BMFOVF5","title":"4.0 out of 5 stars Sound!","author":"Rick.Watson","rating":4,"content":"Small but mighty! Great second speaker because not great bass.","timestamp":"Reviewed in the United States July 21, 2024","profile_id":"AG6STFRDJZUMWP2OLDO3BFDABCYA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1TR0LSXH07IE6","title":"4.0 out of 5 stars Loud sounds less bass","author":"Amari","rating":4,"content":"The sound is loud but the bass could be a bit better. It’s good for the price.","timestamp":"Reviewed in the United States July 11, 2024","profile_id":"AGSBBNEP26U2XVDBIU6TJXERAX4A","is_verified":true,"product_attributes":"Color: Black"},{"id":"RYNDAYVBAN7J6","title":"5.0 out of 5 stars Excellent sound quality and bass","author":"F. Rivers","rating":5,"content":"Amazing sound emanating from such a small form factor. Very happy.","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AGEKYLXLK7ZMYH3GR7SKOYZY67PQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RQHZ8V0WVBUQG","title":"5.0 out of 5 stars Great Purchase","author":"KLA","rating":5,"content":"Sound is very good considering the price. I enjoy it every day.","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AHA3SUD4WYCENXCLMCAJKOH22WVA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1UQAPOXUKQ7B7","title":"5.0 out of 5 stars 2 Years Later Still Works","author":"Leeya Thercy","rating":5,"content":"Powerful and reliable. Good for a single room. Love it.","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AGD2V3AMOIKAQXXKPK33AEK6V7VQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1ADJI53SV1PEN","title":"5.0 out of 5 stars Excelente","author":"Rocio","rating":5,"content":"Muy buen sonido. El tamaño es ideal. Muy buena compra","timestamp":"Reviewed in the United States August 5, 2024","profile_id":"AFM3EOYZR4HHLM5ZD2FL45S64DGA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RB4D0JR7TF4SZ","title":"5.0 out of 5 stars Gift","author":"Vicki Hergert","rating":5,"content":"Gift for my son and he uses it at work","timestamp":"Reviewed in the United States August 6, 2024","profile_id":"AEGYVUIBAMCBVNNI7DHX6P7WEZAA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1CG5COSR5MB8G","title":"5.0 out of 5 stars Works as expected","author":"Robert Foster","rating":5,"content":"Pairs quickly. Sound quality ok. Decent price.","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AE3CMYXXULPX3OC6FLC2IDITXVFQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RKOXA69SOINYF","title":"5.0 out of 5 stars Good bass","author":"Favian","rating":5,"content":"Sounds fantastic. Happy with purchase","timestamp":"Reviewed in the United States August 6, 2024","profile_id":"AEDU23IYC3E7M2AN7MVYDKGZNLFQ","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B010OYASRG","product_name":"OontZ Angle 3 Bluetooth Speaker, up to 100 ft Wireless Range, Portable Speaker for iPhone, Android Phones, Louder Volume, Crystal Clear Sound, Rich Bass, IPX5 Portable Bluetooth Speaker (Black)","parse_status_code":12000},"created_at":"2024-08-09 05:00:37","updated_at":"2024-08-09 05:00:48","page":8,"url":"https://www.amazon.com/product-reviews/B010OYASRG?reviewerType=all_reviews&pageNumber=8","job_id":"7227539244464499713","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B010OYASRG?reviewerType=all_reviews&pageNumber=9","asin":"B010OYASRG","page":9,"pages":5890,"reviews":[{"id":"R1K3R5Y327MLHO","title":"5.0 out of 5 stars Bluetooth speaker","author":"DC","rating":5,"content":"Cheap & sounds great","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AG4JEEM5YHWI33HBAB6R5ABNM6LQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RPCAYUSQQU442","title":"5.0 out of 5 stars ABSOLUTELY BEST BLUETOOTH SPEAKER EVER !!!! ESPICALLY FOR THE MONEY AND SIZE","author":"Scott Colantropo","rating":5,"content":"ABOUSLETY THE BEST BLUETOOTH WIRELESS SPEAKER I EVER HEARD !!! AND IDK THEY MADE A SMALLER VERSION AND THIS ONE PLUS 2 OTHER BIGGER SIZES !!! SO DEPENDING UPON HOW MUCH YOU WANNA SPEND AND WHAT YOUR NEEDS ARE FOR SIZE AND CARRYING IT ECT .....THIS SPEAKER I ACTUALLY LUCKLY BOUGHT ON A \" LIGHTNING DEAL \" FOR $18.56 !!!!!!!! IT WAS 56% OFF WICH LUCKLY I BOUGHT I ALWAYS DO REARCH AND READ REVIEWS AND DEPENDING UPON IF THE ITEM IS UNIQUE THAT I NEED AND I JUST KNOW ITS GOOD OR THE BRAND IT MAY ONLY HAVE A LOWER AMOUNT OF REVIEWS ..... AND THIS ONE HAD IVER 177,000 REVIEWS WHEN I BOUGHT IT LIKE THE BIGENNING OF OCTOBER 2022 ABOUT .... ONLY HAD IT A FEW WEEKS NOW ..... AND IT RWADY HAS OVER 185,000 REVIES AT 4 1/2 STARS .... SO I KNEW IT WAS A GREAT PRODUCT ALREADY AFTER SEEING THAT MANY REVIEWS WICH NOT EVERYONE LEAVES EVEN IF THEY LIVE THE ITEM !!!!BUT THE SOUND IS ABSOLUTELY AMAZING ..... I DONT EVEN USE THE VOLUME ANYMORE ON MY 75\" VIZIO TV AND WHEN I DO THE LIP-SYNYC ON IT IS PERFECT AND I KEEP IT RIGHT BY MY HEAD SOUNDS EVEN BETTER THEN MY T.V. ..... THE BASS IS AMAZIN IT ON IT I CAN FEEL THE VIBRATION IN MY HAND FROM THE BASS ..... ITS INCREDIBLE HOW THIS LITTLE SPEAKER SOUNDS SO GOOD WITH BASE AND QUALITY .... I KEEP IT PLUGGED IN MY 6FT CHARGING CORD ... NOT ALL THE TIME WHEN I WANT TO MOVE TO MY RECLINER OR JUST PUT TBE SPEAKER ON MH CHEST WHEN I WATCH T.V. .... ESPICALLY THAT IT HAS A 14 HOUR BATTERY LIFE SO I COULD JUST KEEP IT WIRLESS ALL DAY IF I WANT THEN CHARGE IT AT NIGHT WICH IS KIND OF THE POINT OF A BLUETOOTH WIRELESS SPEAKER IN THE FIRST PLACE ....LOLBUT EVEN MY 80 YR OLD FATHER WHO NOT INTO ANYOF THIS STUFF BUT CANT HEAR GREAT IN ONE EAR AS HE HAS A RINGING IN ONE EAR FROM TBE VIETNAM WAR AND HIM AND MY MOTHER GO BACK AND FORTH ARGUING ABOUT THE VOLUME CAUSE HER HEARING IS FINE BUT ODDLY ENOUGH SHE WANTS THE VOLUME LOUDER AND I SHOWED MY FATHER TBE SPEAKER AND SUPRISINGLY HE SHOWED SO MUCH INTREST AND HANDLED IT AND ASKED HOW IT WORKED ( AND I KNOW HE WOULD LOVE IT AND GET GREAT USE OUT OF IT KEEPING IT RIGHT NEAR HIS COUCH ON THE NIGHT TABLE WEAR MY MOTHER SITS IN TBE RECLINER RECLINED BACK WATCHING T.V. ...... I TOLD HIM EVEN THLUGH I HAVE A SMART T.V. ( CAUSE HIS SONY 52\" HE BOUGHT LIKE in 2007 ) DOENST HAVE BLUETOOTH AND I HAD TO BUY A BLUETOOTH TRANSMITTER SO I COULD USE MY BOSE HEADPHONES WHE WATCHING TV AND I SPENT LIKE $42.00 ON A GOOD EASY TO USE ONE THAT CAN HAVE MULTIBLE BLUETOOTH DEVICE HOOKED UP AT ON E BHT SAID YOU CAN BUY A CHEAP OR BASIC ONE FOR $10-$15 THAT JUST UGS RIGHT INTO YHE USB PORT AND NOT AS HIGH TECH AS MINE WITH ANTENNAS AND A BUNCH OF WIRES GOING INTO THE T.V AS WELL AS THE USB PORT.","timestamp":"Reviewed in the United States October 16, 2022","profile_id":"AHSLFRZGF3ZREAFQJ4HXPY4JUQPQ","is_verified":true,"helpful_count":16,"product_attributes":"Color: Black"},{"id":"RJZ9DS3AZ1SXQ","title":"5.0 out of 5 stars Loud AF","author":"Zack k.","rating":5,"content":"I work in a van with no radio and couldnt heat anything over metal ladder and tools banging around. This COVERS all that noise.","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AFDTOG7QP3UPDP365MSXHLPLPL4A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R20MZLIRCUI6C0","title":"5.0 out of 5 stars Great sound","author":"Jay L","rating":5,"content":"Has great sound. Easy to use. I wish there was an app to use with it.","timestamp":"Reviewed in the United States July 25, 2024","profile_id":"AHU4BXLQJWC5KJFK2YN4GORUEYLA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3V9I835SPDC1L","title":"5.0 out of 5 stars Hell of a machine","author":"Klekas","rating":5,"content":"Had to buy another because it was on sale and my first one is starting to die on me…Bought this thing back in 2017…spent a couple years in college with me and have used it pretty much every week. At least 2-3 times a week. Never had an issue. Bluetooth has always connected and (as you can see in the picture how worn it is) never had any water issues when I used in the shower or gotten water on it. Connected and started up every time for the last 7 years. For 20ish bucks…you can’t beat it.","timestamp":"Reviewed in the United States June 7, 2024","profile_id":"AEYQHYOD2NP3ZSRCXKO6PLPH67OQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2DDF0A8SCTN5U","title":"5.0 out of 5 stars Great","author":"Mike T.","rating":5,"content":"Bought this on sale. Around 20$. I use it golfing in our golf cart, in the garage and on the deck. Great sound and value in a small package. Good battery life too! Reccomend","timestamp":"Reviewed in the United States July 7, 2024","profile_id":"AF25XJBHBCQUAXKS6N2WHNDQQC6A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3SP9M9Z4D4WRM","title":"5.0 out of 5 stars Loud little speaker","author":"Kenny","rating":5,"content":"Good sounds and loud enough at work to hear over all the machines running.","timestamp":"Reviewed in the United States July 18, 2024","profile_id":"AECYWBRKMPLJGHUSGFUS7JHXJN4Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"RM0XK2QTMZN7V","title":"5.0 out of 5 stars Good product","author":"Bryce","rating":5,"content":"Decent speaker for the price. Good range and I like that its USB-C rechargeable.","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AGJXOAQVN5IGHOTXIPD45VHI5RGQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2OU5Y1MNDFYMS","title":"5.0 out of 5 stars Puppy Proof!","author":"KaseyShopping","rating":5,"content":"At first, I was impressed. Now, after an evening of this speaker being unattended with our puppy, I'm blown away!I will admit, when the package arrived, I was disappointed at the size of the speaker box. \"Crap. This tiny thing is going to screech like nails on a chalkboard,\" I thought. It was destined to be a full-time garage speaker for my husband and his outside tinkerings. I had the thought of a large, deep-bassed speaker that would blast his horrible obsession with Chicago onto the neighborhood. I had expectations of a speaker that would compete with a miter saw or drill. After 10 seconds with this box, my expectations were lowered and I was happy that I bought it through Amazon and their BA return policy since I had the feeling it was getting sent right back. WOW WAS I WRONG!I gave this to him last weekend as a pre-Christmas gift since he was spending 7 hours outside detailing his pickup. (Literally, 6 Hours and 22 Minutes to be exact.) He was very excited to get the speaker and was ecstatic when he was able to easily pair it with his cellphone. I was on standby waiting to help him since he is technologically incompetent. He paired the speaker with his cellphone in under 2 minutes without my help. That is a new record!I was disappointed to see the small charging cable, but we quickly realized that it is compatible with and Micro-charger. I grabbed a spare 2.0 Amp charger with the thought that the battery would need some juice. To my surprise, I walked outside to hear it pumping out tunes and blasting Ambrosia down the driveway. I kept the charger beside the speaker just in case it died. Again, sheer shock that it lasted all afternoon and all evening.I thought this speaker was going to be the replacement for the 20 year old sony boombox in the garage. I thought it was going to be turned on for a few hours every weekend. Within a few hours, I saw my husband carrying it around the house from room to room. From the garage, to the kitchen, to the gun room and then to the bathroom for some shower tunes. He was carrying it around like it was a cellphone or in his case, like he was 7 years old again in 1985 with a battery powered radio.I was surprised at how small it was. It will fit comfortably in someone's hand and the weight of the product is maybe about a pound. It is the size of a Coke can, but the sound that comes from it is impressive. I would have guessed that the sound and the bass would be from a much larger speaker. It could be more crisp and clear yes, but for the size it's a lot of bang for the buck!The volume on the speaker for the size is mind blowing. My husband had it pumping in the garage, and I could hear it through doors and walls 75 feet away.The speaker impressed me once again last night when our puppy ripped off the two rubber ends. \"Well, it was cheap enough that I don't mind buying another one,\" I thought to myself. Just to see what happens, I reassembled the speaker with the now cracked rubbers ends. Surprisingly, the speaker works like it is fresh out of the box! I may order another one to live in our camper full-time!It has withstood my husband and his horrible taste in 80's music, our new Pit Bull and kept a charge for hours. It's small enough to throw in a purse, small bag or even in a decent sized glove compartment. I was disappointed when it first arrived that it wasn't large and obtrusive because in my mind, that is how a speaker relays mind blowing sound. Instead, the times have changed and a speaker like The Oontz that is compact and well designed can out perform the giant-must-be-plugged-in-all-the-time-speakers. I have a $100+ Bluetooth speaker that will remain nameless. I love it the speaker and it projects wonderful sound, but it has to be plugged in constantly to get premium sound. Also, when the speaker is on battery power, it only lasts about 45 minutes. The Oontz has embarrassed the pants off of my \"snotty-high-end-speaker\". Especially how I could get 4 Oontz units for the price of my house speaker. Point: Oontz!This thing started off as a regrettable purchase and quickly progressed to be one of the best presents I have ever purchased. I have been proven wrong and that good things do indeed come in small packages. I have a feeling that this thing is going to be one of those products that is never going to die!!","timestamp":"Reviewed in the United States December 19, 2015","profile_id":"AEZJYYMKBBUBTSPKHA22CFYLOYFQ","is_verified":true,"helpful_count":55,"product_attributes":"Color: Red"},{"id":"RS9B5JTJFEYHZ","title":"5.0 out of 5 stars Great audio and great value","author":"Av","rating":5,"content":"This speaker rocks. And the fact it's $20 bucks is awesome. I bring it to the beach all the time and use it at like 25% volume it's super loud and great audio","timestamp":"Reviewed in the United States July 11, 2024","profile_id":"AGR27RN722BOGQBMRE7SNJ3CNV7A","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B010OYASRG","product_name":"OontZ Angle 3 Bluetooth Speaker, up to 100 ft Wireless Range, Portable Speaker for iPhone, Android Phones, Louder Volume, Crystal Clear Sound, Rich Bass, IPX5 Portable Bluetooth Speaker (Black)","parse_status_code":12000},"created_at":"2024-08-09 05:00:37","updated_at":"2024-08-09 05:00:50","page":9,"url":"https://www.amazon.com/product-reviews/B010OYASRG?reviewerType=all_reviews&pageNumber=9","job_id":"7227539244464499713","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B010OYASRG?reviewerType=all_reviews&pageNumber=10","asin":"B010OYASRG","page":10,"pages":1,"reviews":[{"id":"R2F6RR5TX52L47","title":"5.0 out of 5 stars For the price and portability…","author":"Kenneth","rating":5,"content":"The sound is pretty good! For the price and nice battery operating time, I love it. I had the Oontz solo speaker for 3 years before it finally died. I used it every day as my computer speaker and tiny home speaker.","timestamp":"Reviewed in the United States June 29, 2024","profile_id":"AFFDLEQAKK4KL6GE566QZNJLNURQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R37FKFMQJL9RM5","title":"5.0 out of 5 stars decent little unit","author":"Eric B.","rating":5,"content":"Small inexpensive, easy to set up, very portable. Appears to be able to withstand any reasonable drops it might receive. The sound quality seems to be pretty good for the price. This should fit most people's needs pretty well","timestamp":"Reviewed in the United States June 15, 2024","profile_id":"AEXXISH4NPBIB3TABX23M6FCJP4A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2RVUPRFOMZHB2","title":"5.0 out of 5 stars perfect","author":"Danette H","rating":5,"content":"the sound is rich and fills my room. Just what I wanted.","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AH6WDRWRBY6RRR5NDFSUJKBACAWA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3704T106081JR","title":"4.0 out of 5 stars Not bad for $20","author":"jared","rating":4,"content":"You get what you pay for. For $20 it isn’t bad at all. Not for bass heads but sound quality isn’t bad. I left mine out on a fence post for two weeks. It down poured and has been hot and humid. I picked it up off the ground because it fell due to the wind I assume. To my surprise it turned on and plays music just like before.","timestamp":"Reviewed in the United States June 8, 2024","profile_id":"AEG55X4TGYFXV45MGTDRCAR3YKZA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1R38V8C3FBGSQ","title":"4.0 out of 5 stars Decent sound for a tiny device","author":"Ariznatives","rating":4,"content":"First, the positives:I'm happy enough with the sound. I only listen to old time radio and podcasts, however, so I'm not able to really say much for music except for a brief test with some classical music. The sound is clear, crisp, and loud enough for me.The unit is small and stable when sitting, and can lay on the bed beside my head or on my pillow at night without rolling off. It would work well on any mostly flat surface.It was very simple to pair Bluetooth with my phone following the directionsAlthough I would prefer actual buttons for controls the little raised sections in the rubber do work and one can feel what they are in the dark if you've given it a good look and memorized their shapes.Battery life seems great. I use it for about 12 hours every night on a charge and it still has charge left.The negatives:The little rubber door for the USB-C is very difficult to open if one doesn't have fingernails. It pretty much closes on its own so you are stuck opening it every time you need to charge.Once open, one will find the metal surround of the USB-C port is not flush so it is difficult to plug in a cable without actually looking at it like one can with a phone or nearly any other USB-C device. If I need to plug in when it's dark, I have to use my phone for some light to get it plugged in. Not thrilled with that.The biggest disappointment is that I cannot skip tracks forward or backward with the volume buttons. I have to use my phone for that. This is the main reason (along with the other two less major issues) for not giving the full 5-star rating.","timestamp":"Reviewed in the United States December 2, 2023","profile_id":"AEVKEFZWEETWNMTVBEJH4UW6ZUGQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R38JZH6GYUU9AS","title":"5.0 out of 5 stars EXCELLENT Battery Life","author":"Barbary","rating":5,"content":"This speaker is a tiny powerhouse with INSANE battery life. I use this in my old truck because the radio isn't in great shape. It has great sound and I can go a couple weeks of intermittent use without charging it! It connects easily to my phone and the color coordinates with my truck interior!","timestamp":"Reviewed in the United States June 28, 2024","profile_id":"AFLHMZUBEW6WEXKZU77WKQ6AM3OA","is_verified":true,"product_attributes":"Color: Blue"},{"id":"R18SJNTLQZC9F6","title":"5.0 out of 5 stars A home run.","author":"Gale","rating":5,"content":"Great sound at a fair price and the shape stays put.","timestamp":"Reviewed in the United States July 9, 2024","profile_id":"AGHUMZ4IM6RNKHAO5WL6RCNA5BQA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RO9LNSPQGEYA6","title":"5.0 out of 5 stars Very nice speaker!!","author":"Beth J","rating":5,"content":"I love the size of this, it's small and easy to find a place for it and take anywhere. The sound is great. Bluetooth makes it easy to use for different things and control. I've used Spotify and alexa so far. The charge last a long time. I played it about 6 hours while I was outside, it still has 60% power. I'm very happy to have found this little gem!","timestamp":"Reviewed in the United States June 20, 2024","profile_id":"AFVTP74C4XB2RJOYS3C56QVBHGSA","is_verified":true,"product_attributes":"Color: Black-Waterproof"},{"id":"R13MPME6KPNGHM","title":"5.0 out of 5 stars Love it!","author":"T. R. McCallister","rating":5,"content":"This was an impulse buy, but it was a good one. Easy to use, works well, sound is great for the size and portability. Would buy again.","timestamp":"Reviewed in the United States June 24, 2024","profile_id":"AF3PVKFYL2XFVWBREMIABJSXKAVA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R28ES6VG22PC1J","title":"5.0 out of 5 stars Sounds great!","author":"Blandonite","rating":5,"content":"Amazing sound for the money, easy to pair and use. Drowns out the backyard neighbor's crappy radio when we're in the pool.","timestamp":"Reviewed in the United States June 25, 2024","profile_id":"AHGDLRQV46NFWTSXB6377ICRVFTQ","is_verified":true,"product_attributes":"Color: Golf-Green"}],"page_type":"Question","asin_in_url":"B010OYASRG","product_name":"OontZ Angle 3 Bluetooth Speaker, up to 100 ft Wireless Range, Portable Speaker for iPhone, Android Phones, Louder Volume, Crystal Clear Sound, Rich Bass, IPX5 Portable Bluetooth Speaker (Black)","parse_status_code":12000},"created_at":"2024-08-09 05:00:37","updated_at":"2024-08-09 05:00:51","page":10,"url":"https://www.amazon.com/product-reviews/B010OYASRG?reviewerType=all_reviews&pageNumber=10","job_id":"7227539244464499713","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"hc_policy","value":null},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-08-09 05:00:37","domain":"com","geo_location":null,"id":"7227539244464499713","limit":10,"locale":null,"pages":18,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B010OYASRG","source":"amazon_reviews","start_page":3,"status":"done","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-08-09 05:00:51","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7227539244464499713","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7227539244464499713/results","method":"GET"},{"rel":"results-content","href_list":["http://data.oxylabs.io/v1/queries/7227539244464499713/results/3/content","http://data.oxylabs.io/v1/queries/7227539244464499713/results/4/content","http://data.oxylabs.io/v1/queries/7227539244464499713/results/5/content","http://data.oxylabs.io/v1/queries/7227539244464499713/results/6/content","http://data.oxylabs.io/v1/queries/7227539244464499713/results/7/content","http://data.oxylabs.io/v1/queries/7227539244464499713/results/8/content","http://data.oxylabs.io/v1/queries/7227539244464499713/results/9/content","http://data.oxylabs.io/v1/queries/7227539244464499713/results/10/content","http://data.oxylabs.io/v1/queries/7227539244464499713/results/11/content","http://data.oxylabs.io/v1/queries/7227539244464499713/results/12/content","http://data.oxylabs.io/v1/queries/7227539244464499713/results/13/content","http://data.oxylabs.io/v1/queries/7227539244464499713/results/14/content","http://data.oxylabs.io/v1/queries/7227539244464499713/results/15/content","http://data.oxylabs.io/v1/queries/7227539244464499713/results/16/content","http://data.oxylabs.io/v1/queries/7227539244464499713/results/17/content","http://data.oxylabs.io/v1/queries/7227539244464499713/results/18/content","http://data.oxylabs.io/v1/queries/7227539244464499713/results/19/content","http://data.oxylabs.io/v1/queries/7227539244464499713/results/20/content"],"method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7227539244464499713/results?type=raw","method":"GET"},{"rel":"results-content-html","href_list":["http://data.oxylabs.io/v1/queries/7227539244464499713/results/3/content?type=raw","http://data.oxylabs.io/v1/queries/7227539244464499713/results/4/content?type=raw","http://data.oxylabs.io/v1/queries/7227539244464499713/results/5/content?type=raw","http://data.oxylabs.io/v1/queries/7227539244464499713/results/6/content?type=raw","http://data.oxylabs.io/v1/queries/7227539244464499713/results/7/content?type=raw","http://data.oxylabs.io/v1/queries/7227539244464499713/results/8/content?type=raw","http://data.oxylabs.io/v1/queries/7227539244464499713/results/9/content?type=raw","http://data.oxylabs.io/v1/queries/7227539244464499713/results/10/content?type=raw","http://data.oxylabs.io/v1/queries/7227539244464499713/results/11/content?type=raw","http://data.oxylabs.io/v1/queries/7227539244464499713/results/12/content?type=raw","http://data.oxylabs.io/v1/queries/7227539244464499713/results/13/content?type=raw","http://data.oxylabs.io/v1/queries/7227539244464499713/results/14/content?type=raw","http://data.oxylabs.io/v1/queries/7227539244464499713/results/15/content?type=raw","http://data.oxylabs.io/v1/queries/7227539244464499713/results/16/content?type=raw","http://data.oxylabs.io/v1/queries/7227539244464499713/results/17/content?type=raw","http://data.oxylabs.io/v1/queries/7227539244464499713/results/18/content?type=raw","http://data.oxylabs.io/v1/queries/7227539244464499713/results/19/content?type=raw","http://data.oxylabs.io/v1/queries/7227539244464499713/results/20/content?type=raw"],"method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7227539244464499713/results?type=parsed","method":"GET"},{"rel":"results-content-parsed","href_list":["http://data.oxylabs.io/v1/queries/7227539244464499713/results/3/content?type=parsed","http://data.oxylabs.io/v1/queries/7227539244464499713/results/4/content?type=parsed","http://data.oxylabs.io/v1/queries/7227539244464499713/results/5/content?type=parsed","http://data.oxylabs.io/v1/queries/7227539244464499713/results/6/content?type=parsed","http://data.oxylabs.io/v1/queries/7227539244464499713/results/7/content?type=parsed","http://data.oxylabs.io/v1/queries/7227539244464499713/results/8/content?type=parsed","http://data.oxylabs.io/v1/queries/7227539244464499713/results/9/content?type=parsed","http://data.oxylabs.io/v1/queries/7227539244464499713/results/10/content?type=parsed","http://data.oxylabs.io/v1/queries/7227539244464499713/results/11/content?type=parsed","http://data.oxylabs.io/v1/queries/7227539244464499713/results/12/content?type=parsed","http://data.oxylabs.io/v1/queries/7227539244464499713/results/13/content?type=parsed","http://data.oxylabs.io/v1/queries/7227539244464499713/results/14/content?type=parsed","http://data.oxylabs.io/v1/queries/7227539244464499713/results/15/content?type=parsed","http://data.oxylabs.io/v1/queries/7227539244464499713/results/16/content?type=parsed","http://data.oxylabs.io/v1/queries/7227539244464499713/results/17/content?type=parsed","http://data.oxylabs.io/v1/queries/7227539244464499713/results/18/content?type=parsed","http://data.oxylabs.io/v1/queries/7227539244464499713/results/19/content?type=parsed","http://data.oxylabs.io/v1/queries/7227539244464499713/results/20/content?type=parsed"],"method":"GET"}]}}