{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B07594HZ6Y?reviewerType=all_reviews&pageNumber=2","asin":"B07594HZ6Y","page":2,"pages":1155,"reviews":[{"id":"R3AU4JEA0K6PB4","title":"4.0 out of 5 stars Good as a portable backup, but can't beat a system with a subwoofer","author":"DJ_Level_3","rating":4,"content":"I'll preface this by saying that this is a great speaker and I recommend it as a portable speaker for when you can't use a proper subwoofer.However, it is no replacement for a proper subwoofer, as without using copious bass boost on my phone, the subs in the songs I listen to are very quiet, especially on lower volume (such as indoor listening). With some bass boost and some volume, however, it does sound good with the low subs in songs like Escape by Noisestorm.It also gets very loud for its size, and the sound is good without excessive mids or highs. It is truly in stereo as well, which is nice. Overall, I'd give this an 9/10 as a portable backup to my home and car stereos, and a 7/10 as a general speaker.","timestamp":"Reviewed in the United States July 5, 2024","profile_id":"AHLYGB7QX4VN6T72QS66R6WWQZUQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R259841075134J","title":"4.0 out of 5 stars Sounds great! Connectivity tho...","author":"Ambrosia","rating":4,"content":"-The speaker sounds great, good volume, good range, I'm really pleased that I found a nice little speaker box to play for my little Visio flatscreen from 2010 that pumps out loud clear sound, treble and bass.-Battery life is short imo, BUT, I'd be happy to just leave it plugged in, as it's substituting for the speakers on an old tv. I'd be a lot happier if the charging cord was longer, I'd like 3 feet. Normally I'd have spares but this speaker has a type I don't have many interchangeable spares for. So this speaker is on a short leash.-But finally, and here's my sticking point: the bluetooth doesn't stay connected right. Several times since I got this last September have I had to make my laptop forget the speaker and reconnect it, to get it to work. I have the booklet, it's clear, it's fine, what's not fine is having to redo all this stuff again every now and then.Not sure I'll buy Tribit again to replace my other speaker box that's starting to get raspy on me. Might take a risk on a different brand.","timestamp":"Reviewed in the United States June 5, 2024","profile_id":"AHRBGX236QW2UAIOT6IE7DFWRTKQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R34I7C6PMU4FA8","title":"4.0 out of 5 stars good for inside the house or in your backyard","author":"Lance F.","rating":4,"content":"recieved it today and tested it out, I think it's pretty good for the price. the connectivity was fast and it's easy to set up all you have to do is turn it on and turn on the Bluetooth and you're set.slightly heavy not something I would want to be holding onto my pants or etc. was testing out the sound from outdoors and indoors and it'd be good for a house party. if you want to use it for renting out a big space like a hall for a babyshower or wedding etc. it might not be the best thing to bring and depend on for music","timestamp":"Reviewed in the United States July 8, 2024","profile_id":"AFU23PT5DYSYZGD2IFDHNVTD27XA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3VVWL758LY3AF","title":"5.0 out of 5 stars Really love this speaker!","author":"Vottofan","rating":5,"content":"Music generally sounds pretty good on an iPod or iPad--as long as you're listening through earbuds. Just playing it from the speakers is generally not a great musical experience. Knowing I would be spending a lot of time in my kitchen while baking goodies for Christmas, I decided to check out Amazon to see if I could find a small speaker to use with my iPod. I looked at two speakers--this one, and the OontZ Angle 3 Bluetooth Speaker. Both get high ratings, both had similar prices (on sale at the time) and I liked that the OontZ came in various colors. I spent several hours going back and forth, looking at features, reading a lot of reviews, and checking out the User Manuals for each that Amazon had posted. One thing I noticed was that the OontZ manual was significantly more detailed than the Tribit, and, not being very technologically savvy, that swayed me at first toward the OontZ. Before placing my order though, I went to the internet the next morning and typed in \"comparison of OontZ Angle 3 and Tribit Bluetooth Speakers.\" One review I found helped me finally decide which speaker to order. Someone gave his opinion about each, then actually played snippets of the same song on each of the speakers, demonstrating the sound on 3 (if I remember correctly) different sound levels. Though both speakers sounded pretty good, I could tell a slight difference between the Tribit and OontZ; the sound on the Tribit was a little fuller, with slightly more bass. I placed my order and received it later that same day. I had no problem linking the Tribit to my iPod via Bluetooth (the iPod recognized it immediately) and was soon listening to Christmas music as I baked cookies that evening. The only thing that would have made it better would be if it had come with a 3.5 mm AUX Cable so I could connect my iPod directly to the speaker, but I don't know that any speakers include that. Not a big deal...I can always see if Amazon has one and if not, I can still connect via Bluetooth. I didn't rate battery life because I don't know for sure how long it is before the battery has to be charged. The speaker worked out of the box, but I didn't know if it was fully or partially charged, so after using it that first evening for several hours, I plugged it in to charge. I've had it a week now; have used it 3-4 hours for several days during the week and haven't had to charge it again yet, so my guess is that battery life is pretty good. Overall, I'm very pleased with the Tribit and would heartily recommend it.","timestamp":"Reviewed in the United States January 4, 2024","profile_id":"AGISXRKCTEEMIRGCXRD6TXASO6JA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"RX7GIR5DNDBYG","title":"5.0 out of 5 stars Great affordable Bluetooth speaker","author":"M","rating":5,"content":"I’ve owned a Tribit speaker for several years, and have enjoyed it so much I’ve given two to friends who’ve heard ours and been amazed by the sound quality. It’s not a top-end speaker, and won’t power a major party, but it’s perfect for hanging out on the back deck with friends. Highly recommended!","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AGTEZ4SDVOMQRL3HLHAPKSIXRIDQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2WSLXHIFOLQ0E","title":"5.0 out of 5 stars Wow, just as good as Bose","author":"Alex","rating":5,"content":"I recommend that you do not sleep on this item. The manufacturer really created a good system and the items work just as good as bowls. The price is excellent and I highly recommend this item. Once you acquire it you will see for yourself that the sound is absolutely wonderful. A high recommendation of this item.","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AF2ZU2W2PXLFNZTGWN2ID3DNEV4A","is_verified":true,"product_attributes":"Color: Blue"},{"id":"R2UWC5UE1PYF01","title":"5.0 out of 5 stars Love this","author":"Jen","rating":5,"content":"Bought this after purchasing the Tribit Stormbox and love it just as much. Just wanted a smaller one to take to work but to also have one at home. As small as it is, it certainly didn't disappoint. 10/10 recommend","timestamp":"Reviewed in the United States August 3, 2024","profile_id":"AGAOH3F7456W24XW2UEUBOJUN6BA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2XXX7KYAV0ZKG","title":"4.0 out of 5 stars Best bang for your buck.","author":"Johnny Camacho","rating":4,"content":"This speaker is a good price for the amount of sound you need to have a good time.sound quality is very good the build is sturdy last a long time in a single charge depending on how long and hard you bump it for. I take this with me a lot of the time and people are always shocked at the sound quality. I put 4 stars but easy 4.5 if not 5. Hopefully this review will help you decide. I am also a DJ and to me sound is everything and this little sucker packs a punch.","timestamp":"Reviewed in the United States June 30, 2024","profile_id":"AEWQ22BOMYFZ2OXA634THGS6FAVQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1RPLO1S7GZ9HJ","title":"5.0 out of 5 stars Great speaker for price","author":"Dr LAR","rating":5,"content":"Excellent overall sound quality, especially bass. And good volume output given there are higher wattage versions available. I use this outdoors on a boat dock and it is plenty loud to cover approx 1500 sq ft area.","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AHSNXAGZSN3S6X62VFQDRT2PMR4Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2GFH4X7EW0PMR","title":"5.0 out of 5 stars Great. Lasts longer per charge than advertised.","author":"Dean L Wiley","rating":5,"content":"Even though not available any more (replaced by 'newer' version): Great. Lasts longer per charge than advertised. The sound is very good. Connected to a very old iPad 2.0 and Win11 laptop easily.","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AF4EXIRIAQ2H7U6S4KNAFPZUGQ6A","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B07594HZ6Y","product_name":"Tribit Bluetooth Speaker, XSound Go Speaker with 16W Loud Sound & Deeper Bass, 24H Playtime, IPX7 Waterproof, Bluetooth 5.0 TWS Pairing Portable Wireless Speaker for Home, Outdoor (Upgraded)","parse_status_code":12000},"created_at":"2024-08-09 05:11:06","updated_at":"2024-08-09 05:11:27","page":2,"url":"https://www.amazon.com/product-reviews/B07594HZ6Y?reviewerType=all_reviews&pageNumber=2","job_id":"7227541884300710913","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07594HZ6Y?reviewerType=all_reviews&pageNumber=3","asin":"B07594HZ6Y","page":3,"pages":1155,"reviews":[{"id":"RQ72WPCLIQ61I","title":"5.0 out of 5 stars Simply Amazing!","author":"Miks","rating":5,"content":"I was unfamiliar with this brand but decided to take a risk on this. I purchased this speaker so I could listen to music while I worked in my garden and in my greenhouse. Well let me outline the Pros and Cons of this speaker for you if you are looking for the perfect speaker!CONS- None!PROS- Awesome sound, Great Bass, no distortion when I turned up the volume. The sound worked well outside even at a significant distance. I have not even maxed out the volume except to test it. I usually find myself turning it down. The battery is amazing. I have been using it for several hours each day for a couple of weeks and I’ve only charged it twice. 👀 I find this amazing considering the amount of use it gets. I wondered how this would sound because I love crisp clean sounds and some speakers just don’t cut it. But this speaker was amazing and has made me a believer! I’ve even used it for phone calls. The sound wasn’t as crisp and clear during a call outside as my music was. But it was still a clear sounding call. I would buy this again!","timestamp":"Reviewed in the United States May 19, 2024","profile_id":"AHORJ5GCBNEXV4YIAHPVJ255AV5Q","is_verified":true,"helpful_count":10,"product_attributes":"Color: Black"},{"id":"R1PY462FV91UNM","title":"5.0 out of 5 stars Small size, amazingly big sound","author":"Danny C","rating":5,"content":"Cu-do's to Tribit. I took a chance and bought the large Tribit Stormblast boom box. It was much more than I had hoped for. So, along with the boom box, let's see what their little Xsound Go tiny speaker sounded like.This tiny little speaker, once again, shocked me. It's 16 watts of really great sound! My wife was amazed at the big sound coming from such a small speaker. It's six inches long, two inches wide and 2 inches high. It actually fits in my front pocket. But, but the sound is BIG. Easily sounds good in a good sized room. It's inexpensive a very portable. You won't be disappointed.","timestamp":"Reviewed in the United States June 19, 2024","profile_id":"AHVKUGQW6E6ZDF4GY4BKI4Z6TRKA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"ROW3YZTVAHKAX","title":"5.0 out of 5 stars you'll be surprised how loud this little speaker is!","author":"Tamara Stout","rating":5,"content":"bought to use for our outdoor wedding and you'll be surprised how loud this little speaker is! Well worth the $$.","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AHBAKXNGKU3ZQ7JDMX7TYYS7AXRA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1YUEYEEWMXTVO","title":"5.0 out of 5 stars Versatile uses","author":"Jo Francis","rating":5,"content":"I have used it by the pool, during dinner with guests and getting a grandchild to fall asleep.","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AGSL7DVVJVARME6IB2UBS5NPBJPA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3E7LYTLT9VAH7","title":"5.0 out of 5 stars Amazing Budget Speaker","author":"Zeke","rating":5,"content":"I have bought 5+ speakers in the past week trying to find a great budget speaker under $50. The Tribit takes the cake by far for me in my opinion. It's loud, has clear sound, and also offers some base (most low budget speakers don't get that great of base). I'm super happy with this product and I highly recommend it to anyone trying to find something a little more on the cheaper sound but still want great quality!","timestamp":"Reviewed in the United States July 1, 2024","profile_id":"AEZE44ULAQXV746NQB45FZKA2UFQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R14Z4GKKCAE8Z7","title":"5.0 out of 5 stars Sounds MUCH better than I expected","author":"Beta","rating":5,"content":"Most of my friends have bluetooth speakers of some type. I've heard most of them. Bought this on a whim to use when I wash my vehicle and I was floored. It is MUCH louder than I expected and the sound quality was amazing.I wound up showing it to pals that habe much more expensive \"name brand\" speakers and they all went and bought these.It always pairs very quickly and the battery seems to last forever. I have had mine run for 10 hours and still had charge left.I think it's an incredible value.","timestamp":"Reviewed in the United States June 20, 2024","profile_id":"AFRP6EAI3RELWZ62GHMVXLUFFP6Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3LKR4YVQRXZGC","title":"5.0 out of 5 stars Great sound.","author":"gizzy667","rating":5,"content":"Great sound from a little speaker. Reasonably priced! Perfect for an average size room...deck..ejtc.","timestamp":"Reviewed in the United States August 3, 2024","profile_id":"AGZF7SJOC32YAVDKULWQDVSGSIWA","is_verified":true,"product_attributes":"Color: Blue"},{"id":"R3CKSMJOKH63TT","title":"5.0 out of 5 stars Good sound","author":"Jim F.","rating":5,"content":"Small in size but sounds really good.","timestamp":"Reviewed in the United States August 5, 2024","profile_id":"AH2YHUN67OGSESR3WHC2ZYD47CIA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2CSYP4D2VGYS4","title":"5.0 out of 5 stars Terrific value","author":"Jeff Putnam","rating":5,"content":"Very good sound for the price--great","timestamp":"Reviewed in the United States August 3, 2024","profile_id":"AHBJNHD7YSU66Z4Y7BL4O4EFDYXA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R6WOY0Q41P92L","title":"4.0 out of 5 stars Good sound, good warranty service","author":"My personal info is not a commodity","rating":4,"content":"I am impressed with the sound quality for the price. It's advertised as 24 hour battery life. I haven't kept track, but can say for sure that it exceeds 10 hours. I haven't measured charging time, but don't have a complaint about that either. I appreciate that the word Tribit is subtly imprinted on the face of the unit because I don't like loud distracting logos on stuff that needs to blend with my home decor.I dropped a star off my rating because the auxiliary input went bad after 14 months. However, Tribit replied on the same day to my email about warranty service and shipped a replacement unit within two days. So I'd say that's excellent customer service.","timestamp":"Reviewed in the United States May 21, 2024","profile_id":"AEYKZOCR4SLVN5RYBEMJSCGMZCTA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B07594HZ6Y","product_name":"Tribit Bluetooth Speaker, XSound Go Speaker with 16W Loud Sound & Deeper Bass, 24H Playtime, IPX7 Waterproof, Bluetooth 5.0 TWS Pairing Portable Wireless Speaker for Home, Outdoor (Upgraded)","parse_status_code":12000},"created_at":"2024-08-09 05:11:06","updated_at":"2024-08-09 05:11:28","page":3,"url":"https://www.amazon.com/product-reviews/B07594HZ6Y?reviewerType=all_reviews&pageNumber=3","job_id":"7227541884300710913","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07594HZ6Y?reviewerType=all_reviews&pageNumber=4","asin":"B07594HZ6Y","page":4,"pages":1155,"reviews":[{"id":"R2UD2YFTU509RJ","title":"5.0 out of 5 stars Muy bueno por el precio","author":"Sebastian","rating":5,"content":"Muy buen sonido por lo que vale, además pedí un artículo usado y llegó uno nuevo!","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AGZS2X3QLNMRHDRCC2C7X24XJ35Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R35ZNLK342WDIQ","title":"5.0 out of 5 stars This little speaker is pretty impressive for its size.","author":"Doug A.","rating":5,"content":"Easy connection, great sound, controls could be more visible, almost impossible in low light. It’s not a deal breaker for sure.","timestamp":"Reviewed in the United States July 26, 2024","profile_id":"AEWYFZIBMLUZKBSHGQIC2QK3WE5Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1Q5YAACKPSSD5","title":"5.0 out of 5 stars Great for the money","author":"jt","rating":5,"content":"I love it.","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AF3YZBQA4U4N2KMYGSLBG3N5OG7Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1V7EIIIIBDGR0","title":"5.0 out of 5 stars Wires speacker","author":"Great product","rating":5,"content":"Great nice sound","timestamp":"Reviewed in the United States August 5, 2024","profile_id":"AHRQ4NJAA2IBSV37XUOS27OV2A6A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1EDDJAG0MP16T","title":"5.0 out of 5 stars Great little bluetooth speaker","author":"mdr","rating":5,"content":"It's well made and sound is good and loud enough to enjoy. I debated between buying a compact computer speakers or something like this. Ultimately, I choose this which I can use for both my laptop and also with my iphone via bluetooth. I can easily listen anywhere while a computer speakers will be inconvenient to move around. It's very compact only 6 1/2\" x 2 1/4\" x 2 1/4\" and not heavy so easy to carry it around. For the price, it's hard to beat.","timestamp":"Reviewed in the United States June 16, 2024","profile_id":"AEWBKDNXMEJZKLFRGDLEL4LUQQOQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R349ZGS41MZ8Z5","title":"4.0 out of 5 stars Good, but better can be had","author":"Michael Madarasz","rating":4,"content":"Hi there, I wanted to try the Tri-bit, got it delivered, but it doesn't sound as good as my Anker. They are about the same price.","timestamp":"Reviewed in the United States July 9, 2024","profile_id":"AGSFEJWOT6MTO3NFJPUXM6ZOK2LA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2TOW4NDC49QZY","title":"5.0 out of 5 stars Amazing sound quality for the price!","author":"Dr. Cheryl","rating":5,"content":"It worked great, once I could figure out how to attach it to a power supply. Duh... I had to find a u-tube video to discover how to plug it in. I didn't want to deface the product by prying on the wrong side of the AUX cover.","timestamp":"Reviewed in the United States July 6, 2024","profile_id":"AFV64MUCDMFKB3O43NX333V2AT5Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"RPRO6QDVDHIFZ","title":"5.0 out of 5 stars Good sound at great price point","author":"Steve T","rating":5,"content":"I needed to replace my Tribit Max and saw this model and given the price I purchased it. Arrived quickly and sounds great. No sound option (e.g. deep bass) but I rarely varied from the default sound on my Max so no issue for me. Much lighter too. I'll stick with this smaller model in the future if needed.","timestamp":"Reviewed in the United States June 27, 2024","profile_id":"AF5QNGAYPQLRU72AVO2JEOCVKX4Q","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R3I1KKRU53WYB5","title":"4.0 out of 5 stars Great Speaker for the Money","author":"warren blom","rating":4,"content":"Bought this speaker to try it out and am very happy with my purchase. The sound is very clear and this little box presents a very clear robust sound in a variety of locations inside and outside. Definitely a great purchase for me.","timestamp":"Reviewed in the United States June 12, 2024","profile_id":"AFY6BWLUBRSJPW27Z56FBF6GNEIQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1W45QE4QZY8P4","title":"5.0 out of 5 stars Tribit X-sound Go-Speaker","author":"Hank","rating":5,"content":"The sound is phenomenal. However, after charging the battery for six hours, the speaker shut down and required re-charge after only about two hours of play time. The instruction booklet that comes with the speaker is all but worthless. The booklet dimensions are about 2\" by 2\" with a thickness of about 3/16 of an inch - and most of it is written in a foreign language. There are no instructions about charging. NOTE - I did NOT use my computer to charge the speaker. I used a standard 5W brick that is also used for smart phones.Update to last eval: Follow-up to my last review. The manufacturer has offered me a complete refund for the Tribit speaker I purchased. But, I am going to hold on to my speaker, for now, and will go through another charge/recharge episode to see if I can improve on the results. I am very grateful to the manufacturer for their kind offer and their customer service.Update 3 May: I re-evaluate this product to 5 stars. I am convinced my original eval was based on a failure on my part. My Tribit speaker seems to be holding a charge as it should.","timestamp":"Reviewed in the United States April 20, 2024","profile_id":"AGC25FJRNLNDZGF2RKIX2K5PX42Q","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B07594HZ6Y","product_name":"Tribit Bluetooth Speaker, XSound Go Speaker with 16W Loud Sound & Deeper Bass, 24H Playtime, IPX7 Waterproof, Bluetooth 5.0 TWS Pairing Portable Wireless Speaker for Home, Outdoor (Upgraded)","parse_status_code":12000},"created_at":"2024-08-09 05:11:06","updated_at":"2024-08-09 05:11:30","page":4,"url":"https://www.amazon.com/product-reviews/B07594HZ6Y?reviewerType=all_reviews&pageNumber=4","job_id":"7227541884300710913","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07594HZ6Y?reviewerType=all_reviews&pageNumber=5","asin":"B07594HZ6Y","page":5,"pages":1155,"reviews":[{"id":"R1X5EGO2TAMCM7","title":"5.0 out of 5 stars Great speaker and connects easily but no outlet adapter","author":"Rob Sheppard","rating":5,"content":"This is great speaker and connects instantly. It’s get plenty loud for me indoors and outdoors. Mostly used for podcasts and music. It charges via usb c but doesn’t come with a wall adapter","timestamp":"Reviewed in the United States July 3, 2024","profile_id":"AFANILDFUEEVJGWVNDUQJUB22YBQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RXLYZYHRQ6AES","title":"5.0 out of 5 stars Tiny speaker BIG SOUNDS","author":"Elle","rating":5,"content":"I love this little guy! Sounds better than my tv","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AGI5SOLGL5R3NTWJKGJZH4WV42VA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3PX6MXE1Z4SP8","title":"5.0 out of 5 stars Very satisfactory","author":"Oracle","rating":5,"content":"I have an older version of this speaker, and needed a 2nd for a different location. This version is a bit smaller and lighter, but with all the sound capabilities I expected. I am not an extreme audiophile, can't comment on technical aspects of the sound, but it's completely satisfactory for my needs, very happy with my purchase.","timestamp":"Reviewed in the United States June 26, 2024","profile_id":"AGTTQOD4O5GIFJUFAJNXTNBEZJPA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R28YY626V1GIMR","title":"5.0 out of 5 stars Tiny Speaker","author":"Karen","rating":5,"content":"This a a great little speaker with wonderful sound.","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AFGBR5S7PDQSLD6ILTZ6GHDZC2CA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RUOMV7RSEYEJY","title":"5.0 out of 5 stars works great","author":"scott langton","rating":5,"content":"huge sound hooks up to blue tooth fast think i will buy a secondd one","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AHTYW5LGCDAYD3Z4J6XG7YBH3YIA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1PKA29ITVBQQU","title":"5.0 out of 5 stars Love it so much we bought two","author":"Amazon Customer","rating":5,"content":"These speakers are wonderful and provide a great audio experience in a compact package. They are great for working in the garage, outdoors, or just wanting to have music with you around the house. They connect easily to our phones. We kept fighting over the one we had so we bought a second so we could each be using them during our various tasks. I feel like the battery lasts a long time before completely dying as well. Great for the price!","timestamp":"Reviewed in the United States June 12, 2024","profile_id":"AGAWXGZ37SLXHKMJF4I3MEO4TCKQ","is_verified":true,"helpful_count":3,"product_attributes":"Color: Black"},{"id":"R24TZPV5Q4A57B","title":"5.0 out of 5 stars Great speaker","author":"Loujarz","rating":5,"content":"This speaker is small but mighty. It works great!","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AEAWKGI73D5YW3ULS5I76BJPYMJA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1DSSYIESSUVC3","title":"5.0 out of 5 stars Great little speaker.","author":"Judy E. Peroni","rating":5,"content":"This speaker is portable and held for several hours BEFORE I even charged it. I have charged it since (which only took a couple hours) and have now used it off and on the past 3 days and it’s still holding the charge. This Would easily fit in a backpack (it isn’t overly heavy) or sit on the summer porch for outdoor music.I love it and highly recommend it if you’re looking for a portable speaker with GREAT sound.","timestamp":"Reviewed in the United States June 8, 2024","profile_id":"AGYY7U3OO3BIAE3G3ZJVM7WHNW3A","is_verified":true,"product_attributes":"Color: Blue"},{"id":"R3EPWEY93GH1Q9","title":"5.0 out of 5 stars Very cool product","author":"Sabrina","rating":5,"content":"Good liked it!","timestamp":"Reviewed in the United States July 24, 2024","profile_id":"AEIQCQIS6FCUFMHSB5LQCZTZBLFA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RJCLNRVU841KS","title":"5.0 out of 5 stars Great sound","author":"B Williams","rating":5,"content":"Looks nice and great sound along with great price!!","timestamp":"Reviewed in the United States July 20, 2024","profile_id":"AFMI6BQZMLLBCU3LUQCRAUQJ4IMA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B07594HZ6Y","product_name":"Tribit Bluetooth Speaker, XSound Go Speaker with 16W Loud Sound & Deeper Bass, 24H Playtime, IPX7 Waterproof, Bluetooth 5.0 TWS Pairing Portable Wireless Speaker for Home, Outdoor (Upgraded)","parse_status_code":12000},"created_at":"2024-08-09 05:11:06","updated_at":"2024-08-09 05:11:31","page":5,"url":"https://www.amazon.com/product-reviews/B07594HZ6Y?reviewerType=all_reviews&pageNumber=5","job_id":"7227541884300710913","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07594HZ6Y?reviewerType=all_reviews&pageNumber=6","asin":"B07594HZ6Y","page":6,"pages":1155,"reviews":[{"id":"R2K6S7VFIHA6B2","title":"5.0 out of 5 stars Great speaker","author":"maricela hodge","rating":5,"content":"Works great with our tablets and great sound.","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AGFJQSUVIXHI4WCU6S6FXLSKD2VA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3UNUXZR6COG90","title":"5.0 out of 5 stars Excellent value","author":"Patricia","rating":5,"content":"So easy to use and a great value.Good sound quality. Holds a charge for a long time.","timestamp":"Reviewed in the United States July 18, 2024","profile_id":"AEWZD2PO46BRGCTAAF4EKO4KRNBA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R19XYMHE1PN5QN","title":"5.0 out of 5 stars Would buy again","author":"Bob","rating":5,"content":"This litttle speaker is loud for the size. Durable and has taken a beating, yet keeps on ticking. Absolutely love this thing.","timestamp":"Reviewed in the United States July 16, 2024","profile_id":"AHICRU5GZRASEF6VNYH3KFDSJ7QQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3GMUT2UZRMER1","title":"4.0 out of 5 stars Nice","author":"ArtieH","rating":4,"content":"Nice Bluetooth speaker but very bassy.","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AEDBWKMCV2Z45WR53OU2NJUKFL2Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R1KR4A1WV66X1N","title":"5.0 out of 5 stars Nice","author":"Sunkiss","rating":5,"content":"Impressed with the weight. The sound and bass. I use it under pillow at night","timestamp":"Reviewed in the United States July 20, 2024","profile_id":"AHD62BV5PPF3A4PPDN7EVHNH6LSQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3GBTWBDNHAMRT","title":"5.0 out of 5 stars Quality","author":"WWTLCL","rating":5,"content":"Great product! Sturdy and has good sound.","timestamp":"Reviewed in the United States July 24, 2024","profile_id":"AGEMQ5LHOBC4TBM74TEVLQXOF5YA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3ECAZXP60IDIE","title":"4.0 out of 5 stars Great for a portable speaker","author":"B G","rating":4,"content":"I use this on my deck and it's a great portable speaker. The sound quality and Bluetooth reception are superb. The speaker needs to be recharged after about 6-8 hours, so it lasts well during the day and can be recharged overnight","timestamp":"Reviewed in the United States June 21, 2024","profile_id":"AEKZVH6VLKSIMHIVEUNTFRMCAC6Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2U6U10OGVF0M5","title":"5.0 out of 5 stars Speaker","author":"gary thurston","rating":5,"content":"Good sound good size good charge","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AENJECZXL3DIUOZTOLGPMZEGXQWA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1M0XCODO6YHGE","title":"5.0 out of 5 stars Great sound","author":"K. E. Cameron","rating":5,"content":"Live this Tribit portable speaker. It gives off great sound and is very compact. Easy for me to recommend this one!","timestamp":"Reviewed in the United States July 16, 2024","profile_id":"AH3MKIOTYP5VEMV2VC3ABR3TPUSQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3BSRXGEGR9W76","title":"5.0 out of 5 stars Bought years ago and still working!","author":"Carrie S.","rating":5,"content":"I bought this like 5 or 6 years ago. I recently wanted to replace it because it was getting old and I leave it out in the rain sometimes (still works and sounds great though) but the other brand that I bought was not good. So I'm going to buy one of these again because it just works so well and sounds so good. I hope the new ones are as good as they were 5 years ago! I'll update later but the one I have is so worth the money. I took it everywhere with me.","timestamp":"Reviewed in the United States June 4, 2024","profile_id":"AEMXFHCOWMODD4VKWYKZ4B47IBGA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B07594HZ6Y","product_name":"Tribit Bluetooth Speaker, XSound Go Speaker with 16W Loud Sound & Deeper Bass, 24H Playtime, IPX7 Waterproof, Bluetooth 5.0 TWS Pairing Portable Wireless Speaker for Home, Outdoor (Upgraded)","parse_status_code":12000},"created_at":"2024-08-09 05:11:06","updated_at":"2024-08-09 05:11:32","page":6,"url":"https://www.amazon.com/product-reviews/B07594HZ6Y?reviewerType=all_reviews&pageNumber=6","job_id":"7227541884300710913","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07594HZ6Y?reviewerType=all_reviews&pageNumber=7","asin":"B07594HZ6Y","page":7,"pages":1155,"reviews":[{"id":"R2XWN6U2MA2UE","title":"5.0 out of 5 stars nice speaker and came on time","author":"Amazon Customer","rating":5,"content":"we are in our 80's and our grandkids had a speaker they took outside.. we loved having music outside so we ordered one for ourselves","timestamp":"Reviewed in the United States July 12, 2024","profile_id":"AGTE5E4OHZELHUXKT4HJW3ZOGOQQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3MZNXIFV4K7LU","title":"4.0 out of 5 stars Solid value for a good sounding bluetooth speaker","author":"JB14","rating":4,"content":"I was hesitant, given the price point, but this has surprisingly good sound (bass and treble) compared to others in this price range and slightly higher-priced offerings (e.g., Anker). There are no issues with connectivity, and I haven't tried to go without power yet. Overall, it's worth a try if you're looking for a decent Bluetooth speaker option.","timestamp":"Reviewed in the United States June 12, 2024","profile_id":"AFJPGPN2ZSU3S3L57CRC25NJZ5UA","is_verified":true,"helpful_count":5,"product_attributes":"Color: Black"},{"id":"ROF8DX6P2VA2Y","title":"5.0 out of 5 stars Great little speaker!","author":"K. M.","rating":5,"content":"Love this speaker! Shipped fast, high quality- great price!❤️","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AH4245772AAADEJRCEEBFTN4VUKQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R248ZX9W1V4JAD","title":"5.0 out of 5 stars This speaker rocks, here's why....","author":"The Spicy Texan","rating":5,"content":"Tribit XSound Go Bluetooth Speaker is just the bomb. Even when blasting up the volume to full high there was no distortion. Tribit has excellent well rounded sound, amazing base and surprisingly pleasing clarity. I use Android, and I can even adjust the volume of the speaker on the phone or you can use them together for the ultimate portable speaker experience. Though small it is substantial, almost a pound in weight, and a fit-in-your-hand size. The sound outdoors covers my entire corner-lot huge backyard. The controls on the top are simple, raised rubber, easily pressed, and there are simply only 5 buttons. There are on/off and pairing tones. There is a DC and Aux plug with a rubber cover in the charger plate on the back. It has 4 little tiny rubber feet that will hold it in place even on a flat surface with an incline. If you would like, you could place a piece of velcro on the bottom. Pairing takes just a few seconds, and it paired immediately upon charging the first time. You can answer calls while the speaker is playing by pressing play, and there is a built in microphone that others tell me sounds great when I call them. The Tribit doubles as a speakerphone. How great is that?I easily charge it up in my car usb or with my computer, with the right cables, other charging options would be available. I've played sleep sounds all night long, and it stays charged! You can also keep it plugged in too while using. 24 hours of use is possible before this gem of a speaker needs a charge! It has a red light indicator when it is charging, when it is finished, the light goes off. The charging cord seems less than 2 feet so you may want to get a longer one, but I've not needed one at all. I think with a specific cable it could be connected to a non-bluetooth TV, PC. Connects to Alexa with the word Trib-bit. I have used it and paired it easily with Google Home Mini. I love that it is waterproof! Poolside, hottub, shower or beach...no worries.If you love listening to podcasts, or talk radio, this is the speaker you want! Voice clarity on this is stunning, and I can hear it throughout my house if I have to walk away for a moment! As long as you have the speaker paired, you should expect that it would work with any app that has sound on your phone.There is a wrist strap connected to one end of the speaker for carrying, hanging. I purchased the gray Aenllosi Hard Shell Case light weight case to go with my black Tribit.When the battery is low, it announces in a realistic male voice that \"Battery is Low\"When it is charging at the same time as on, the indicator light is a combination of red and blue, so you can easily know it is plugged in and on. When it is fully charged, the charge indicator light turns off.I hope that this review helps someone on the fence to just get this jewel of a speaker!UPDATE 5/17/24: I have two of these speakers I got in 2020. One quit charging a year ago, nevermind I've used that particular speaker only a couple of dozen times. In looking at the questions on this product, I see many people have their speakers quit charging, MANY. That is disappointing. I will attempt to reach the company but despite the hours I put this speaker on the charger, it still blinks red and shows only 30% charged. I will attempt to contact the manufacturer and come back with their solution. Their solution was simple. Turn on the unit, press the + and - signs simultaneously and this resets the unit. It worked and started charging. Hopefully this helps others.","timestamp":"Reviewed in the United States February 16, 2019","profile_id":"AF4G5HYJFLRFJXLFPPBJNVDYO5HA","is_verified":true,"helpful_count":16,"product_attributes":"Color: Black"},{"id":"R2ZWFZH2NXHOG","title":"5.0 out of 5 stars Small but Loud","author":"Amazon Customer-breton9","rating":5,"content":"We decided to get a new, state-of-art portable speaker for our outdoor patio. We were interested in its portability and bluetooth connectivity, in addition to decent sound quality. After some research we ended up with small Tribit because it's very affordable price but because other people had commented positively on its capabilities. We definitely like and enjoy our new Tribit in our outdoor garden-battery life is good as we have played it non-stop outdoors for a 5 hour stretch. The sound quality is very good even with some bass notes. We plan to take the Tribit on our vacations and to our second home in Latin America. This is a good, affordable buy over some of the really expensive offerings.","timestamp":"Reviewed in the United States May 15, 2024","profile_id":"AGA7H5URZ5RTQ23REOUI27YISUQA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1TW04UXN4CTRN","title":"4.0 out of 5 stars Surprisingly great!","author":"Fantom.XR7","rating":4,"content":"I was not expecting much when I purchased this but it has been great! I use it mainly when I shower (lol) so it's gotten wet and it's fallen a couple of times but it's held up pretty well.The sound quality is decent, the battery lasts a long time, and the bass is punchy.My only gripe is that it's rounded so I can't set it up vertically and when it's on a smooth suface since it vibrates cause of the sound it will move and fall off where placed. The feet at the bottom that are supposed to prevent that don't do a very good job of keeping it stable. Other than that it's great.","timestamp":"Reviewed in the United States May 2, 2024","profile_id":"AE7UG2RAELNAZ4NEC2XPQUZJMFGA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R321IZZFCGY40O","title":"4.0 out of 5 stars Great sound quality, poor Bluetooth range","author":"David Poore","rating":4,"content":"Nearly everything about it is great except for it's range. As soon as I put my phone on my pocket, the sound starts cutting out","timestamp":"Reviewed in the United States June 8, 2024","profile_id":"AGJLMG4YPFNVHG2K3OQIYEDP42DQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R119TWMX18KYD9","title":"5.0 out of 5 stars Not very durable.","author":"Joyce","rating":5,"content":"When new, the sound quality is pretty good. It's easy to connect to a bluetooth device and consumer friendly. The drawback is that you can only expect this speaker to last 2 years or so before the bluetooth begins to malfunction or quit working entirely. Two speakers in slightly over 3 years have proven to me that Tribit isn't the way to go.","timestamp":"Reviewed in the United States June 14, 2024","profile_id":"AEVBOCQPP6UU253TK7DERQJ5K2HA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1I0N6AMAUAYQ0","title":"5.0 out of 5 stars Audio Dynamite comes in small packages","author":"MC Young","rating":5,"content":"outstanding sound, incredible battery life, and very durable (my 60 lb. rescue failure used it as a chew toy for ~15 min and it endured far better than most of her toys and STILL sounds great)!","timestamp":"Reviewed in the United States June 27, 2024","profile_id":"AEQWA5L7EJ5MLITKRSCLHIIMBMGA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R232O076LB6M05","title":"5.0 out of 5 stars LOVE IT!!!","author":"tyjenks","rating":5,"content":"I absolutely love this speaker! I was looking for a durable and mobile speaker that has clear and good sound with solid bass and this checks all the boxes. If you are unsure about spending a few extra dollars and you want to go with the cheaper speaker, don’t do it and spend the extra money to get this.","timestamp":"Reviewed in the United States June 15, 2024","profile_id":"AF4E7BXVR6LXFJXHN7U5XO3ITYGQ","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B07594HZ6Y","product_name":"Tribit Bluetooth Speaker, XSound Go Speaker with 16W Loud Sound & Deeper Bass, 24H Playtime, IPX7 Waterproof, Bluetooth 5.0 TWS Pairing Portable Wireless Speaker for Home, Outdoor (Upgraded)","parse_status_code":12000},"created_at":"2024-08-09 05:11:06","updated_at":"2024-08-09 05:11:33","page":7,"url":"https://www.amazon.com/product-reviews/B07594HZ6Y?reviewerType=all_reviews&pageNumber=7","job_id":"7227541884300710913","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07594HZ6Y?reviewerType=all_reviews&pageNumber=8","asin":"B07594HZ6Y","page":8,"pages":1155,"reviews":[{"id":"R3VSTIWVDTWXZI","title":"5.0 out of 5 stars Incredible clear sound","author":"DJ Short","rating":5,"content":"Three words—-I LOVE IT!","timestamp":"Reviewed in the United States July 18, 2024","profile_id":"AESID4P4S3YSVVLLVBPFEFGI76YA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R5L047VAN4GPV","title":"5.0 out of 5 stars Big boom for your buck","author":"Allison K","rating":5,"content":"Got this listen to music and podcasts in my backyard. Sound quality is not top-tier, but really good for the price. (Gets a little tinny at high volume).I had an issue with it charging and Tribit Customer Service responded immediately and was wonderful…showed me how to reset and no problems since. Highly recommended","timestamp":"Reviewed in the United States June 20, 2024","profile_id":"AEB5O4WS3T5LD3QNXY3BHVPT5OLQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1Y64EDN3FDSI5","title":"5.0 out of 5 stars OLD DOG LEARNS NEW TRICK!","author":"Dick S.","rating":5,"content":"Being a senior, I don't easily relate to any product that has words like \"Bluetooth\" prominently displayed in the instructions. Admittedly, it took me much longer than the average seven-year-old to figure this thing out. But once I did, Kate bar the door! Absolutely terrific sound and its' ease of use even has an old dog like me, acting like I know what I'm doing. Great charging life, common-sense controls, and totally portable. Only wish I had bought one years ago!","timestamp":"Reviewed in the United States June 6, 2024","profile_id":"AHLAHWT63S6IHS5HJPJY2NHWCYTQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1W7K1CGZ7OEU","title":"5.0 out of 5 stars My best purchase on Amazon","author":"Ulvi Babayev","rating":5,"content":"Works and sounds amazing like high end speakers.","timestamp":"Reviewed in the United States July 10, 2024","profile_id":"AGQT7R64PNGWWYOG3HFF26JJBJ6A","is_verified":true,"product_attributes":"Color: Black"},{"id":"RT4WUPSO0FRDL","title":"5.0 out of 5 stars Small but mighty","author":"BigBlock","rating":5,"content":"I like the build quality, compact size and audio output. Pairing was quick and control buttons are user friendly. Order arrived quickly in sturdy factory carton. Price makes this little jewel a real value. Highly recommend.","timestamp":"Reviewed in the United States June 27, 2024","profile_id":"AHRKS6IMKOXHQ242VJ55ZWK3GJHQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3ULYEM2COB1O3","title":"5.0 out of 5 stars Great product for a great price","author":"Peter B Schuyler","rating":5,"content":"In my household we have:Anker original Soundcore , 7 yrs old. Battery has weakened but still an amazing little speaker.Doss original Soundbox Touch, 5 yrs old. Also a good speaker similar to the Anker.A pair of Doss Soundbox XL speakers. For the price these speakers can’t be beat when looking for a non portable Bluetooth speaker. They can be moved but I don't think of them as portable speakers.JBL Flip4. Indestructible and great sound.Why did I buy the Tribit XSound Go? My top criteria when looking for a new speaker was that it would slide in and out of a pants pocket or pouch pocket of a sweatshirt easily. The shape, size and weight of the Tribit XSound Go is perfect for that. The Tribit's loudness is equal to the JBL Flip4 but I would say the sound quality of the JBL Flip4 is slightly better however, I wouldn't argue with people who prefer the sound of the Tribit. Lastly, the build quality of the Tribit is very good.For a price of around $35 the Tribit XSound Go is a fantastic speaker.","timestamp":"Reviewed in the United States March 21, 2024","profile_id":"AHX2DTBW45MWNVAJ55XCOLSP3TAQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R7CODX7VP2A8O","title":"5.0 out of 5 stars Very good","author":"Amazon Customer","rating":5,"content":"For a small speaker it’s great","timestamp":"Reviewed in the United States July 11, 2024","profile_id":"AFRSPJH4BSLDNM5Y7TTTUDBTDOOQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R18COQAVD21V59","title":"4.0 out of 5 stars Good Volume","author":"Clyde","rating":4,"content":"This speaker has very adequate volume. Doesn't have the deeper basd6that my Bose Soundlink has, but at the cost of this speaker I didn't expect it to. I wanted a portable waterproof speaker to have on my boat and this one seems to be what I need.","timestamp":"Reviewed in the United States June 2, 2024","profile_id":"AH4AK5NITU2TOX6VDBWYLC7KF5JQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3QM6EDWXTYED9","title":"5.0 out of 5 stars Sound is very good","author":"Cheryl Unangst","rating":5,"content":"For the price I was surprised on how loud and clear this is. I have a more expensive brand pill speaker. And honestly this sounds better.","timestamp":"Reviewed in the United States June 25, 2024","profile_id":"AGCCDUBHVTEEJZCVPFD224TXASDA","is_verified":true,"product_attributes":"Color: Black"},{"id":"ROXBN8NEGCG9O","title":"5.0 out of 5 stars Great sound","author":"Laureen Finnell","rating":5,"content":"It has a powerful sound , not tinny ! Charged up great , easy to use ! Had it one day , so hopefully it lasts !","timestamp":"Reviewed in the United States June 26, 2024","profile_id":"AFXVCLM7WFK5NZE7VJ2TYQFZ4IKA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B07594HZ6Y","product_name":"Tribit Bluetooth Speaker, XSound Go Speaker with 16W Loud Sound & Deeper Bass, 24H Playtime, IPX7 Waterproof, Bluetooth 5.0 TWS Pairing Portable Wireless Speaker for Home, Outdoor (Upgraded)","parse_status_code":12000},"created_at":"2024-08-09 05:11:06","updated_at":"2024-08-09 05:11:35","page":8,"url":"https://www.amazon.com/product-reviews/B07594HZ6Y?reviewerType=all_reviews&pageNumber=8","job_id":"7227541884300710913","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07594HZ6Y?reviewerType=all_reviews&pageNumber=9","asin":"B07594HZ6Y","page":9,"pages":1155,"reviews":[{"id":"R1EKCN6KXTMNC9","title":"5.0 out of 5 stars Great sound","author":"Lori C.","rating":5,"content":"Good little speaker. I use in the bathroom when I'm getting ready for my day. It sounds great. Battery life is really good. I've got nothing bad to say about this speaker.","timestamp":"Reviewed in the United States June 20, 2024","profile_id":"AFNNLR3ZFQDM4TYS6NYLIEKVZWDA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3ML81M9R3TDJG","title":"5.0 out of 5 stars Tribit Bluetooth Speaker","author":"XYZ","rating":5,"content":"Very nice sound for portable speaker,Not a powerful bass but better than other small speakers that I've had like it's sizeGood battery life too","timestamp":"Reviewed in the United States June 26, 2024","profile_id":"AEIA2CPREDWTNUFH6AXQPKFNWPGQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3GXACKGCTZTHD","title":"5.0 out of 5 stars Impressive Speaker","author":"Davis","rating":5,"content":"Impressive little speaker, great sound, better than I expected for it's size and price, all top quality. Clear sound, highs, mids, lows, it's all there. Not a junk speaker, I was surprised how heavy it was. Connecting with Bluetooth took just a few seconds, manual is easy to read. I'd definitely recommend this and would buy another.","timestamp":"Reviewed in the United States June 2, 2024","profile_id":"AE5L4TLGJEZPFP5PPDX7UNJN3X5Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3EAEK23DR4RFI","title":"5.0 out of 5 stars Wonderful sound","author":"BAF","rating":5,"content":"I love this speaker. It connected with my phone very easily. Also delivers great sound quality--much better than I expected from a small speaker. Definitely recommend.","timestamp":"Reviewed in the United States June 21, 2024","profile_id":"AFUGGABKF5HVVOR5A7MVUSRSLCIQ","is_verified":true,"product_attributes":"Color: Blue"},{"id":"RS5Z6ZGQ39JF4","title":"5.0 out of 5 stars Loud and clear.","author":"John G.","rating":5,"content":"This speaker is awesome, pairs up quickly and the audio is loud and crystal clear. Nice speaker for the garage or anywhere for the price!","timestamp":"Reviewed in the United States June 24, 2024","profile_id":"AF5VTKZGZ6T3NNG3GMYI2WLAXPPA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3GVE73MOCR0V5","title":"5.0 out of 5 stars Great sound, especially bass.","author":"Public Name","rating":5,"content":"For the money, it's a great little speaker. Good bass and quality stays with the volume. It will sync up with another one for stereo and I'm going to get one. Quite a bargain.","timestamp":"Reviewed in the United States June 11, 2024","profile_id":"AHL3XDB2VZVLFQ4OWWR5PIUPS7CQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1Q5E6NU13A93T","title":"4.0 out of 5 stars Sound stops when the volume changes","author":"Lasts Forever","rating":4,"content":"All sound stops when increasing decreasing the volume","timestamp":"Reviewed in the United States June 9, 2024","profile_id":"AG4MZSRNYXKNYQHSDIRZRBVAH2GA","is_verified":true,"product_attributes":"Color: Blue"},{"id":"R1I54RKAY03VE4","title":"4.0 out of 5 stars Solid. Excellent value","author":"Lon Koenig","rating":4,"content":"I feel it is lacking on the high-end frequencies, but I've only been running it at lower volumes. It has plenty of power for a bedroom.","timestamp":"Reviewed in the United States May 28, 2024","profile_id":"AHNBLMKC2B5KEC24RHF5F5OX4X4Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1XWAHOK4IPNYK","title":"4.0 out of 5 stars Good sound","author":"Amazon Customer","rating":4,"content":"Good sound but wish the battery life was longer","timestamp":"Reviewed in the United States June 5, 2024","profile_id":"AGSO5GRJGZXN73TKGKMU5O3IAGVQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R12NODV4T93G09","title":"5.0 out of 5 stars It is a very nice small speaker with a BIG sound!","author":"Amazon Customer","rating":5,"content":"I am very happy with this product. I also liked the cost!","timestamp":"Reviewed in the United States July 1, 2024","profile_id":"AG5V6H3RBWTWKKCO5TFHUMJTYIOA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B07594HZ6Y","product_name":"Tribit Bluetooth Speaker, XSound Go Speaker with 16W Loud Sound & Deeper Bass, 24H Playtime, IPX7 Waterproof, Bluetooth 5.0 TWS Pairing Portable Wireless Speaker for Home, Outdoor (Upgraded)","parse_status_code":12000},"created_at":"2024-08-09 05:11:06","updated_at":"2024-08-09 05:11:36","page":9,"url":"https://www.amazon.com/product-reviews/B07594HZ6Y?reviewerType=all_reviews&pageNumber=9","job_id":"7227541884300710913","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07594HZ6Y?reviewerType=all_reviews&pageNumber=10","asin":"B07594HZ6Y","page":10,"pages":1,"reviews":[{"id":"R1TASMCC5TB4DC","title":"4.0 out of 5 stars Great powerful litttle speaker with decent battery life","author":"Jazzsticks","rating":4,"content":"If you are looking for a good value speaker I would reccomend this unit. It can get quite loud and the bass very punchy however do not forget to charge it. The battery depletes somewhat faster than I'd like and I'm met with a \"battery low\" strange voice over 5 minutes or so before the unit power down. I would appreciate a light bar or warning that gives me a solid 15 minutes of listening before I have to recharge it. Battery aside this speaker does more than enough for casual to intense listening and using it in the bathroom during showers is primarily what I do with it. It meets my needs. I sometimes take it out on the basketball field and I can hear it in the distance properly. I know they make better sounding speakers but Tribit did not let me down and I found good value in this speaker for the most part.","timestamp":"Reviewed in the United States February 27, 2024","profile_id":"AGO7ZBLFUKMGC7TSUYCHUVPUJW6A","is_verified":true,"product_attributes":"Color: Black"},{"id":"RAFW6XH0FJ71F","title":"3.0 out of 5 stars Meh, seems as advertised but some initial quality issues","author":"Tom H.","rating":3,"content":"Too early to tell how finicky this speaker might be, so I will update review as needed. Sound is good enough, but I had no high bars in this price range anyway. Bass is weak (as expected), but midrange and highs sound a little crisper than my Maxsound Plus unit purchased a little over a year ago. The case, which is a textured soft plastic material, seemed smudgy and the USB-C connector was a little loose - making it seem like this was a slightly used unit re-packaged as new. Bummer if true.","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AEMH3VIUIGJ363MNQUQAF734MMXA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3BEUCD13EVMGJ","title":"5.0 out of 5 stars It’s portable","author":"Karen Dolan","rating":5,"content":"Needs to be hooked up to a smart tv - works really well. Volume control is easy to use.","timestamp":"Reviewed in the United States June 23, 2024","profile_id":"AHVR4XIJAFTR4TRPPXIBFX7UI2IQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2NBQ6H8N0OX","title":"5.0 out of 5 stars Super tough, reliable and portable speaker with AWESOME sound quality that is AFORDABLE! LOVE IT! 😍","author":"QueenB","rating":5,"content":"I bought this speaker to go with our Echo Dot because I had heard that the Dot speaker is nice, but not great. I couldn't be happier with that decision! The speaker on the Dot is ok, but it's not good enough to use when we have people over, while we're outside playing, or while we're swimming. This little speaker is AMAZING!!! It charges quickly, the charge lasts through all day use and it is LOUD! And loud in a good way! We listen to all types of music - rock, rap, r&b, country, pretty much anything - and the sound quality is spot on, no matter what type of music we're listening to! The other day I connected the speaker to my phone and played some music from the Amazon music app while we were in the pool. I left my phone on the porch, about 50-55 feet away, so it wouldn't get wet and had the speaker on a table right next to the pool. It never lost the signal from my phone and at about a little over half the volume it was loud enough to be heard over the kids (and I have a 3 year old and an 11 year old that don't believe in talking, they prefer yelling), the pool filter running and an attachment we have for the pool that turns the clean water from the filter into a fountain that gets pretty noisy. We were in the pool for about 2 hours and the speaker got pretty wet from all the splashing (though it never got totally soaked or submerged) and it's still working like it was brand new. What I was most concerned about was it's ability to survive being dropped or whacked against something pretty hard because my 3 year old can be brutal to toys, or pretty much anything she gets her hands on! So far, it's been dropped at least 3 times, knocked into the wall twice while she was holding it and dancing/spinning and sat on about 5 times because she always ends up leaving it on the couch or chair (both of which are dark brown) instead of a table and sure enough someone (including my 140lb self) ends up plopping down on it. No damage to the speaker AT ALL!!! For spending just under $30 I feel like we got more than our money's worth! If I do one day have an issue with the speaker, I'm fairly confident this seller's customer service would be more than helpful with resolving any problems. I say this because they reached out to me after I bought the speaker to thank me for my purchase and to provide their contact information should I have any questions, concerns, or issues. About a week after I received the speaker they touched base with me once more to thank me again for the purchase, to say they hoped that I was happy with the product and to let me know that they were always available to help in any way possible. Now I know that actions speak louder than words, but since I have been more than happy with this speaker I have had no reason to put their \"always here to help\" claim to the test. If I should ever have to contact customer service in the future, I will update my review. I apologize for the length of my review, but I'm just so happy with this little speaker! I usually don't leave reviews because most of what I purchase on Amazon turns out to be just what I expected, no more and no less. But I've been so impressed by this Tribit speaker that I felt I had to share my experience. I hope this is helpful to anyone trying to decide if they should click that purchase button on this item. If you do, I sincerely believe that you will not be disappointed!!! 😄","timestamp":"Reviewed in the United States July 27, 2018","profile_id":"AE4G7A6YVUU2P7UCWX64RIW3GM4A","is_verified":true,"helpful_count":49,"product_attributes":"Color: Black"},{"id":"R3U58TQTQM4IYF","title":"5.0 out of 5 stars Perfect sound","author":"Sarah Deger","rating":5,"content":"Nice little speaker for the money. Would recommend!","timestamp":"Reviewed in the United States July 1, 2024","profile_id":"AFBCRZB726ACYUIGDKJ6UI24SU6Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"RSXJ366Z835OL","title":"5.0 out of 5 stars Sound","author":"Musoke","rating":5,"content":"Good sound quality for a small speaker.. 😁","timestamp":"Reviewed in the United States July 1, 2024","profile_id":"AHAFFGEBI5437GKWYE5PYTWPJ4CA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2VRMY52OTT35K","title":"5.0 out of 5 stars Excelente!!!","author":"Lucas Esteban Rueda","rating":5,"content":"Estoy impresionado con la calidad del sonido y el dispositivo! Muy recomendable","timestamp":"Reviewed in the United States June 19, 2024","profile_id":"AERFQPO5ASFW62RR4VNXAKKVQAIA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3HNX3MIJ53PD","title":"5.0 out of 5 stars High quality portability","author":"Big Charlie","rating":5,"content":"Love it. Great sound, long battery life, solid construction and water proof.","timestamp":"Reviewed in the United States June 23, 2024","profile_id":"AG3H6RFK5X6WWXN44YHXNM2WAQQA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1XYXXBTDT1DPF","title":"5.0 out of 5 stars Great weight, shape, sound","author":"Isabel","rating":5,"content":"The size is just right.","timestamp":"Reviewed in the United States July 4, 2024","profile_id":"AGYBQUCV2FLYN6HVCLXEJWR6GDEA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RN8U9SGP8AR0U","title":"5.0 out of 5 stars Great speaker","author":"marianna","rating":5,"content":"Amazing speaker. I have it for about 2 years now. Great sound, love that I can take it to the shower, charge stays for a ling time.I charge it probably once in 2 weeks","timestamp":"Reviewed in the United States June 8, 2024","profile_id":"AF3XWIE4HRLKATO2QDEDMZ4BVW4Q","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B07594HZ6Y","product_name":"Tribit Bluetooth Speaker, XSound Go Speaker with 16W Loud Sound & Deeper Bass, 24H Playtime, IPX7 Waterproof, Bluetooth 5.0 TWS Pairing Portable Wireless Speaker for Home, Outdoor (Upgraded)","parse_status_code":12000},"created_at":"2024-08-09 05:11:06","updated_at":"2024-08-09 05:11:38","page":10,"url":"https://www.amazon.com/product-reviews/B07594HZ6Y?reviewerType=all_reviews&pageNumber=10","job_id":"7227541884300710913","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"hc_policy","value":null},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-08-09 05:11:06","domain":"com","geo_location":null,"id":"7227541884300710913","limit":10,"locale":null,"pages":15,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B07594HZ6Y","source":"amazon_reviews","start_page":2,"status":"done","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-08-09 05:11:38","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7227541884300710913","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7227541884300710913/results","method":"GET"},{"rel":"results-content","href_list":["http://data.oxylabs.io/v1/queries/7227541884300710913/results/2/content","http://data.oxylabs.io/v1/queries/7227541884300710913/results/3/content","http://data.oxylabs.io/v1/queries/7227541884300710913/results/4/content","http://data.oxylabs.io/v1/queries/7227541884300710913/results/5/content","http://data.oxylabs.io/v1/queries/7227541884300710913/results/6/content","http://data.oxylabs.io/v1/queries/7227541884300710913/results/7/content","http://data.oxylabs.io/v1/queries/7227541884300710913/results/8/content","http://data.oxylabs.io/v1/queries/7227541884300710913/results/9/content","http://data.oxylabs.io/v1/queries/7227541884300710913/results/10/content","http://data.oxylabs.io/v1/queries/7227541884300710913/results/11/content","http://data.oxylabs.io/v1/queries/7227541884300710913/results/12/content","http://data.oxylabs.io/v1/queries/7227541884300710913/results/13/content","http://data.oxylabs.io/v1/queries/7227541884300710913/results/14/content","http://data.oxylabs.io/v1/queries/7227541884300710913/results/15/content","http://data.oxylabs.io/v1/queries/7227541884300710913/results/16/content"],"method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7227541884300710913/results?type=raw","method":"GET"},{"rel":"results-content-html","href_list":["http://data.oxylabs.io/v1/queries/7227541884300710913/results/2/content?type=raw","http://data.oxylabs.io/v1/queries/7227541884300710913/results/3/content?type=raw","http://data.oxylabs.io/v1/queries/7227541884300710913/results/4/content?type=raw","http://data.oxylabs.io/v1/queries/7227541884300710913/results/5/content?type=raw","http://data.oxylabs.io/v1/queries/7227541884300710913/results/6/content?type=raw","http://data.oxylabs.io/v1/queries/7227541884300710913/results/7/content?type=raw","http://data.oxylabs.io/v1/queries/7227541884300710913/results/8/content?type=raw","http://data.oxylabs.io/v1/queries/7227541884300710913/results/9/content?type=raw","http://data.oxylabs.io/v1/queries/7227541884300710913/results/10/content?type=raw","http://data.oxylabs.io/v1/queries/7227541884300710913/results/11/content?type=raw","http://data.oxylabs.io/v1/queries/7227541884300710913/results/12/content?type=raw","http://data.oxylabs.io/v1/queries/7227541884300710913/results/13/content?type=raw","http://data.oxylabs.io/v1/queries/7227541884300710913/results/14/content?type=raw","http://data.oxylabs.io/v1/queries/7227541884300710913/results/15/content?type=raw","http://data.oxylabs.io/v1/queries/7227541884300710913/results/16/content?type=raw"],"method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7227541884300710913/results?type=parsed","method":"GET"},{"rel":"results-content-parsed","href_list":["http://data.oxylabs.io/v1/queries/7227541884300710913/results/2/content?type=parsed","http://data.oxylabs.io/v1/queries/7227541884300710913/results/3/content?type=parsed","http://data.oxylabs.io/v1/queries/7227541884300710913/results/4/content?type=parsed","http://data.oxylabs.io/v1/queries/7227541884300710913/results/5/content?type=parsed","http://data.oxylabs.io/v1/queries/7227541884300710913/results/6/content?type=parsed","http://data.oxylabs.io/v1/queries/7227541884300710913/results/7/content?type=parsed","http://data.oxylabs.io/v1/queries/7227541884300710913/results/8/content?type=parsed","http://data.oxylabs.io/v1/queries/7227541884300710913/results/9/content?type=parsed","http://data.oxylabs.io/v1/queries/7227541884300710913/results/10/content?type=parsed","http://data.oxylabs.io/v1/queries/7227541884300710913/results/11/content?type=parsed","http://data.oxylabs.io/v1/queries/7227541884300710913/results/12/content?type=parsed","http://data.oxylabs.io/v1/queries/7227541884300710913/results/13/content?type=parsed","http://data.oxylabs.io/v1/queries/7227541884300710913/results/14/content?type=parsed","http://data.oxylabs.io/v1/queries/7227541884300710913/results/15/content?type=parsed","http://data.oxylabs.io/v1/queries/7227541884300710913/results/16/content?type=parsed"],"method":"GET"}]}}